-- MySQL dump 10.13  Distrib 5.7.27, for Linux (x86_64)
--
-- Host: localhost    Database: laravel-shop
-- ------------------------------------------------------
-- Server version	5.7.27-0ubuntu0.18.04.1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `article_tag`
--

DROP TABLE IF EXISTS `article_tag`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `article_tag` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `article_id` int(10) unsigned NOT NULL,
  `tag_id` int(10) unsigned NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `article_tag`
--

LOCK TABLES `article_tag` WRITE;
/*!40000 ALTER TABLE `article_tag` DISABLE KEYS */;
INSERT INTO `article_tag` VALUES (1,1,1,NULL,NULL,NULL);
/*!40000 ALTER TABLE `article_tag` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `articles`
--

DROP TABLE IF EXISTS `articles`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `articles` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `category_id` int(10) unsigned NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `slug` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `content` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `image` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `status` enum('PUBLISHED','DRAFT') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'PUBLISHED',
  `date` date NOT NULL,
  `featured` tinyint(1) NOT NULL DEFAULT '0',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `articles`
--

LOCK TABLES `articles` WRITE;
/*!40000 ALTER TABLE `articles` DISABLE KEYS */;
INSERT INTO `articles` VALUES (1,1,'2020年隆回共读书房成立了','2020','<p>2020年隆回共读书房成立了</p>',NULL,'PUBLISHED','2020-02-29',0,'2020-02-29 01:49:13','2020-02-29 01:51:17',NULL);
/*!40000 ALTER TABLE `articles` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `book_keyword`
--

DROP TABLE IF EXISTS `book_keyword`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `book_keyword` (
  `book_id` int(10) unsigned NOT NULL,
  `keyword_id` int(10) unsigned NOT NULL,
  PRIMARY KEY (`book_id`,`keyword_id`),
  KEY `book_keyword_book_id_index` (`book_id`),
  KEY `book_keyword_keyword_id_index` (`keyword_id`),
  CONSTRAINT `book_keyword_book_id_foreign` FOREIGN KEY (`book_id`) REFERENCES `books` (`id`) ON DELETE CASCADE,
  CONSTRAINT `book_keyword_keyword_id_foreign` FOREIGN KEY (`keyword_id`) REFERENCES `keywords` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `book_keyword`
--

LOCK TABLES `book_keyword` WRITE;
/*!40000 ALTER TABLE `book_keyword` DISABLE KEYS */;
/*!40000 ALTER TABLE `book_keyword` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `book_tag`
--

DROP TABLE IF EXISTS `book_tag`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `book_tag` (
  `book_id` int(10) unsigned NOT NULL,
  `tag_id` int(10) unsigned NOT NULL,
  PRIMARY KEY (`book_id`,`tag_id`),
  KEY `book_tag_book_id_index` (`book_id`),
  KEY `book_tag_tag_id_index` (`tag_id`),
  CONSTRAINT `book_tag_book_id_foreign` FOREIGN KEY (`book_id`) REFERENCES `books` (`id`) ON DELETE CASCADE,
  CONSTRAINT `book_tag_tag_id_foreign` FOREIGN KEY (`tag_id`) REFERENCES `tags` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `book_tag`
--

LOCK TABLES `book_tag` WRITE;
/*!40000 ALTER TABLE `book_tag` DISABLE KEYS */;
INSERT INTO `book_tag` VALUES (1,1),(1,2),(1,3);
/*!40000 ALTER TABLE `book_tag` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `books`
--

DROP TABLE IF EXISTS `books`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `books` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `author` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `press` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `press_date` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `price` double DEFAULT NULL,
  `images` json DEFAULT NULL,
  `description` text COLLATE utf8mb4_unicode_ci,
  `details` json DEFAULT NULL,
  `features` json DEFAULT NULL,
  `extras` json DEFAULT NULL,
  `last_chapter` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `read_count` int(11) NOT NULL DEFAULT '0',
  `word_count` int(11) NOT NULL DEFAULT '0',
  `sort` int(11) NOT NULL DEFAULT '0',
  `state` int(11) NOT NULL DEFAULT '1',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `image` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `barcode` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `audio` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `video` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `books`
--

LOCK TABLES `books` WRITE;
/*!40000 ALTER TABLE `books` DISABLE KEYS */;
INSERT INTO `books` VALUES (1,'狼王梦','沈石溪',NULL,NULL,23.4,'[\"images/products/2acd05cacf67f4c3f22fda11c0d4c3f3.png\"]','<p>编辑推荐</p>\r\n\r\n<p>沈石溪，中国当代著名的动物小说作家，被誉为&ldquo;动物小说大王&rdquo;。他的动物小说作品精神内涵丰富厚重，兼具文学性、知识性和社会性，代表了当代动物小说创作领域的重要成就。在精彩的文字之外，他在小说中更提倡一种&ldquo;生态道德&rdquo;，他笔下那些丛林、高山、雪原的动物们，在大自然的生态法则和优胜劣汰的严酷条律下，表现出绝地生存的勇气、荒原绽放的野性和死生悲欢的传奇。</p>\r\n\r\n<p>&ldquo;动物小说大王沈石溪品藏书系&rdquo;是浙少社为沈石溪量身打造的重磅书系，该书系自2008年推出截止2017年12月，陆续出版图书三十余册，整体销售码洋达到六个亿，销售册数近4000万册，缔造了当代童书出版的奇迹。</p>\r\n\r\n<p>2018年恰逢品藏书系出版10周年，也是沈石溪先生动物小说创作四十周年纪念。此次全新升级改版会大致围绕四方面展开：</p>\r\n\r\n<p>首先，将在原先版本的基础上对文字进行细致的编校与修订；第二，优化附录部分的动物档案板块，删减不必要不准确的文字，增添与时俱进的内容；第三，丰富作者创作谈和序言部分；第四，在保留原封面经典设计元素和视觉效果的基础上，对升级版进行有效优化与提升，以更好地适应当下市场的审美需求和出版品味。</p>\r\n\r\n<p>品藏书系升级版将分批次有序推出，计划先推出作者代表性与影响力的36部作品。</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>内容简介</p>\r\n\r\n<p>&nbsp; &nbsp; &nbsp; 本书写的是一匹充满智慧的狼，用一生的时间来完成自己的梦想。丈夫没了，还有儿子，儿子没了，还有女儿。为了那梦寐以求的狼王宝座，它浪费了大量青春，它葬送了美好爱情，它放弃了宝贵生命。命运之神啊，为何总是与它擦肩而过？它走了，只留下无限遗憾和永久的梦&hellip;&hellip;</p>\r\n\r\n<p>作者简介</p>\r\n\r\n<p>&nbsp; &nbsp; &nbsp; 沈石溪，著名儿童文学作家，被誉为&ldquo;中国动物小说大王&rdquo;。中国作家协会儿童文学委员会委员、上海作家协会理事，曾获中国作家协会全国优秀儿童文学奖、中国图书奖、冰心儿童文学新作奖大奖、台湾杨唤儿童文学奖等多种奖项，是少有的连续数届荣获全国优秀儿童文学奖的实力作家。<br />\r\n　　沈石溪的作品自八十年代即在文坛引起瞩目，其以《狼王梦》《第七条猎狗》《最后一头战象》《再被狐狸骗一次》《混血豺王》等为代表的作品，历经岁月洗礼而在读者群中风靡不衰。其作品在台湾以及东南亚等地都享有盛誉。</p>\r\n\r\n<p>目　　录</p>\r\n\r\n<p>狼王梦<br />\r\n第一章 绝境分娩<br />\r\n第二章 培养黑仔<br />\r\n第三章 魂断捕兽夹<br />\r\n第四章 重塑王者品性<br />\r\n第五章 寄望后代<br />\r\n第六章 血洒碧空<br />\r\n狼种<br />\r\n一 被淘汰的警犬<br />\r\n二 阴差阳错进了马戏团<br />\r\n三 扮演大灰狼<br />\r\n四 鲜花和掌声不属于它<br />\r\n五 遭哈巴狗暗算<br />\r\n六 恶狼？好狗？<br />\r\n七 野外遭遇云豹<br />\r\n八 热血洗冤<br />\r\n动物档案&mdash;&mdash;狼<br />\r\n闯入动物世界<br />\r\n获奖记录<br />\r\n珍藏相册</p>',NULL,NULL,'{\"meta_title\": \"狼王梦（升级版）/动物小说大王沈石溪·品藏书系\", \"meta_keywords\": null, \"extra_features\": null, \"meta_description\": null}',NULL,0,0,0,1,'2020-02-29 08:35:33','2020-02-29 09:05:19','uploads/images/products/69962887a9e8f543d4567d1b39970ddc.jpg',NULL,NULL,NULL),(2,'骆驼祥子','老舍',NULL,NULL,35.69,'[]','<p>作者简介</p>\r\n\r\n<p>　　老舍原名舒庆春，字舍予，北京满族正红旗人，原姓舒舒觉罗氏，中国现代著名小说家、文学家、戏剧家,杰出的语言大师,新中国第 1位获得&ldquo;人民艺术家&rdquo;称号的作家。老舍是他常用的笔名，另有笔名絮青、鸿来、非我等。文革期间受到迫害，1966年8月24日深夜，老舍含冤自沉于北京西北的太平湖畔，享年67岁。<br />\r\n　　老舍的作品很多，代表作有《骆驼祥子》《老张的哲学》《四世同堂》《二马》《离婚》《猫城记》《正红旗下》（未完），剧本《残雾》《方珍珠》《面子问题》《春华秋实》《青年突击队》《戏剧集》《柳树井》《女店员》《全家福》《茶馆》，报告文学《无名高地有了名》，中篇小说《月牙儿》《我这一辈子》《出口成章》，短篇小说集《赶集》《樱海集》《蛤藻集》《火车集》《贫血集》及作品集《老舍文集》（16卷）等。其中，最著名的是《茶馆》《龙须沟》《骆驼祥子》《四世同堂》。老舍的一生，总是忘我地工作，他是文艺界当之无愧的&ldquo;劳动模范&rdquo;。</p>\r\n\r\n<p>目　　录</p>\r\n\r\n<p>第 一章车夫祥子<br />\r\n第二章车丢了<br />\r\n第三章逃兵<br />\r\n第四章祥子与骆驼<br />\r\n第五章虎妞<br />\r\n第六章在曹宅拉车<br />\r\n第七章车夫老马<br />\r\n第八章变故<br />\r\n第九章刘四爷做寿<br />\r\n第十章骗婚<br />\r\n第十一章小福子<br />\r\n第十二章难产<br />\r\n第十三章堕落<br />\r\n第十四章最后的希望</p>',NULL,NULL,'{\"meta_title\": \"骆驼祥子\", \"meta_keywords\": null, \"extra_features\": null, \"meta_description\": \"骆驼祥子\"}',NULL,0,0,0,1,'2020-02-29 09:10:00','2020-03-09 15:11:53','uploads/images/products/49651bbfcd0dba5980b9e4c35e4e1c7d.jpg','9100219232','books/audio/e54c041898b836434d892533dc9455a7.mp3',NULL),(5,'青铜葵花','曹文轩',NULL,NULL,NULL,'[]','<p>编辑推荐</p>\r\n\r\n<p>入选美国《纽约时报》《华尔街日报》《出版者周刊》三大图书榜2017年度榜；&nbsp;</p>\r\n\r\n<p>曹文轩具有代表性和知名度的作品，感动千万儿童的诚意之作，累计印刷数百次，总印数超1000万册；</p>\r\n\r\n<p>一幅优美诗意的青铜葵花风情画卷，一段感人至深的兄妹情谊，一群善良纯质的人们，一曲关于真情的悠悠赞歌，一个有笑有泪有悲有喜的中国故事；</p>\r\n\r\n<p>内容简介</p>\r\n\r\n<p>这是一个男孩和一个女孩的故事。男孩叫青铜，女孩叫葵花。</p>\r\n\r\n<p>一个特别的机缘，七岁的城女孩葵花和乡村男孩青铜成了兄妹相称的朋友。他们一起生活，一起长大。但十二岁那年，女孩葵花被命运召回了她的城市，男孩青铜从此常常遥望着芦荡的尽头，遥望着女孩葵花所在的地方&hellip;&hellip;</p>\r\n\r\n<p>作品写尽苦难，将苦难写到深刻；写尽美好，将美好写到极致；写尽大爱，将大爱写到充满生机与情意。这种对苦难、对美好、对大爱的细腻描写和咏叹宛如一股温暖清澈的春水，将湿润和纯净每一个读者的眼睛和心灵，牵引人们完成对生命中真、善、美的永恒追寻。作品人物独特鲜活，叙事简洁流畅，文字纯净唯美，意境高雅清远，情感真挚深沉，字里行间无不充盈着感人肺腑、震撼人心的人间真情，无不闪耀着人道主义的光辉。</p>\r\n\r\n<p>作者简介</p>\r\n\r\n<p>曹文轩，北京大学教授、博士生导师，中国作家协会全国委员会委员，北京市作家协会副主席。2016年获得国际安徒生奖。</p>\r\n\r\n<p>主要作品有长篇小说《山羊不吃天堂草》《草房子》《红瓦黑瓦》《根鸟》《细米》《青铜葵花》《天瓢》以及&ldquo;大王书&rdquo;系列、&ldquo;我的儿子皮卡&rdquo;系列和&ldquo;丁丁当当&rdquo;系列等。</p>\r\n\r\n<p>主要学术著作有《中国八十年代文学现象研究》《第二世界――对文学艺术的哲学解释》《二十世纪末中国文学现象研究》《小说门》等。</p>\r\n\r\n<p>《红瓦》《草房子》《根鸟》《细米》《天瓢》《青铜葵花》以及一些短篇小说分别被译为英、法、德、日、韩等文字。</p>\r\n\r\n<p>获国内外权威学术奖、文学奖四十余种，其中包括国际安徒生提名奖、中国安徒生奖、国家图书奖、&ldquo;五个一工程&rdquo;优秀作品奖、中国图书奖、全国优秀儿童文学奖、宋庆龄儿童文学金奖、冰心文学奖大奖、金鸡奖*编剧奖、中国电影华表奖、德黑兰国际电影节&ldquo;金蝴蝶&rdquo;奖等奖项。</p>\r\n\r\n<p>目　　录</p>\r\n\r\n<p>第一章 小木船<br />\r\n第二章 葵花田<br />\r\n第三章 老槐树<br />\r\n第四章 芦花鞋<br />\r\n第五章 金茅草<br />\r\n第六章 冰项链<br />\r\n第七章 三月蝗<br />\r\n第八章 纸灯笼<br />\r\n第九章 大草垛<br />\r\n美丽的痛苦（代后记）</p>',NULL,NULL,'{\"meta_title\": null, \"meta_keywords\": null, \"extra_features\": null, \"meta_description\": null}',NULL,0,0,0,1,'2020-03-09 14:00:23','2020-03-09 14:00:23','uploads/images/products/2bdf570679f79e565c9bb2794022b99e.jpg','9787534633362',NULL,NULL),(6,'窗边的小豆豆','（日）黑柳彻子',NULL,NULL,NULL,'[]','<p>影响20世纪的儿童文学杰作，入选九年制义务教育小学语文课本</p>\r\n\r\n<p>中文简体版已突破1100万册，连续10年名列开卷全国畅销书排行榜，2017年位居少儿类榜单首位</p>\r\n\r\n<p>孙云晓、曹文轩、梅子涵、伍美珍、张弘等教育专家联袂推荐</p>\r\n\r\n<p>新华社、《人民日报》、《中国教育报》、中央电视台深度报道；《新京报》、当当网、新浪网年度图书</p>\r\n\r\n<p>联合国儿童基金会主席JamesP.Grant说：再也没有比她更了解孩子的了。</p>\r\n\r\n<p>新版隆重上市，更温柔纯真，美观大方，适合亲子共读</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>内容简介</p>\r\n\r\n<p>《窗边的小豆豆》是一部影响20世纪的儿童文学杰作，讲述了作者黑柳彻子上小学时一段真实的故事。</p>\r\n\r\n<p>小豆豆因淘气被原学校退学后，来到巴学园。在小林校长的爱护和引导下，一般人眼里&ldquo;怪怪&rdquo;的小豆豆逐渐成了一个大家都能接受的孩子，并奠定了她一生的基础。</p>\r\n\r\n<p>世界上可怕的事情，莫过于有眼睛却发现不了美，有耳朵却不会欣赏音乐，有心灵却无法理解什么是真。不会感动，也不会充满激情。《窗边的小豆豆》不仅带给千万读者无数的笑声和感动，而且为现代教育的发展注入了新的活力，成为全世界极有影响的作品之一。</p>\r\n\r\n<p>作者简介</p>\r\n\r\n<p>黑柳彻子</p>\r\n\r\n<p>日本作家，电视节目主持人，联合国儿童基金会亲善大使。</p>\r\n\r\n<p>1981年，她根据童年在巴学园的经历，创作了脍炙人口的《窗边的小豆豆》，在日本创下有史以来图书销量的纪录，并被译为35种语言，感动了全世界数以千万计的读者。</p>\r\n\r\n<p>1984年，她被联合国儿童基金会任命为亚洲首位亲善大使。</p>\r\n\r\n<p>中文简体版《窗边的小豆豆》由新经典文化股份有限公司于2003年引进，2017年6月发行量突破1000万册。</p>\r\n\r\n<p>目　　录</p>\r\n\r\n<p>第壹次来车站</p>\r\n\r\n<p>窗边的小豆豆</p>\r\n\r\n<p>新学校</p>\r\n\r\n<p>我喜欢！</p>\r\n\r\n<p>校长先生</p>\r\n\r\n<p>盒饭</p>\r\n\r\n<p>从今天开始上学</p>\r\n\r\n<p>电车教室</p>\r\n\r\n<p>上课</p>\r\n\r\n<p>海的味道、山的味道</p>\r\n\r\n<p>好好嚼啊</p>\r\n\r\n<p>散步</p>\r\n\r\n<p>校歌</p>\r\n\r\n<p>放回原处</p>\r\n\r\n<p>名字的由来</p>\r\n\r\n<p>落语</p>\r\n\r\n<p>电车来了！</p>\r\n\r\n<p>游泳池</p>\r\n\r\n<p>成绩单</p>\r\n\r\n<p>暑假开始了</p>\r\n\r\n<p>大冒险</p>\r\n\r\n<p>试胆量</p>\r\n\r\n<p>排练场</p>\r\n\r\n<p>温泉旅行</p>\r\n\r\n<p>韵律操</p>\r\n\r\n<p>一生的心愿</p>\r\n\r\n<p>最差的衣服</p>\r\n\r\n<p>高桥君</p>\r\n\r\n<p>不能跳！</p>\r\n\r\n<p>&ldquo;然后呢&hellip;&hellip;&rdquo;</p>\r\n\r\n<p>只是闹着玩</p>\r\n\r\n<p>运动会</p>\r\n\r\n<p>小林一茶</p>\r\n\r\n<p>非常奇怪</p>\r\n\r\n<p>用手说话</p>\r\n\r\n<p>泉岳寺</p>\r\n\r\n<p>正男！</p>\r\n\r\n<p>小辫子</p>\r\n\r\n<p>&ldquo;ThankYou.&rdquo;</p>\r\n\r\n<p>图书室</p>\r\n\r\n<p>尾巴</p>\r\n\r\n<p>第二个春天</p>\r\n\r\n<p>天鹅湖</p>\r\n\r\n<p>&ldquo;旱田&rdquo;老师</p>\r\n\r\n<p>野炊</p>\r\n\r\n<p>&ldquo;真是一个好孩子！&rdquo;</p>\r\n\r\n<p>新娘</p>\r\n\r\n<p>破学校</p>\r\n\r\n<p>蝴蝶结</p>\r\n\r\n<p>慰问</p>\r\n\r\n<p>健康树皮</p>\r\n\r\n<p>说英语的孩子</p>\r\n\r\n<p>演出会</p>\r\n\r\n<p>粉笔</p>\r\n\r\n<p>泰明死了</p>\r\n\r\n<p>间谍</p>\r\n\r\n<p>小提琴</p>\r\n\r\n<p>一言为定！</p>\r\n\r\n<p>洛基不见了</p>\r\n\r\n<p>茶话会</p>\r\n\r\n<p>再见，再见</p>\r\n\r\n<p>后记</p>\r\n\r\n<p>文库本后记</p>',NULL,NULL,'{\"meta_title\": null, \"meta_keywords\": null, \"extra_features\": null, \"meta_description\": null}',NULL,0,0,0,1,'2020-03-09 14:05:27','2020-03-09 14:05:27','uploads/images/products/cd0281531c116133c6ebf54cee5d4786.jpg','9787544288590',NULL,NULL);
/*!40000 ALTER TABLE `books` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `categories`
--

DROP TABLE IF EXISTS `categories`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `categories` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `parent_id` int(11) DEFAULT '0',
  `lft` int(10) unsigned DEFAULT NULL,
  `rgt` int(10) unsigned DEFAULT NULL,
  `depth` int(10) unsigned DEFAULT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `slug` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL,
  `imageable_id` int(11) DEFAULT NULL,
  `imageable_type` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `categories_slug_unique` (`slug`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `categories`
--

LOCK TABLES `categories` WRITE;
/*!40000 ALTER TABLE `categories` DISABLE KEYS */;
INSERT INTO `categories` VALUES (1,NULL,NULL,NULL,NULL,'教育1','1','2020-02-29 01:40:42','2020-02-29 01:40:42',NULL,NULL,NULL);
/*!40000 ALTER TABLE `categories` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `chapters`
--

DROP TABLE IF EXISTS `chapters`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `chapters` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `url` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `content` text COLLATE utf8mb4_unicode_ci,
  `details` json DEFAULT NULL,
  `features` json DEFAULT NULL,
  `extras` json DEFAULT NULL,
  `book_id` int(10) unsigned NOT NULL,
  `read_count` int(11) NOT NULL DEFAULT '0',
  `word_count` int(11) NOT NULL DEFAULT '0',
  `sort` int(11) NOT NULL DEFAULT '0',
  `state` int(11) NOT NULL DEFAULT '1',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `audio` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `video` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `chapters_book_id_foreign` (`book_id`),
  CONSTRAINT `chapters_book_id_foreign` FOREIGN KEY (`book_id`) REFERENCES `books` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `chapters`
--

LOCK TABLES `chapters` WRITE;
/*!40000 ALTER TABLE `chapters` DISABLE KEYS */;
INSERT INTO `chapters` VALUES (1,'第一章 绝境分娩',NULL,'<p>一，</p>\r\n\r\n<p>全世界的狼都有一个共同的习性，在严寒的冬天集合成群，平时单身独处。眼下正是桃红柳绿的春天，日曲卡雪山的狼群按自然属性解体了，化整为零，散落在雪山下那片方圆五百多里的浩瀚的尕玛尔草原上。</p>\r\n\r\n<p>在草原东北端一块马蹄形臭水塘边，那块扇形的岩石背后，卧着一匹母狼，夕阳把它孤独的影子拉得很长。它从中午起就卧在这里了，一动不动地等了好几个小时，巴望能有只黄麂或山羊什么的来臭水塘饮盐碱水，这样它就可以采取突然袭击的方法，捕获一顿可口的晚餐了。它潜伏的位置不错，既背风，又居高临下，只要有猎物来，是极难逃脱它的狼爪的。</p>\r\n\r\n<p>这匹母狼名叫紫岚。之所以叫它紫岚，是因为它身上的狼毛黑得发紫，是那种罕见的深紫色，腹部却毛色纯白；它体态轻盈，奔跑起来就像一片飘飞的紫色的雾岚。用狼的审美标准来衡量，紫岚是很美的。但此时，它苗条的身材却变得臃肿，腹部圆鼓鼓的，有小生命在里面跃动。它怀孕了，而且快要分娩了。</p>\r\n\r\n<p>黄昏，森林里笼罩着一层薄薄的雾霭，背后是高耸入云的雪峰，前面是开满姹紫嫣红野花的草滩，一条清泉叮叮淙淙从它身边流过。突然，前面那片灌木林无风自动，发出哗啦哗啦的声响，它心头一喜，以为是终于把猎物等来了呢，刚把狼的神经绷紧，但仔细一看，灌木林里并没有闪现出黄麂或岩羊的身影，而是一条响尾蛇，正衔着一只翠金鸟在爬行。</p>\r\n\r\n<p>狼是很讨厌毒蛇的，假如不说是怕的话。</p>\r\n\r\n<p>紫岚相当失望。</p>\r\n\r\n<p>狼虽然是凶残的食肉兽，却也有着强烈的母爱。紫岚还是头一次怀孕，它像包括人类在内的大自然里所有的雌性动物一样，当小宝贝在自己的体内淘气地踢蹬蠕动时，它体会到了一种即将做母亲的幸福感和神秘感，同时也为还没出世的小宝贝未来的命运深深地担忧。它忧虑宝贝是否能平安出世；忧虑自己是否有足够的奶水把宝贝哺育得健壮；忧虑宝贝是否能避免诸如猎人、虎豹、野猪和金雕这类天敌的袭击。狼虽然是尕玛尔草原的精英，是森林里的强者，一生都在从事血腥的杀戮，但在狼牙还没有长齐狼爪还很稚嫩的童年时期，是极易成为其他食肉类动物捕杀的目标的。</p>\r\n\r\n<p>对紫岚来说，小宝贝是否能平安出世自己是无能为力的，狼毕竟是狼，没有人类那套科学的完善的接生方法，它只能靠命运。对宝贝在童年时期是否能避免天敌的袭击，也是一半靠命运安排一半靠自己的严密防范，这个问题似乎还挺遥远，不用太着急考虑。眼下当务之急的问题，就是要使自己有足够的奶水哺育小宝贝。而要使自己有足够的奶水，就必须先使自己有足够的食物。</p>\r\n\r\n<p>想到食物，它肚子又开始辘辘叫唤起来。今天早晨吃了一只半大的松鸡，早就消化干净了，自从怀孕以来，它的食量大得惊人，老觉得吃不饱，老有一种饥饿的感觉。这段时间它的运气实在太坏，一直没抓获过岩羊、黄麂、马鹿这类美味可口的动物。有时辛苦一整天只逮着一只豪猪或一只草兔，勉强能糊口；有时更糟，在臭水塘边潜伏到天黑仍一无所获，饿极了只好用爪子掘老鼠洞捉老鼠充饥。</p>\r\n\r\n<p>狼不是猫，很不欣赏老鼠肉那股怪味。</p>\r\n\r\n<p>紫岚知道，潜伏捕食完全是在碰运气。一般来说，狼是不屑于这种守株待兔般的愚蠢的捕食方式的。应该到广阔的尕玛尔草原上去主动出击，那里有成群的岩羊、马鹿和羚牛，但要在平坦的没有任何遮蔽的草原上追逐这些家伙又谈何容易啊。凡野生动物，都有自己独特的防卫和逃生的本领，譬如岩羊，虽说是食草类动物，生性怯懦，不会反抗，却谨慎机警，奔跑速度并不亚于狼。即使一匹健壮的公狼要捕捉一头成年岩羊都有一定难度，何况它紫岚都快临产了。它到草原上去试过几次，却一败涂地，连羊毛都没叼着一根。没办法，它肚子里的狼崽是一种沉重的负担，影响了它的奔跑速度，也影响了它的扑咬格斗。</p>\r\n\r\n<p>有一次，它在草原上追逐一群羚牛，羚牛没追上，却撞上一头饥饿的金钱豹，那头和它同样凶残的食肉兽见它腆着肚子行动笨拙，竟朝它扑来；要不是它急中生智挤进一条狭窄的石缝，它连同肚子里的宝贝恐怕早变成豹子的粪便被排泄掉了。假如它紫岚现在有个帮手，有个伙伴，情况就会大大改观，不但不用惧怕金钱豹，还能到尕玛尔草原随心所欲地去追逐岩羊和麋鹿。</p>\r\n\r\n<p>想到这里，紫岚又开始思念大公狼黑桑，那是多么理想的伴侣啊。黑桑的体毛漆黑发亮，黑色象征着力量和征服；黑桑体格魁梧，肌肉发达，头脑聪慧，身上有一股令它紫岚痴迷和颠狂的公狼特有的气味。它肚子里快要出世的狼崽，就是黑桑留下的狼种。回想起和黑桑相亲相爱的日子，那时的生活是多么甜蜜，时光是多么短暂，就连在饥饿时和黑桑争抢一只草兔，也似乎是一种美妙的享受。不，那时候它们很少去光顾兔子，它们喜欢到草原去捕食正怀着崽的雌麋鹿，麋鹿肚子里那团还没成形的肉块具有一种别致的风味。它们只要发现了目标，就极少落空，它和黑桑之间配合得非常默契，根本不用事先商量追捕方案，也不用临时用狼嚎联络；只需耸动狼耳，或摇晃狼尾，轻轻示意一下，双方就都能心领神会，或左右包抄，或前后夹击，或声东击西，或一个在草丛里设伏一个虚张声势地把猎物驱赶过来。</p>\r\n\r\n<p>唉，紫岚忧伤地叹了口气，要是黑桑还活着就好了。黑桑很体贴它，在它即将分娩的关键时刻，肯定会忠实地伴随在它身边，在它烦恼时，用粗糙的狼舌舔它的脊背，在它饥饿时，为它到草原上去寻觅食物。黑桑不但能消除它那种可怕的孤独感，还能替它分忧解愁，在它产下狼崽后，履行父亲的责任，和它一起保护和抚养孩子，日子一定过得既安宁又逍遥。但是，这一切都是梦想。黑桑死了。黑桑的尸体恐怕早已被秃鹫啄食掉了，也有可能是被红头蚂蚁啃干净了。它还记得黑桑遇难的地方，那是一个名叫鬼谷的山洼，满地都是狰狞的石头，还有几丛稀疏的骆驼草，很像一片恐怖的坟场。</p>\r\n\r\n<p>没有黑桑的伴随和保护，紫岚不敢到草原去奔波觅食。它快临产了，气虚体弱，害怕累着了会发生早产难产等意外。</p>\r\n\r\n<p>天渐渐地黑了，近处的灌木林和远处的草原都变得轮廓模糊，最后被漆黑的夜吞噬了，只有身后那座雪峰在深蓝色的夜空中散发着白皑皑的光亮。紫岚满腔的希望终于彻底冷却。凭经验它晓得，天一黑，胆小的食草类动物就再也不敢光顾臭水塘了。唉，看来，今夜又要瘪着肚皮忍着饥饿度过了。</p>\r\n\r\n<p>它叹了一口气，拖着疲惫的身子，悻悻地离开臭水塘，回到自己栖身的石洞。</p>\r\n\r\n<p>石洞坐落在日曲卡雪山的山脚，石洞口小腹大，洞口被茂密的藤萝遮挡着，显得十分隐蔽，是狼的理想居所。紫岚在洞里躺了许久，也无法入睡。一种强烈的饥饿感折磨着它。</p>\r\n\r\n<p>要是仅仅为了自己的口腹，它紫岚也许还能忍受，但它现在肚子里有了小狼崽，作为母狼，它无法忍受小宝贝跟着自己倒霉，和自己一起挨饿。小狼崽在它肚子里一阵阵躁动，像在抗议这难忍的饥饿。它心疼极了，难受极了。它用前爪摸摸自己胸前的乳房，既不结实也不丰满，因消瘦和营养不良而显得有点干瘪。对哺乳类动物来说，乳房是生命的泉。它自然希望自己那些生命的泉能源源不断地分泌喷涌出芬芳的乳汁，把自己的宝贝哺育得健康而强壮。它内心深处还有个野心，让自己生下的狼崽中有一个将来能当上地位显赫的狼王。这个野心是那么强烈那么明亮，生活道路上的任何坎坷和波折都无法使这个野心泯灭。因为说到底，这个野心是大公狼黑桑未竟的遗志。</p>\r\n\r\n<p>是的，黑桑明白无误地告诉过它自己想当狼王。当然，有出息的成年公狼都会觊觎狼王宝座的。所不同的是，黑桑比其他成年公狼想得更苦，心情更迫切。为了使野心得逞，整整两年时间，黑桑经常悄悄地半夜起来在坚硬的花岗岩上磨砺狼爪，发疯般地啃咬树皮，力求把狼爪铸炼得更锋利些。它紫岚十分欣赏黑桑的胆魄和毅力，也许是出于一种刻骨的爱，它觉得黑桑身上天生就具有一种狼王的风采，理所当然应该登上王位。现任的狼王洛戛，虽然也凶悍无比，有一股罕见的蛮力，在体魄上和黑桑不相上下，但黑桑智慧出众，头脑比洛戛灵活多了。真正的强者应当是体力和智慧的高度统一。而洛戛是个四肢发达头脑简单的家伙，在空旷的雪野里觅食，会莫名其妙地命令狼群齐声嗥叫，强劲的朔风把狼的嗥叫声传播得很远很远，这等于是在给猎物报警，连再迟钝的岩羊也早就逃得无影无踪了。有一次洛戛竟然还愚蠢到在大白天去进攻一个猎人的营地，这等于是飞蛾扑火，白白断送了好几匹大公狼的性命&hellip;&hellip;要是换了黑桑当狼王，是决不会干出这等傻事的。</p>\r\n\r\n<p>紫岚觉得洛戛的王位由黑桑来取而代之是上顺天理下顺狼心的大好事。它理所当然是黑桑信得过的同盟者，自始至终参与了黑桑的篡位密谋。它们已在暗地里计划商定，在一个暴风雨的夜晚，它紫岚假装被霹雳震得心惊胆战，往洛戛身上靠拢，洛戛一定会出于一种公狼的虚荣心，敞开怀抱来安抚它；就在洛戛心神缱绻注意力被完全分散时，黑桑借着风声雨声和雷声的掩护，绕到洛戛的背后，冷不防就一口咬断洛戛的右后腿。就算洛戛的忠实伙伴这时听到动静跳出来想反扑，也已经迟了，一匹跛脚狼是无法在狼王的位子上站稳脚跟的。这主意真是妙极了，设计缜密，堪称天衣无缝，几乎没有失败的可能。就在它和黑桑准备将这篡位阴谋着手实施时，突然，黑桑在名叫鬼谷的洼地里被野猪的獠牙刺穿了头颅。可怜的黑桑，一代狼杰，竟死于非命！</p>\r\n\r\n<p>它紫岚记得非常清楚，当那头可恶的野猪终于被狼群撕成碎片后，它奔到黑桑跟前，黑桑四爪朝天地仰躺在被狼血染成污黑的石头上，身体已经僵冷了，但两只狼眼还圆睁着，瞳仁里射出野狼才具有的深邃的光，凝视着苍白的天空，凝视着冬天冰冷的太阳。狼群里没有谁知道黑桑为什么死不瞑目，只有它紫岚能理解。黑桑是因为壮志未酬，两年的心血顿成泡影，所以才死不瞑目的。黑桑在生命的最后几秒里所体验到的，绝不会是狼血快要流干的痛苦，也不会是即将告别世界的叹息，而一定是再也无法和它紫岚一起去实现朝思暮想要当上狼王的野心的巨大遗恨！这遗恨随着生命的逐渐冷却而永远凝固在黑桑的眼睛里了。</p>\r\n\r\n<p>它紫岚久久地站在黑桑的尸体前，突然，它感觉到了一种和死者之间神秘的交流，仿佛有一只无形的手，把黑桑身上的精华撷取出来，又移植到它的心田，就像埋进去了一粒种子。黑桑在冥冥之中乞求它嘱托它，要它用生命去浇灌这粒种子，催其发芽开花结果。</p>\r\n\r\n<p>是的，黑桑在这个世界上已经永远消失了，但它为它留下了肚子里这些狼种。应该这么说，黑桑的血脉在它紫岚母性的保护下将获得再生和延续。自然，黑桑的野心和理想也将得到继承。</p>\r\n\r\n<p>紫岚很明白，在狼群社会里，既没有世袭也不存在禅让，是要靠血腥的拼斗才能争夺到狼王位子的，这就必须有特别健壮的体魄和出众的胆略。要做到这一点，除了严格的培养和训练外，儿时的营养也是个关键。从小忍饥挨饿的狼崽，是不可能长得特别健壮的。</p>\r\n\r\n<p>紫岚凭着动物的本能，感觉到自己离分娩不远了。也许是明天下午，最迟是后天，小宝贝就要出世。它不能用干瘪的乳房迎接小宝贝的降临。但要使乳房丰满，要使乳汁喷涌，必须要有充足的食物。尤其是分娩的第一周里，假如还是用老鼠充饥，哺育出来的狼崽很有可能会长得像老鼠那样瘦弱，那样委琐。狼群中甚至出现过这样的情形，母狼因为没奶哺养幼狼，结果幼狼活活饿死了。</p>\r\n\r\n<p>紫岚现在比任何时候都渴望能逮到一头活马鹿。它想痛饮一顿咸腥的滚烫的鹿血，这样它的乳房就会丰满起来；它希望能饱啖一顿鲜嫩可口的鹿肉，这样它就能有足够的体力把小宝贝平安地分娩出来了。可是，到哪儿去弄到马鹿呢？</p>\r\n\r\n<p>突然，紫岚脑子里跳出一个奇妙的主意来。在离石洞不太远的名叫郎帕的寨子前，有一个养鹿场，里面有一大群活蹦乱跳的马鹿。它被自己大胆的念头所激动，站起来，蹿出石洞，登上石洞背后那座山冈。登高望远，大地漆黑一团，但在草原深处，却亮着几星火光。那就是人类豢养鹿群的所在地。它心里涌起一阵冲动，很想立即跑到养鹿场去显显身手。这时，一阵凉爽的晚风迎面吹来，紫岚忍不住打了个寒噤，心里刚刚升起的冒险的热情直线降温。不错，养鹿场上有一大群膘肥体壮的马鹿，而且被栅栏围困在一个范围极其有限的空间里，很容易捕捉，但那儿有持枪的猎人严密看守着，还有一条非常讨厌的大白狗。那大白狗的嗅觉和听觉都不比狼逊色，还没等你接近栅栏，它就会发出汪汪的报警声，把猎人引来。紫岚想起同伴杰杰和洲洲，就是因为贪图口福，想偷窃养鹿场里的鹿，结果杰杰被猎枪击碎了脑壳，洲洲被铅弹洞穿了肚皮，白花花的狼的脑浆和红艳艳的狼的肚肠流了一地。可以这么说，养鹿场是名副其实的死亡之地，因此尽管狼们都对那些养得油光水滑的马鹿馋得直流口水，也很少有谁敢去冒风险。唉，算了吧，还是忍着点，用老鼠充饥吧，紫岚垂头丧气地想。</p>\r\n\r\n<p>可是，一种要把自己后代喂养得更强壮的母爱，一种要培育新狼王的理想，一种被饥饿感勾起来的无法抑制的欲望，强烈地诱惑着紫岚的灵魂。猎人并不是无懈可击的，大白狗也不是万能的，它想，猎人和大白狗都在明处，它在暗处，这便于偷袭；今夜没有月亮，连星星都躲藏起来了，风又刮得紧，夜黑好隐蔽，风紧好躲藏，气候对它十分有利；它生性谨慎，不像杰杰和洲洲那么鲁莽，它是有可能得手的。</p>\r\n\r\n<p>紫岚设想着有利于自己的种种条件，恢复了些信心，又变得跃跃欲试了。真的，现在去偷鹿，总比分娩后被饥饿驱使着去铤而走险要强些；那时候，身体要比现在更加虚弱，行动更加困难，成功的可能性也就更加微小。</p>\r\n\r\n<p>紫岚到底说服了自己。</p>\r\n\r\n<p>它跑下山冈，喝了一通清凉的泉水，收了收腹部，肚子里的宝贝暂时还很安宁，还没出现要分娩的预兆。它扭了扭腰，甩了甩尾，觉得自己还有足够的力气去养鹿场跑一趟。</p>\r\n\r\n<p>它离开石洞，潜进黑沉沉的尕玛尔草原。</p>\r\n\r\n<p><br />\r\n二，</p>\r\n\r\n<p>人类毕竟是人类，实在精明，养鹿场东端那间守更的草棚搭得两层楼高，便于观察和瞭望。守更的猎人在草棚上烧着一堆篝火，怀揣那支让森林和草原上所有的食肉类猛兽都心惊胆战的猎枪，端坐在篝火边咂着水烟筒。那条大白狗在鹿场的栅栏外来回逡巡。</p>\r\n\r\n<p>现在出击无疑是去送死，紫岚躲在离鹿场远远的一丛蒿草的背后，耐心地等待着。夜露打湿了它全身的狼毛，湿漉漉的，这样也好，它想，可以盖掉些它身上那股刺鼻的狼的气味。</p>\r\n\r\n<p>启明星升起来了，就像黑缎子上缀着一粒宝石。终于，草棚上的篝火渐渐熄灭，只剩下一堆暗红色的炭火，猎人在炭火边脑袋一沉一沉地打起了瞌睡。那条大白狗也蜷起尾巴，卧在草棚的竹梯子上，把狗头埋进两条前腿之间。大白狗和它的主人辛劳了一夜，都疲倦了；天快亮了，一夜平安，他们都麻痹了。紫岚很兴奋，它在冰凉的露水中泡了整整一夜，要的就是眼前这样的最佳偷袭时机。</p>\r\n\r\n<p>它开始行动了。刮的是东风，它绕到养鹿场的西端。那儿不仅僻静，还背风，这样，大白狗的鼻子再灵敏，也休想闻到它的气味了。</p>\r\n\r\n<p>栅栏是用碗口粗的栗树桩做成的，有一人多高，相当结实。但对紫岚来说，这并不是什么难题，狼的跳跃本领远比人类想象的还要高超。它无须费多大力气，只消前爪搭在粗糙的栗树皮上，纵身一跃就能越过这道障碍。它唯一担心的是怕引起鹿群的骚动，惊醒大白狗和它的主人。马鹿的鼻子和耳朵也是相当灵敏的，而且马鹿生性多疑，极易受惊，稍有动静，便会乱吼乱叫。更叫紫岚踌躇的是，虽然鹿群置身在安全的栅栏之中，虽然有猎人和大白狗严密看守，但养鹿场里的马鹿仍保持着野外生活时夜晚派岗哨的习惯，即整个鹿群酣睡后，始终有一头大公鹿瞪着眼竖着耳警觉地站立着。</p>\r\n\r\n<p>对紫岚来说，这实在是很不友好的行为。</p>\r\n\r\n<p>看来，只能运用狼的智慧实行奇袭了。紫岚仔细观察了一下地形，跑到一个三角形的泥塘里，打了两个滚，稀泥浆糊满了全身，把狼身上那股呛鼻的血腥味彻底压盖住了。它还不放心，路过一片羊蹄甲花丛，咬下一大束，衔在嘴里，然后，悄无声息地爬到栅栏外，又观察了一番，直到确信放哨的大公鹿、草棚里的猎人和那条大白狗还都被蒙在鼓里，这才以闪电般的速度纵身一跃，跳进一人多高的木栅栏。</p>\r\n\r\n<p>紫岚弹跳的姿势极其优美，半空中划过一道漂亮的弧形，简直像在表演艺术体操，在空中它舒展狼腰，收腹屈腿，像片树叶徐徐飘落，着地时只发出轻微的声响。它事先已计算好角度，所以一落地便头向着担任岗哨的大公鹿，整个身子都蜷伏在羊蹄甲花束中。然后，凝神屏息，静静地卧着不动。</p>\r\n\r\n<p>完全像它预想的那样，在它落地的一瞬间，担任警戒的大公鹿就猛一耸琥珀色的鹿角，想引颈吼叫。就在这性命攸关的时刻，大公鹿犹豫了一下，张开的嘴巴里没叫出声来。</p>\r\n\r\n<p>大公鹿在黑暗中朦朦胧胧地看见徐徐飘落的是一束洁白的羊蹄甲花，大公鹿嗅到了一股浓郁的花香，鹿的优柔寡断的天性影响了它的判断力，一时拿不定主意该不该发出警报。它怕把一束飘落的花卉误认为是祸殃会惊扰同伴的好梦，会引起同伴的耻笑。可鹿的多疑的天性又对突然出现的动静很不放心，于是它的表情和动作都凝固在欲叫不叫的状态中。</p>\r\n\r\n<p>这是智慧的较量。</p>\r\n\r\n<p>紫岚沉住气，像块僵死的石头般一动不动。它的耐心终于奏效了。几分钟后，那头愚蠢的大公鹿相信了飞进栅栏的只是一束无害的羊蹄甲花，于是，它缓缓地收平鹿角，缩回脖颈，全身警惕的神经松弛了下来。</p>\r\n\r\n<p>就在这时，紫岚猛地蹿到早已瞄准的一头母鹿跟前。母鹿正在睡梦中，柔软的腹下露出一个鹿仔毛茸茸的小脑袋。紫岚早就算计好了，它无法叼走成年的公鹿或母鹿，它们的躯体太沉重，它无法叼着它们越过一人多高的结实的木栅栏，它只能叼走鹿崽。它像一阵风似的蹿到倒霉的母鹿跟前，把嘴里衔着的那束羊蹄甲花使劲朝母鹿的眼睑刺去。这时，母鹿已被狼嘴里喷出的那股血腥的气味惊醒，睁开眼来，却是白白的一片花影，它下意识地往后仰躲。紫岚趁机一口咬住母鹿腹下那头可怜的鹿崽的脖子，把它拖了出来。母鹿还没反应过来是怎么回事，就失去了自己心爱的宝贝。</p>\r\n\r\n<p>这时，担任警戒的大公鹿已看到那束羊蹄甲花奇怪地朝鹿群逼进，它意识到自己上当受骗了，于是再次耸起鹿角伸长脖颈，想发出报警的吼叫，但这需要几秒钟的时间。紫岚就利用这极其宝贵的几秒钟的空隙，叼着鹿崽跃出栅栏。</p>\r\n\r\n<p>大公鹿终于呦呦吼叫起来。霎时间，整个鹿群被惊醒了，陷入了极度的惊慌和骚乱之中。紧接着，大白狗的吠声、寨子里狗群的嚣叫和猎枪的轰鸣声划破了尕玛尔草原黎明前的宁静。</p>\r\n\r\n<p>但已经迟了。紫岚已逃出了郎帕寨的地界。</p>\r\n\r\n<p>三</p>\r\n\r\n<p>假如当时天公作美，降下倾盆大雨，把紫岚留在草原上的痕迹和气味消除得干干净净，那么，大白狗再机敏恐怕也难以跟踪追击了；假如紫岚叼着鹿崽从养鹿场一口气跑回石洞，中途不停留，那么大白狗奔跑的速度再迅速恐怕也是追撵不上它的。</p>\r\n\r\n<p>紫岚本来并不想中途停顿的，但衔在嘴里的那头鹿崽的生命力实在太脆弱，开始还踢蹬挣扎，渐渐地就不动弹了。其实紫岚并没咬到它的致命处，大概是鹿崽惊骇过度而休克窒息了。这时，紫岚已把火光闪烁的养鹿场远远地抛在身后，枪声、狗吠声和鹿群的骚动声都已模糊得快听不见了，它认为自己已脱离了危险，慌乱的脚步变得从容。它一面踏着碎步向石洞奔跑，一面摇晃着嘴里衔着的鹿崽，鹿崽只剩下最后几口微弱的气息了。紫岚晓得，猎物一旦断气，身体便会慢慢冷却，血液也就凝固了。它实在太想喝滚烫的鹿血了，它实在太想在分娩前用鹿血滋补一下身子使干瘪的乳房膨胀起来了。它想，稍稍停顿一下，大概不至于会惹出什么麻烦来的。于是，它在一个蚂蚁包背后停下来，麻利地咬开奄奄一息的鹿崽的喉管。立刻，一股甜腥的芬芳的黏稠的滚烫的血液输进它饥渴的嘴，它浑身一阵惬意，一阵满足，干瘪的乳房似乎立刻就开始丰满起来。它拼命地吮吸着生命的琼浆，直到鹿崽的喉管里再也吸不出一滴血为止。它有点困倦了，伸了个懒腰，把狼脸在溅满露珠的草叶上蹭了蹭，振作了些精神，重新叼起鹿崽，想回到石洞后慢慢享用。</p>\r\n\r\n<p>假如紫岚能预卜未来，事先知道自己在蚂蚁包背后停留片刻，结果会酿成灾祸，自己贪图的那口鹿血其实是一碗命运的苦酒，那么，它宁肯让鹿崽的血在体内慢慢冷却凝固也要一口气跑回石洞的。</p>\r\n\r\n<p>命运是不可抗拒的。</p>\r\n\r\n<p>当紫岚叼着鹿崽刚想离开蚂蚁包，突然，前方黑黝黝的草丛里蹿出一条朦胧的白影，紧接着，汪汪&mdash;&mdash;传来两声尖锐的愤怒的狗的咆哮声。紫岚一惊，没想到那条讨厌的大白狗会一路嗅着气味跟踪过来。再竖起耳朵听听，大白狗身后远远地传来猎人的吆喝声。它不敢大意，立即扭头朝荒野奔跑。大白狗尾随追击。</p>\r\n\r\n<p>一般来说，狼的奔跑速度胜过狗。但紫岚叼着一头鹿崽，虽然不很沉重，却也是一种负担，影响了它的奔跑速度。大白狗紧撵着它的屁股，怎么也甩不脱。要是把鹿崽丢掉，它能很快摆脱掉大白狗的，可它舍不得。自己冒着九死一生的危险好不容易猎到头鹿崽，怎能轻易丢弃呢。</p>\r\n\r\n<p>就这样，紫岚和大白狗一前一后，相差几步远的距离，在广袤的尕玛尔草原上展开了一场马拉松式的长跑比赛。</p>\r\n\r\n<p>紫岚撇开四足，越过小溪，越过草滩，越过臭水塘，一路狂奔，很快逃到尕玛尔草原的边缘，前面出现了两条岔道，一条是通往日曲卡山脚它栖身的石洞，一条是通往干涸的古河道。它犹豫了一下，拐进了古河道。它出于一种动物护巢的本能，不愿把危险引到石洞去。它快要分娩了，狼崽出世后无疑要在石洞里生活很长一段时间，万一自己栖身的巢穴被大白狗和它的主人发现，后果不堪设想。</p>\r\n\r\n<p>紫岚在铺满鹅卵石的古河道又奔跑了很长时间，漆黑一团的天空逐渐透出一抹亮色，天边泛起一片玫瑰色的晨曦。它已跑得精疲力竭。听听身后的大白狗，也已气喘吁吁，累得连吠叫声都嘶哑了。凭经验，它晓得狗的主人已被远远地甩在后面了，但大白狗仍然没有罢休的意思。紫岚心里又愤慨又纳闷。按常理，一条狗是对付不了一匹狼的，狗所以能在凶猛的野狼面前骁勇善战，那是因为依仗着主人的势力。俗话说狗仗人势。一旦主人没在身旁，狗的威风立刻锐减，由勇敢的斗士变成夹紧尾巴逃命的懦夫。此刻，大白狗的主人早已不知去向，大白狗并不蠢笨，是应该知道这一点的呀，它为什么还紧追不舍呢？难道说大白狗吃了豹子胆了？抑或是条神经错乱的疯狗？紫岚想，也许这条大白狗是血统纯正品种优秀的军犬。军犬是狗中的精英和豪杰，其胆量和力量都是可以和狼相媲美的，倘若真是这样，它紫岚算是倒了八辈子大霉了。</p>\r\n\r\n<p>紫岚的担心其实是多余的。大白狗不是军犬，品种也很一般，是滇北高原上最常见的那种草狗，是郎帕寨养鹿专业户安柯度豢养的一条普通家犬。大白狗既没吃豹子胆，也没有神经错乱，它所以能在远离主人的情况下仍奋勇追击，是想得到主人的宽恕。</p>\r\n\r\n<p>不知是时运不佳，还是狗的生物钟正处在零点，反正，这段时间大白狗是够倒霉的了，接连出了好几次差错。那天中午，在牧场上，一条蟒蛇趁它瞌睡之际，吞吃了一头幼鹿；还有一天半夜，它在主人熟睡后，溜到寨子里和一条名叫西努儿的母狗幽会，结果一只该死的豹子用嘴咬开栅栏门和铁销，闯进鹿群叼走了一头三岁的公鹿&hellip;&hellip;主人损失惨</p>\r\n\r\n<p>重，当然愤慨，迁怒于它，把它视为渎职的罪犯。过去主人很宠爱它，常把它揽在怀里，捋它的背脊，亲它的面颊，自从失窃事件接二连三发生后，主人收回了对它的宠爱，免去了对它的亲昵，特别是那头长着四平头鹿茸的三岁公鹿被豹子叼走后，主人用极其厌恶的表情，在它肚皮上踢了两脚。与其说它的肚皮被踢疼了，还不如说它的心被踢疼了。它懂得，狗自古以来是依附人类生存的，失去了主人的宠爱，也就失去了生存的价值。它亲眼看见过那些被主人厌弃的同伴的悲惨的下场。原先主人还豢养过一条名叫罗罗的老母狗，因衰老而变得整天懒洋洋的，腿力也不支了，连鹿群都追撵不上，结果被主人用十元钱的代价卖给了屠狗贩子，等待罗罗的无疑是沸腾的汤锅。据说罗罗年轻时是主人形影不离的伙伴。大白狗害怕主人也会因它失职因它无能而最终厌弃它。狗是没有自主权的，狗的幸福完全取决于主人的恩赐。只有设法重获主人的宠爱，它的生存和幸福才能有保障。而要重获主人的宠爱，一般化的讨好乞求撒娇献媚已经不管用了，必须立功赎罪，也就是说，必须杜绝马鹿&mdash;&mdash;主人的财富再次失窃，必须擒获胆敢冒犯主人的蟊贼。这就是大白狗打破常规在远离主人的情况下仍紧追不舍的思想动机和精神支柱。</p>\r\n\r\n<p>大白狗决不蠢笨，它也知道，失去了主人手中那杆猎枪的撑腰，自己孤身和一匹狼拼斗，是很难占到便宜的，弄不好还会白白断送性命。狗的天性在不断提醒它，快中止这场危险的追逐游戏吧，趁这匹在前头疲于奔命的恶狼还没有觉悟，还没回身朝自己反扑，赶紧收场吧。但当它的眼光落到紫岚圆鼓鼓的已膨胀到极限的腹部时，它又舍不得放弃这场追逐了。它产生了一种侥幸心理，它想，前面正在奔逃的这匹恶狼之所以不敢回身反扑，肯定是因为怀孕而身体虚弱，说不定已完全丧失了扑咬能力，这是老天爷赐给自己的立功赎罪的好机会。咬死了这匹恶狼，不但能得到主人的宽恕重获主人的宠爱，还能提高自己在狗群中的地位和威信。啧啧，孤狗逮孤狼，它英雄的名声将传遍整个尕玛尔草原。</p>\r\n\r\n<p>大白狗受虚荣心的驱使，在侥幸心理的支撑下，忘却了自己狗的劣势，继续勇猛追击。</p>\r\n\r\n<p>四</p>\r\n\r\n<p>紫岚实在跑不动了，唾液吊在嘴角，腹部一阵阵抽搐。叼在嘴里的鹿崽已成为一种累赘。它意识到假如再继续这样奔跑，用不了多久，自己就会累得口吐白沫倒毙在古河道上的。与其在逃命的途中累死，倒不如停下来，转过身去，朝白狗反扑，也许还有生的希望。想到这里，它突然岔进古河道的一条支流，这儿也是干涸的河床，但更为狭窄，更为荒僻，更为隐蔽。四周挺拔的山峰割断了晨曦，地上的鹅卵石都蒙着一层青苔。河道中央散落着一堵堵矶石和一块块巉岩。这儿地形不错，它想，便于周旋也便于逃逸，更重要的是，漏斗形的山谷会遮挡住大白狗的叫声，即使大白狗的主人追踪到附近，也听不到它们的吼叫和格斗，无法赶来增援。</p>\r\n\r\n<p>紫岚一面继续沿着幽暗的古河道奔逃，一面乜斜着眼睛，眼看着大白狗的前爪只差那么几寸就要落到自己的屁股上了，突然吐掉衔在嘴里的鹿崽，往旁边纵身一跃，跳上一块半米高的卵石。大白狗没有防备，再加上长满青苔的河床滑得像涂了一层油，想收敛脚步，已经迟了，在惯性作用下，身不由己地越过紫岚，滑行到前头。</p>\r\n\r\n<p>紫岚占据了居高临下的有利位置，瞅着大白狗扭动狗腰想转身又未转成的有利战机，从背后猛地扑到大白狗身上。公平地说，在还没有交手前，紫岚内心有一种悲壮感，它从大白狗来势汹汹锲而不舍的追击中猜想对方是凶猛的军犬，它是准备着和对手同归于尽的。但当撕咬了第一个回合后，它很快看透了大白狗其实是一条很不中用的草狗。大白狗的爪子一点不锋利，连狼毛都扯不破；大白狗的牙齿也不甚尖利，只能咬破皮肉，而无法咬断骨头。于是，紫岚抛却了恐惧和悲哀，恢复了狼的自信，决心把这条害得自己疲于奔命的大白狗咬死，也好拖回石洞当一顿点心。狗肉的滋味虽然不如鹿肉，但也蛮好吃的。</p>\r\n\r\n<p>再说大白狗，没防备那匹正在逃亡的狼会朝自己突然反扑。它躲闪不及，肩胛被锐利的狼爪抓出了好几道血痕，脊背上被狼牙连狗皮带狗毛咬去了一块，火烧火燎般地疼。幸亏它反应还比较快，就地打了两个滚，才算把凶残的狼从自己背上甩掉了。</p>\r\n\r\n<p>大白狗吃了大亏，这才醒悟过来自己正处在极端危险的境地。狼总归是狼，哪怕怀孕临产也比草狗强几倍。现在觉悟已经晚了。转身逃命吧，大白狗想，但退路已被狼封死，再说自己在长途追击中已跑得精疲力竭，恐怕很难逃出狼的魔爪了。它只好虚张声势地汪汪吠叫，希冀自己的叫声能唤来主人，共同对付那匹狼。但主人离它实在太远了，人类的听觉和嗅觉是十分麻木和迟钝的，不可能像狗或狼那样循着气味追踪到这里来。它的叫声只换来山谷间空洞的回响。它还有一个绝招，就是摇尾乞降，但这绝招面对狗伴和人类还有实效，用在嗜血成性的恶狼身上，只能是徒劳。大白狗逃也逃不脱，降也降不得，只好以死相拼了。</p>\r\n\r\n<p>紫岚初战占了上风，变得更加凶猛。它想尽快结束这场厮杀，不顾一切地扑到大白狗身上，把大白狗撞翻，仰面按在地上，尖尖的狼嘴使劲朝大白狗柔软的颈窝伸去，想一口咬断狗的喉管。这是狼最拿手的战术，也是狼的看家本领。大白狗很明白这一点，一旦自己的喉管被咬断，鲜血就会喷溅，生命也就结束了。因此，它举起两只前爪，拼命抵住紫岚的下颏。但狼的力气比它预想的要大得多，紫岚的嘴一寸一寸地逼近它的喉管，粉红色的粗糙的狼舌已舔到它的颈窝了，狼嘴里那股浓烈的骚臭和腥味呛得它头晕眼花，直想呕吐。它力气已经耗尽了，明白自己已支持不住了。太阳是橘红色的，从东边的山峦背后冉冉升起，朝幽暗的古河道喷吐着温暖的阳光，照耀着绿的树、红的土地和灰白色的河床，早晨的世界显得富丽堂皇。大白狗不愿就这样暴死荒野。它比任何时候都留恋生命。它很后悔自己不该争强好胜只身来追撵这匹恶狼。但现在后悔也迟了。再过几秒钟，尖利的狼牙就会不可避免地触及自己的脆嫩的喉管，美丽的世界从此就要和自己分别了。</p>\r\n\r\n<p>完全是出于一种动物求生的本能，完全是一种无意识的挣扎动作，就在紫岚的狼牙触碰到大白狗喉管的一瞬间，大白狗两条后腿在紫岚的腹部猛蹬了一下。</p>\r\n\r\n<p>假如紫岚没有怀孕，假如不是临近分娩，别说被蹬了两脚，即使被蹬了二十脚紫岚也无所谓。对狼来说，这类踢咬打斗是家常便饭。但紫岚正在怀孕，又正临近分娩，这两腿又恰恰蹬在高高隆起的下腹部。紫岚像被高压电流击中似的一阵灼疼，浑身痉挛，惨嚎一声，从大白狗身上翻落下来。肚子里的小宝贝兴许是被踢伤了，在子宫里拳打脚踢，似乎是在抗议，疼得紫岚在河道的砂砾上打滚。</p>\r\n\r\n<p>大白狗懵懵懂懂，不明白发生了什么事。望着紫岚在地上打滚，它还以为这是诡计多端的恶狼的一种欺骗战术呢，目的是引诱它上钩。它在旁边疑疑惑惑地观看着。似乎又不像是装出来的痛苦，瞧那张狼脸，鼻子和下颏严重错位，分明是被无法忍受的疼痛折磨得扭曲变形了嘛；瞧那双狼眼，野性的光芒已经消散殆尽，黯然无神，一瞧就知道其生命已经衰竭。大白狗产生了一种反败为胜的侥幸和得意，快，趁恶狼正处于半昏迷半休克状态，暂时丧失了反抗能力，扑过去，也学学狼的残忍的看家本领，咬断狼的喉管。主人一定会嘉奖自己的勇猛，重新宠爱自己的。大白狗一阵冲动，跃跃欲试。但是，它过于聪明的脑筋突然绕了个弯子，狼的狡诈是出了名的，不乏这样的先例，狼用装死的伎俩来度过危机或克敌制胜，谁能保证这匹正在地上打滚的狼不是在装死呢？狗的多疑的天性使它在这个节骨眼上犹豫了。真的，自己刚才在格斗时明明占了下风，自己并没有伤着狼的致命处，怎么恶狼就一下子瘫痪了呢？反常的现象极有可能就是欺诈的假象，大白狗这样分析着，不敢贸然扑上去撕咬，只是不远不近地围着紫岚团团打转。</p>\r\n\r\n<p>紫岚在地上打了几个滚，剧痛缓解了些，但浑身的筋骨变得像柳絮一样绵软，继而腹部产生一种物体下坠的感觉。它明白自己要分娩了。它虽然是胆大妄为的狼，此刻也感到了极度的恐怖。在杀气腾腾的仇敌大白狗的眼皮底下分娩，其危险程度不亚于在刀尖上舞蹈；只要它稍微露出一丝破绽，只要大白狗瞧出一点蹊跷，它和它的狼崽就不可避免会被大白狗撕咬成碎片；在狼崽欲出来的当儿，在分娩的阵痛与昏眩中，别说对付凶猛的大白狗，即使一只猫来扑咬，它也是招架不住的。唉，宝贝，你们出来得真不是时候啊。它很想逃到一个安全隐蔽的地方去分娩，但这是不可能的，它此刻连挪动一步的力气也没有了；它很想让狼崽在自己的肚子里再多待一会儿，让它先设法收拾了大白狗，解除生存威胁，然后再迎接宝贝出世，但不行，肚子里的狼崽迫不及待地想钻出母体，它有一种憋不住想撒尿却尿不出来的难受。现在唯一的办法是，用假象迷惑住大白狗，争取时间。想到这里，紫岚忍住腹部的绞痛，停止了打滚，蹲在砂砾上，竭力撑直前肢，挺起胸脯，佯装出一副刚才自己是在使用装死的战术可惜大白狗没有上当受骗的愤愤然的表情来。</p>\r\n\r\n<p>大白狗果然上当了，露出一丝得意的笑，更加谨慎地监视着它。</p>\r\n\r\n<p>紫岚又稍稍抬高了些臀部，眯起狼眼，做出一种正在暗中凝聚力量，觊觎时机，随时准备跳跃起来给对手致命的一击的架势。</p>\r\n\r\n<p>这一招很灵，大白狗惶惶然地停止了打转，站在它面前，全身紧缩，尾巴竖得像根旗杆，紧张得眼珠都快从眼眶里蹦跳出来了。</p>\r\n\r\n<p>嘎呕&mdash;&mdash;紫岚拼足全身的力气发出一声威风凛凛的狼嚎。</p>\r\n\r\n<p>大白狗吓得尾巴耷拉在两胯之间，惨嚎一声，掉头就逃。逃出十几丈远，看看没有动静，这才惊魂不定地蹿到一道石坎上，远远观望。</p>\r\n\r\n<p>但愿大白狗永远被蒙在鼓里。</p>\r\n\r\n<p>阳光渐渐由橘红变得炽白，古道河两岸的树林里不时传来猿猴的啼声和飞禽的鸣叫。终于，紫岚感觉到自己的身体一阵撕裂般的疼痛，接着，一只狼崽蠕动着钻出了体内，接着，又产下了一只，顿时，刚才那种无法忍受的下坠感减弱了一半。这些它都是凭身体的触觉知道的。它不敢回过头去看看自己刚生下的宝贝狼崽长得是啥毛色，是啥模样。它害怕自己一动弹一分神，蹲在石坎上的大白狗就会看出破绽，蹿下来撕咬它和刚出生的宝贝狼崽。</p>\r\n\r\n<p>噢，第三只狼崽也顺利地降临到这个世界上了。三只宝贝狼崽在冰凉的大地和它温热的身体之间蠕动着，在寻觅它的乳房&mdash;&mdash;生命的泉。它真想用轻柔的动作把它们衔到太阳底下，让它们尽情享受明媚的阳光和湿润的空气；它抑制不住一种母性的冲动，很想把三只宝贝狼崽从身体底下移到面前来，仔细端详它们的容貌，它们一定长得美丽又可爱，娇嫩鲜艳，像出水的太阳，越看越爱，永远也欣赏不够的；它多么愿意伸出自己的舌头，深情地舔净宝贝身上粘留着的胎胞和血污，把它们的体毛舔得闪闪发亮，像圣洁的小天使，然后轻轻舔开它们闭阖着的眼皮，让它们睁开骨碌骨碌转动的比黑宝石更明亮的眼睛，看看这红的太阳绿的山林蓝的天空，看清并永远牢记它们的母亲；它觉得自己的乳房已奇迹般的膨胀起来，像洪汛期的水库，里面有春潮在汹涌，它真想把奶头塞进宝贝狼崽稚嫩的嘴里，让它们饱吮芬芳的乳汁&hellip;&hellip;</p>\r\n\r\n<p>紫岚渴望完成母性的一切本能，但是，它不敢。大白狗近在咫尺，它只能把三只狼崽紧紧藏在自己的腹下。小狼崽一出世就显露出淘气的天性，不愿乖乖地睡在它的腹下，蹒跚爬动。它腹部的空间过于窄小，有一只狼崽毛茸茸的小脑袋从它右侧腰部的空隙穿透出来，它急忙移动胯部，把狼崽毛茸茸的小脑袋重新掩藏进腹下，但立刻，另一只狼崽的小屁股又从它左侧腰部的空隙暴露在阳光下&hellip;&hellip;</p>\r\n\r\n<p>倏的一下大白狗从石坎上蹿了下来，脸上疑云密布，犹犹豫豫朝紫岚躺卧的地方靠近。糟糕，大白狗贼亮的眼睛一定看出破绽来了。紫岚耸动一下腹部，里面还有两只狼崽没产下。快出来吧，宝贝，别耽误时间了，趁大白狗还没有完全觉醒，快从妈妈的肚子里钻出来吧，这样，妈妈就能卸去精神和肉体的双重压力，去对付那条该死的大白狗了。但不知最后两只狼崽是生性懒惰还是迷恋子宫的温馨，就是赖在体内迟迟不肯出来。紫岚拼命蹭动下腹部，想把两只小淘气挤压和驱赶出来，但没用。</p>\r\n\r\n<p>大白狗离开自己只有两三步远了，紫岚只能故伎重演，装模作样地继续摆出种种恫吓的姿势。但这一次失灵了，大白狗毫不理睬。</p>\r\n\r\n<p>刚才大白狗蹲在石坎上，因距离隔得较远，只是模模糊糊看见有物体在这匹恶狼的腰际蠕动；是紫岚惊慌的表情和急欲掩饰的窘相引起它怀疑的。莫非&hellip;&hellip;仿佛是要证实它的怀疑，就在它逼进恶狼只有两步远的时候，一只狼崽毛茸茸的小脑袋从紫岚两条前肢间吱溜钻了出来。虽然恶狼用极快的速度一爪子把狼崽的小脑袋蹬回了腹下，但由于距离极近，大白狗看得真真切切。哦，怪不得这匹恶狼会有这份耐心长时间在一个地方静卧不动，原来是正在分娩！一瞬间，大白狗心里升腾起一股被戏弄了的愤懑。要是自己刚才能看出蹊跷来，早就轻而易举把恶狼连同狼崽子一起收拾掉了。怪恶狼太狡猾，怪自己太老实。它懊恼极了，后悔极了。当它的眼光在恶狼身上仔细扫射一遍后，它又转悲为喜，哈，恶狼还腆着个大肚子，也就是说，恶狼还没有彻底完成艰难的分娩过程。它庆幸自己觉醒得还不算太晚，该死的恶狼，瞧着吧，你要为你的狡诈付出代价的！</p>\r\n\r\n<p>大白狗旋风般地朝紫岚扑去。</p>\r\n\r\n<p>紫岚正在分娩当中，无力还击；腹下还有三只毫无防卫能力的狼崽，它又不能躲闪。它只能蹲在原地，听凭大白狗以极高的频率一次次朝自己扑来。它唯一能做的是，在原地调整自己的方位，用坚硬的狼头正面承受狗牙和狗爪，不让大白狗有机会从侧面或背后来袭击。这样，虽然狗爪在它狼耳和狼额上划出一道道血痕，虽然狗牙在它肩胛上叼走了好几口狼毛，却形不成致命伤。有两次，大白狗的冲击速度稍慢了些，它还能在原地张开狼嘴噬咬反击，虽然连狗毛也没咬掉一根，却迫使大白狗放慢了扑咬的频率。</p>\r\n\r\n<p>大白狗似乎也察觉到老是这样从正面攻击很难把对方置于死地，就改变了战术，闷声不响地以紫岚为轴心绕起圈子来，想伺机跳到狼背上去撕咬。</p>\r\n\r\n<p>紫岚一眼就看穿了大白狗的计谋，针锋相对，始终和大白狗保持一种面对面交锋的态</p>\r\n\r\n<p>势。</p>\r\n\r\n<p>要是不发生突然变故，这样僵持下去，大白狗是很难占到更多便宜的。</p>\r\n\r\n<p>唉，肚子里这两只小狼崽，刚才还赖在子宫里不肯出来，在这生死攸关的节骨眼上，却又想钻出母体来了。冤孽啊，凑什么热闹嘛！紫岚刚想到这里，只觉得一阵猛烈的宫缩，一只狼崽顺着产道慢慢滑向世界。在这生命诞生的一瞬间，紫岚一阵昏眩，眼前的一切似乎都被一层白纱遮盖，变得虚无缥缈。它的注意力被高度分散了，甚至忘了大白狗的存在。只是当脊背上突然落下一件沉重的物体，它的搏斗意识才猛然苏醒。糟糕，大白狗趁它神志眩迷时绕到它的背后扑到它的狼背上来了。要是在平常，它可以就地打两个滚把大白狗摔下背来的，但现在不行，它怕一旦改变姿势，会把狼崽窒息在产道里。它只能凝然不动地趴在原地，听凭大白狗啃咬。它把四肢尽量撑开，护住腹下的三只狼崽免遭伤害；它紧紧钩起下巴缩起脖子，不让大白狗咬到致命的喉管。</p>\r\n\r\n<p>大白狗在紫岚的后颈窝连毛带皮咬下了一块狼肉。</p>\r\n\r\n<p>紫岚疼得惨叫一声，滚烫的狼血顺着耳垂滴在古河道白色的沙砾土上。在疼痛和紧张的刺激下，第四只狼崽呱呱落地了。</p>\r\n\r\n<p>紫岚的肚子里还剩下最后一只狼崽了。</p>\r\n\r\n<p>大白狗叼着那块狼肉，从紫岚的背上跳下来。也许是被饥饿所驱使，也许是想炫耀自己的野性，也许是想羞辱紫岚并把紫岚吓倒，大白狗蹲在紫岚面前，啃咬起那块血淋淋的狼肉。</p>\r\n\r\n<p>大白狗贻误了宝贵的战机。</p>\r\n\r\n<p>还没等大白狗把狼肉吞咽进肚，紫岚肚子里最后一只狼崽顺利地钻出了母体。随着第五只狼崽降临到这个世界上发出的第一声尖叫，紫岚腹部那种强烈的下坠感顿时消失，身体变得异常轻松，虽然后颈窝的伤口还滴着血，心里却仍然产生一种飘飘然的快感，同时油然滋长了一种终于完成了艰难的生命诞生过程的自豪感和幸福感。在这样的精神作用下，它恢复了些力气，终于在一片血污的沙砾上站了起来。</p>\r\n\r\n<p>这时，一块黑沉沉的乌云遮住了太阳，树林里飞禽惊啼，走兽奔蹿，透露出一种山雨欲来的凄惶，荒凉的古河道笼罩在一片肃杀的气氛中。紫岚圆瞪着狼眼，逼视着大白狗，那野性毕露的眼光在明白无误地警告对方，瞧吧，我已经完成了整个分娩过程，我已经站起来了，为了我心爱的宝贝，我随时准备与你同归于尽！</p>\r\n\r\n<p>大白狗是聪明的，它看出形势在朝自己不利的方向逆转。刚才恶狼在身心瘫软的分娩过程中自己尚无法置它于死地，此刻自己恐怕更难取胜了。护崽的母狼比豹子更凶残。唉，只怪自己觉醒得太晚，动手太迟，现在，后悔也晚了。山雨欲来，还是赶快回到养鹿场舒适安逸的狗棚里去吧。想到这里，大白狗转过身去，悻悻地退出了古河道，很快消失在一片墨绿色的斑茅草丛中。</p>\r\n\r\n<p>五</p>\r\n\r\n<p>狂风骤起，古河道上飞沙走石。远处一座山峰上落下一只球状闪电，随着惊天动地的霹雳声，一棵大树被一团烈焰吞没。刚出世的狼崽生命力很脆弱，被狂风吹得浑身战栗，被雷电吓得吱吱惊叫。紫岚把五只狼崽护在自己的腹下，紧张地抬头观望天色。乌云越聚越厚，天色越来越暗，看样子，非得落一场比魔鬼还恐怖的暴雨不可。待在古河道里太危险了，这儿地势低，万一山洪暴发，后果不堪设想。必须赶快转移地方，最好的去处当然是它栖身的石洞。那儿不怕雷电风雨，又隐蔽又安全。想到这里，它毅然站起来，用狼嘴拱，用狼爪踢，把五只小狼崽通通驱赶到一块背风的岩石下，然后用牙轻轻叼住其中一只狼崽的后颈窝。剩下的四只狼崽失去了母体的庇护，惊慌地互相挤成一团，发出绝望的尖叫。听到狼崽这样的叫声，紫岚母性的心快要破碎了。但狼是具有高度理智的动物，它晓得，空洞的慈悲和怜悯无济于事，只有行动起来才能拯救自己和宝贝们。它狠起心肠，顶着狂风，箭也似的朝自己栖身的石洞跑去。</p>\r\n\r\n<p>它一次只能叼走一只狼崽。</p>\r\n\r\n<p>从古河道到它栖身的石洞，约有两华里远。紫岚几乎是一口气跑到的。把第一只狼崽送到石洞后，它来不及喘口气，又像接力赛跑似的奔回古河道，衔起第二只狼崽。</p>\r\n\r\n<p>当紫岚第三次从栖身的石洞里蹿出来时，山雨终于落下来了。这是日曲卡山麓今年的第一场春雨，来势汹汹，狂风挟带着豆大的雨粒，像鞭子似的抽打着地面，树枝被抽弯了，斑茅草被抽断了，山峰也被抽变了形。紫岚后颈窝的伤口不知什么时候已经结痂，被暴雨一浇，又流出血来，火烧火燎般的疼。它在厚实的雨帘中穿行，好不容易赶到古河道，干涸的河床上已潴积起一洼洼雨水，剩下的两只狼崽半只身子泡在积水中，浑身裹着一层殷红的稀泥浆。它急忙蹚着积水奔过去，叼起一只狼崽转移到古河道岸边一棵白桦树的树根下，这儿地势较高，不会被山洪淹没，然后，将第四只狼崽衔回石洞。</p>\r\n\r\n<p>古河道上还剩下最后一只狼崽了。</p>\r\n\r\n<p>紫岚虽说是身心强悍的野狼，但产后虚弱，又经过近一昼夜的奔波和厮斗，已经快支持不住了，四条腿软得像棉花，几乎是一步一个趔趄，摇摇晃晃，像喝醉了酒。这时，古河道两岸群山的沟沟壑壑，响起山洪倾泻的隆隆声，不一会儿，干涸的河床上出现一片浑浊的泥浆水，翻卷着浪花，滚动着旋涡。紫岚望着山洪暴发的恐怖景象，暗自庆幸自己已及时把第五只狼崽转移到了高处，不然的话&hellip;&hellip;它正想着，冷不防踩在一块活动的卵石</p>\r\n\r\n<p>上，身体失去平衡，仄翻在地，从陡峭的河堤一直滑落到浊浪翻滚的古河道，呛了两口泥浆水。狼是会泅水的陆上动物，它拼命划动四肢，想爬上只有两尺远的河岸，但山洪挟带着大量泥沙，水的浮力变得很小，身体一个劲往下沉，费了很大劲还是无法靠岸。一个浪头扑来，撞到石岸上，又反弹出来，一下把它推到河心。它还没有反应过来是怎么回事，身体就急遽地旋转起来，群山也在旋转，河岸也在旋转，整个世界都在旋转。糟糕，自己被卷进旋涡了。它觉得自己变得像块铅一样沉，水底仿佛有一双巨手正在无情地把它拽向地狱。它无力挣扎，大口大口的泥浆灌进肚子，水已淹没了它的头顶，水面只露出两只尖尖的狼耳。完了，它想，不但自己的末日到了，刚生下的五只狼崽也将变成五具饿殍。就在它彻底绝望时，它胡乱挣动的前肢突然钩住一根树枝，完全是出于一种求生的本能，它紧紧抱住树枝不放。这是一棵被山洪冲刷下来的龙血树，有两围多粗，旋涡也无法把它吞噬掉。紫岚顺着树枝爬上了树干，终于露出了水面。龙血树被浪头冲撞着，靠到岸上来了。</p>\r\n\r\n<p>紫岚得救了。当它登上坚硬的石岸时，它甚至已没有力气为自己的死里逃生而感到高兴，它太疲倦了，它想睡觉了。那强劲的山风，那如注的暴雨，那如雷的山洪倾泻声，仿佛都变成了奇妙的催眠曲。它疲乏地躺卧在冰凉的水汪汪的岩石上，立刻昏昏沉沉地阖上了眼。世界不再有恐怖的暴风雨，不再有高深莫测的古河道，也不再有讨厌透顶的大白狗，它恍然觉得自己正躺在娇艳的阳光下，睡在柔软如丝的草丛里，四只狼崽正活蹦乱跳地吮吸它丰满的乳房&hellip;&hellip;不，不应该是四只狼崽，它一共生下五只狼崽呀，怎么会少了一</p>\r\n\r\n<p>只呢？它最敏感的母性的神经被梦幻触动了，惊醒过来。是的，还有最后一只狼崽正孤立无援地待在荒野上，忍受着暴风雨的侵袭。想到这里，它睡意顿消，一骨碌翻爬起来，继续赶路。</p>\r\n\r\n<p>虽然白茫茫的雨帘模糊了视线，但凭着狼的灵敏的视觉，紫岚还是老远就看见心爱的狼崽还在白桦树下，它悬着的心放下来了。走到跟前，紫岚发现狼崽的姿势有点异常；雨水把狼崽黄褐色的体毛冲洗得干干净净，狼崽趴开四肢紧紧地搂抱着树干，小小的狼嘴咬住树皮上一颗乳头状的树瘤。紫岚忍不住一阵心酸，唔，宝贝失去了母体的庇护，把树干当做母亲的怀抱，把树瘤当做母亲的乳头了。宝贝，你受苦了，妈妈来了。它伸出舌头，带着歉意去舔狼崽；它的舌尖碰到狼崽的额角，吓了一跳，狼崽的额角滚烫滚烫，像舔在一块火炭上。狼崽双目紧闭，气息微弱，已经昏厥过去了。紫岚赶紧叼起狼崽，往石洞飞奔。</p>\r\n\r\n<p>暴雨越下越猛，狂烈的山风像一把把尖刀在无情地宰割着狼崽脆弱的生命，沉重的雨粒像一把把钉锤在狠命敲击着狼崽稚嫩的躯体。</p>\r\n\r\n<p>好不容易跑回了石洞。紫岚放下衔在嘴里的最后一只狼崽，咕咚，狼崽像截木头似的四脚朝天仰面栽倒在地。紫岚的心缩紧了。它试探着举起前爪摸摸狼崽的身体，狼崽全身冰凉冰凉，失去了生命的弹性，就像摸在一块石头上。</p>\r\n\r\n<p>不，宝贝没有死，它一定是被冻僵了。紫岚无法相信死神就这样轻易地攫走了自己宝贝狼崽的生命。它把狼崽紧紧地抱在自己的怀里，用舌头不停地舔着狼崽的眼皮、鼻翼和嘴唇。醒醒吧，宝贝，睁开你明亮而又淘气的眼睛，瞧，妈妈正守在你身边，我们已回到石洞，这里没有风雨，也不用害怕雷电，醒醒吧！</p>\r\n\r\n<p>但紫岚的一切努力均属徒劳，直到半夜，第五只狼崽也没能睁开眼睛。这是一只雄性狼崽。</p>\r\n\r\n<p>要不是石洞角隅传来狼崽们凄婉哀怨的叫声，紫岚也许就会失魂落魄地守在死去的狼崽身边度过漫漫长夜。是活着的四只狼崽的叫声使它从悲痛中惊醒过来。它瞪起蓝幽幽的眼睛，透过黑暗，看见四只小狼崽正在石板上扭成一团。它们既在靠对方的身体取暖，又张着小嘴在互相啃咬。有一只狼崽被咬疼了，发出绝望的吱吱的怪叫。有一只狼崽蜷伏在地下，只剩下喘息的力气了。</p>\r\n\r\n<p>是的，宝贝们都饿坏了，从生下来到现在，它们还没有吃到过一滴奶呢。自己真愚蠢，沉湎在悲痛中不能自拔。死去的已经死去了，重要的是要让还活着的能活下去。它终于理智地弃下第五只狼崽来到石洞角隅。四只还活着的狼崽闻到它的气味，都嗷嗷叫起来。它摸摸自己的乳房，挤不出一滴奶来。它已饿了一昼夜，没有食物填充肚子，是不可能分泌出乳汁来的。哪儿去弄食物呢？冒着风险从养鹿场窃来的鹿仔在和大白狗搏斗时不知遗落在哪个山旮旯里了，也许早被山洪冲走了。雨还在下个不停，这样的鬼天气，又是深更半夜，所有的动物都躲藏起来了，即使冒着风雨到森林里去闯荡，也不可能猎获到食物的。唉，要是有两只老鼠充饥也好啊，虽然它不喜欢鼠肉那股怪味，但饥不择食，至少也能挤出几滴奶来，让它渡过这个难关。遗憾的是，连老鼠都被暴风雨吓得躲进鼠洞不出来了。等到天亮了再说吧，它想，但愿天亮后天能放晴，这样它就可以到尕玛尔草原去追逐岩羊了。可是，瞧这四只狼崽，都差不多饿得虚脱了，它们的生命都很脆弱，恐怕等不到天亮，就会像第五只狼崽那样被饥寒夺走生命的。</p>\r\n\r\n<p>怎么办呢？紫岚心急如焚，在石洞里焦躁地踱来踱去，突然，它的眼光落在第五只已经死去的狼崽身上，这是此刻石洞内唯一可以充饥的东西了。它忍不住咽了一口唾沫。狼群中不乏同类相食的先例，在严寒的冬天，有时运气不佳时会一连几天猎不到食物，狼们各个饿得肚皮贴在脊梁骨上，这时，倘若有匹老狼病死，群狼就会呼啸着扑上去，争先恐后地把它撕成碎片吃进肚去。狼习惯于用这样的观念对待生与死：活着就是一匹狼，死了就是一堆肉。对死者废物利用，拯救众多的活着的生命，也许还是一种慈悲呢。</p>\r\n\r\n<p>紫岚这样想着，踱到死狼崽跟前，当它的牙齿触及狼崽僵硬的没有知觉的肉体时，它忍不住心里一阵悸动，失去了噬咬的勇气。狼崽虽然已经死了，但毕竟是自己的亲生儿子，俗话说儿是娘的心头肉，对人类而言是这样，对狼来说亦是如此。它怎么能吃掉自己的狼儿呢？但除此而外，它又有什么办法能挽救四只还活着的狼崽呢？感情固然重要，但生存比感情更重要啊。</p>\r\n\r\n<p>紫岚在死狼崽面前犹豫了很久，终于狠下心肠，闭起眼睛，开始啃咬已故宝贝的肉体。每咬一口，它就一阵心酸。它用飞快的速度把死狼崽吞进肚去。它不愿延长这顿痛苦的晚餐。它的味觉器官似乎已经麻木了，直到把整只狼崽都吃光咽进，也没尝出滋味来。它只觉得从嘴里到心里，都是一片苦涩。</p>\r\n\r\n<p>总算是吃进了食物，过了一会儿，它的乳房开始隐隐胀痛，挤出了些乳汁，虽说分到每只狼崽口中，只是有限的几滴，却使奄奄一息的狼崽们奇迹般地活转过来了。</p>\r\n\r\n<p>黎明时分，肆虐的山雨终于停歇了。一抹玫瑰色的朝霞透过洞口茂密的藤萝，射进石洞。紫岚终于舒了口气，昏昏沉沉地睡着了。</p>\r\n\r\n<p>在严酷的丛林法则的统辖下，生存是很不容易的。紫岚和它的狼崽在付出了惨重的代价后，总算熬过了难关。</p>',NULL,NULL,'{\"meta_title\": \"第一章 绝境分娩 狼王梦\", \"meta_keywords\": null, \"extra_features\": null, \"meta_description\": \"第一章 绝境分娩 狼王梦\"}',1,0,0,0,1,'2020-02-29 08:46:54','2020-02-29 08:46:54',NULL,NULL),(2,'第二章    培养黑仔',NULL,'<p>一</p>\r\n\r\n<p>这一个月来，紫岚交了好运，连续捕获到两头膘肥体壮的岩羊，还在一个野猪窝里捡到一只肥头大耳的野猪娃子，吃得满嘴流油。天气也好得出奇，整天艳阳高照。它后颈窝的伤口渐渐愈合了，心灵上的失子的创伤也慢慢平复了。产后虚弱的身体彻底复原了，甚至比产前长胖了一圈。六只乳房变得很饱满，分泌出又黏又稠的乳汁，虽然哺育四只小狼崽还不算太丰裕，但基本上够它们吃的了。日子过得很平静。每当狼崽们欢天喜地地扑进它的怀里，贪婪地吮吸它的乳汁时，它便会体会到一种只有母性才可能有的自豪感和幸福感。</p>\r\n\r\n<p>四只狼崽三公一母，长子长着一身黑黑的体毛，起名叫黑仔；次子脊背上的毛色有点偏蓝，起名叫蓝魂儿；最小的公狼崽上半身为黑色，腹部和四肢是褐黄色，起名叫双毛；唯一的那只母狼崽长着一身和它活脱活像的紫毛，起名叫媚媚。</p>\r\n\r\n<p>紫岚最偏爱黑仔。这倒不是因为黑仔是长子，人类社会讲究长幼次序，狼群中不讲这一套。它之所以偏爱黑仔，完全是出自一种说不清道不明的微妙心态。黑仔长得太像已死去的黑桑了，不但毛色是同一品系，连长相也惟妙惟肖，活像是从一只模型里浇铸出来的。瞧黑仔的唇吻，和黑桑一样极富肉感，和黑桑一样呈漂亮的S形线条，和黑桑一样显示出坚毅的气质。当初，它紫岚很大程度上就是被黑桑那与众不同的公狼的唇吻弄得神魂颠倒，最后做了爱情的俘虏的。黑仔简直就是黑桑的转世和再造。它们之间的唯一差别就是黑仔尚是只年幼的狼崽，但这一差别会随着时间而消失的。毫无疑问，黑仔获得了黑桑的全部遗传基因，一定会长成像黑桑那样具有强壮体魄、聪慧头脑和出众胆略的大公狼的。</p>\r\n\r\n<p>紫岚把全部的母爱都倾注在黑仔身上，在其他狼崽面前，它也从不掩饰自己对黑仔的偏爱。每次喂奶，它都先让黑仔尽情吃饱，然后才轮到蓝魂儿、双毛和媚媚吃。黑仔的食量越来越大，差不多要把三只乳房吸空了才肯罢休，占了紫岚总奶量的一半。剩下的一半，刚够蓝魂儿、双毛和媚媚每狼一乳房乳汁。</p>\r\n\r\n<p>这自然是极不公平的。有时，望着蓝魂儿、双毛和媚媚那副半饥半饱的馋相和对母亲的过分偏爱所流露出来的不满情绪，紫岚心里会涌起一丝愧疚。都是自己身上掉下来的肉，都是自己所疼爱的宝贝，干吗要厚此薄彼呢。但它的奶是有限的，没办法同时满足四只狼崽的需要。它也不能搞平均分配，平均分配的结果只能产生普遍的平庸。它必须先满足黑仔，黑仔身上寄托着它的理想和希望。紫岚在心里已把黑仔看成是下一代狼王的继承者和候选者。不，这种说法是不科学的，狼群社会并不存在王位继承的说法，也不存在选举制度，应该说它已把黑仔看做下一代狼王的争夺者和角逐者。即然如此，就要对黑仔进行身心各个方面的重点培养，从幼年起就打下坚实的基础，保证黑仔成长为强悍的&ldquo;超狼&rdquo;。也就是说，只能让其余三只狼崽作出点牺牲，有所失才能有所得嘛。这有点狠心，却是必要的。说到底，日曲卡雪山只能有一个狼王。</p>\r\n\r\n<p>过了一段时间，双毛和媚媚似乎已习惯了母亲的偏心，默认了自己的地位，每次哺乳，总是先乖乖地蹲在一旁，先看着黑仔狼吞虎咽，然后再钻进它腹下来吮吸乳汁，表现出一种守秩序识大体的气度。唯有蓝魂儿，仍是那股桀骜不驯的劲头，每每看到黑仔优先独享三乳房奶汁，脸上便露出一种极端嫉恨的表情，在旁边按捺不住地跳跃翻滚，做出种种扑咬的姿势，也许是想取而代之，也许是想分享平等的权益。</p>\r\n\r\n<p>假如它紫岚不是一门心思想把黑仔培育成&ldquo;超狼&rdquo;，它会欣赏蓝魂儿身上那种叛逆性格的。野心勃勃才是狼的本色。只有狗才逆来顺受，才安于现状。它会鼓励和怂恿蓝魂儿把嫉恨付诸在狼牙和狼爪上的。但它要让黑仔当上下一代狼王的念头太强烈了，它只能用严厉的眼神制止蓝魂儿这种篡位的企图。这无疑是在束缚和扼杀蓝魂儿狼的天性，它心里很难过。</p>\r\n\r\n<p>这天，紫岚在尕玛尔草原追逐一只草兔，狡猾的草兔钻进一片长满毒刺的荆棘丛中，它耗费了整整一个下午的时间，好不容易才把草兔咬死。回到石洞，已近黄昏，四只小狼崽等急了，也饿极了，一见它出现在洞口，便齐声欢呼着向它扑来。按照惯例，它斜卧在石洞中央，将饱满的乳房先朝黑仔敞开。就在这时，它担心的事终于发生了。也许是饿极了的缘故，也许是长时间积蓄的嫉恨已达到了极限，当黑仔用一种理所当然的神态向它怀里走来时，突然，蓝魂儿怒叫了一声从斜里蹿出来，一头撞在黑仔的腰部，把黑仔撞翻在地，然后扑进它怀里，张口就叼住平时一贯由黑仔享用的前胸那只硕大丰满的乳房。</p>\r\n\r\n<p>紫岚不知道是该用爪子把蓝魂儿蹬开，还是默认这种反叛的行为。它正在犹豫时，黑仔从地上爬起来了，它的眼睛充满困惑，怔怔地望着正取代它享用甘美乳汁的蓝魂儿，瞧得出来，它被突如其来的打击弄懵了。几秒钟后，黑仔似乎被一盆脏水泼湿了似的松开全身的狼毛抖了抖；随着这一阵颤抖，它的眼光由困惑变得仇恨，脸上那狼崽特有的稚气的表情顿然消失，显露出一副成年大公狼才有的痛苦的神情；它的眼角可怕地吊了起来，唇吻扭歪了，露出一口还不太结实的牙齿，仰天嗥叫了一声，那嗥叫声混合着悲愤、激动和嗜血的野性。</p>\r\n\r\n<p>紫岚心里一阵欣喜。它太熟悉这种表情了，过去在黑桑身上曾无数次看到过。每当狼王洛戛发号施令时，每当洛戛凭仗狼王的优越地位抢先吞吃猎物内脏时，黑桑的脸上就会浮现出这样的表情来。这绝不是平常因争吵和摩擦所引起的普通的愤慨，即使最平庸的狼也不乏愤慨的表情。这是只有高贵的狼才具备的一种在狼群中也是十分罕见的表情，一种超级愤慨。这是地位受到挑衅自尊受到践踏利益受到侵犯后的愤慨。支撑这种表情的，是一种强烈的优越感。黑桑之所以会面对狼王洛戛产生这种表情，是黑桑觉得自己生来就具有狼王的风采，天生就应当是狼王；洛戛占据在王位上，不但是历史的误会，也是对自己超众能力的一种嘲讽和亵渎。这是一种难能可贵的心理原动力。真是有其父必有其子，想不到黑仔小小年纪便具备了这样的气质。太好了，黑仔，这香甜的乳汁是属于你的，这肥沃的尕玛尔草原是属于你的，这险峻的日曲卡雪山是属于你的，整个世界都是属于你的！你绝不容许别的狼来染指！这才是未来狼王的风采和心态。</p>\r\n\r\n<p>黑仔扑到蓝魂儿背上，两只小狼崽在地上斗成一团。</p>\r\n\r\n<p>紫岚并不担心会伤着谁，黑仔和蓝魂儿毕竟都还年幼，牙还没长齐，爪都还软弱，是无法把对方咬伤或置于死地的。它相信黑仔能取胜，优越感所激发出来的斗志是非常顽强的。再说，就算两只小狼崽智力是平等的，但黑仔在足量的奶水的喂养下，力气显然要比蓝魂儿大些。果然，不一会儿，黑仔就明显地占了上风，把蓝魂儿逐渐逼到石洞的角落去了。 咬吧，宝贝，张开你的嘴使劲地咬吧，今天你从蓝魂儿嘴里夺回来了本来就应该属于你的乳汁，明天你就能从洛戛手里夺回来本来就应该属于你的王位。</p>\r\n\r\n<p>二</p>\r\n\r\n<p>一定是自己过量的母爱影响了黑仔狼的天性的正常发展，紫岚想，所以黑仔才会养成如此温柔的吃奶风格的。每当黑仔稚嫩的小嘴含着它肿胀的奶头，贪婪地吮吸时，它便会产生一种似水柔情，一种母性才具有的温存。它一面让乳汁汩汩流进黑仔的嘴，让宝贝尽情地吃饱喝足，一面会伸出狼舌，一遍又一遍深情地舔着黑仔漆黑如墨的体毛，直舔得小宝贝浑身闪闪发亮。好一份舔犊之情。但溺爱的结果，却是狼性的扭曲！</p>\r\n\r\n<p>瞧瞧哺乳时黑仔的吃相吧。黑仔总是用一种优美的姿势仰面躺在它的腹下，用极轻柔的动作把它的奶头含在嘴里，很有节奏很有规律地轻轻吮吸，母子间显得非常和谐。</p>\r\n\r\n<p>这种吃奶的风格在狼群中是十分罕见的。</p>\r\n\r\n<p>这其实是狗崽的吃奶风格。</p>\r\n\r\n<p>紫岚过去在郎帕寨行窃时曾目睹过母狗喂奶，狗崽的表现和黑仔现在的表现十分相似，也是母子间配合默契，自然而然滋生出一种甜蜜的依恋。</p>\r\n\r\n<p>狗崽这种在哺乳期养成的对母狗的依恋对狗的生存是极其重要的。这种温情脉脉的哺乳风格，有利于诱发狗崽爱的天性，有利于泯灭狗崽身上残留的食肉类动物的野性，铸就狗的温良敦厚的性格。更主要的是，狗崽对母狗的那种依恋会随着年龄的增长而转移到主人身上，最后扩展到依恋整个人类。假如狗不具备这点爱心和恋情，人类是绝不会喜欢狗的，也不会把狗引以为最忠实的朋友，狗也就不可能依赖人类生存在这个地球上了。爱心和恋情实在是狗的安身立命的法宝。</p>\r\n\r\n<p>对狗来说是安身立命的法宝，对狼来讲无疑是致命的毒素。</p>\r\n\r\n<p>一般来说，幼狼刚出世的一段时间内，也会表现出依恋母狼的倾向。但到了哺乳后期，特别是临近断乳期时，这种恋母倾向便自然而然地开始淡化和消失。具体表现在吃奶风格的演变上。紫岚虽然还是第一次生育，但它早就熟睹了其他母狼在临近断乳期时的喂奶情景：幼狼像一伙患了饥饿症的小强盗，嗥叫着钻进母狼的腹下，根本不讲究姿势，朝母狼的奶头又抓又咬，狂吮滥吸，将狼的贪婪和野蛮的本性暴露无遗；常常是幼狼的爪子把母狼的乳房抓出一道道血痕，幼狼的牙齿把母狼的奶头咬得鲜血淋漓。于是，母狼便疼得惨叫一声，凶狠地用狼爪朝幼狼脑门上扇击，打得幼狼在地上打滚，或者以牙还牙，把幼狼脊背上的狼毛咬掉几撮。这当然很不近人情，却符合狼情。</p>\r\n\r\n<p>幼狼的这种行为看起来很残忍，却符合生存的最高原则。幼狼一经成年后便要离开母狼到荒蛮的草原和森林去独立谋生，没有依傍，没有靠山；假如狼不是自幼便割弃那种强烈的恋母情结，便会削弱它们的独立精神，软化它们桀骜不驯的野性；而狼就是靠这种独立不羁的嗜血本性才得以在充满激烈竞争的环境里生存下来的，这是物竞天择适者生存的结果。</p>\r\n\r\n<p>对幼狼来说，吃奶实际上是一种生存预习。客观上，这种出自天性的野蛮的吃奶风格有利于消除幼狼对母狼的依恋和母狼对幼狼的疼爱，形成一种离心力，有利于助长幼狼的独立倾向。在幼狼的意识中，母狼的乳房是它们的第一个掠食对象，它们正是从这种野蛮的吃奶方式中养成将来成年后独立谋生时所必须的血腥的捕食风格的。</p>\r\n\r\n<p>在紫岚的记忆中，几乎没有哪一匹生育过幼狼的母狼乳房上不是瘢痕累累的。唯独它是例外，快到断乳期了，乳房仍完好无损，光洁得找不出一点伤痕。由于受黑仔的影响，蓝魂儿、双毛和媚媚也依样学样地表现出温柔敦厚的吃奶风格。这虽然免除了紫岚的皮肉之苦，却使它十分忧虑。它害怕这样发展下去最终会使自己的宝贝消退掉对狼来说是十分宝贵的强取豪夺的野性，那么，别说把黑仔培养成下一代狼王了，恐怕连在荒原立足生存都会成问题。</p>\r\n\r\n<p>每次黑仔饱吮了乳汁后，便会摇晃着毛茸茸的脑袋来舔它的脖颈，或者打着饱嗝一会儿用后肢直立，一会儿满地打滚，做出种种取媚邀宠的姿态来。紫岚心里明白，黑仔是在对它表示自己的满足和得意，在感激它赐予和施舍的母性的恩泽。</p>\r\n\r\n<p>这完全不符合狼的行为规范。</p>\r\n\r\n<p>狼性是绝对贪婪的，永远不会得到满足。在狼的眼睛里，世界只存在一种谋生手段，那就是攫取和掠夺。事实上谁也不会对狼进行恩赐和施舍的。因此，狼对恩赐和施舍这样的概念应该十分陌生。狼的表情可以说相当丰富，悲伤、兴奋、怨恨、忧伤、欣喜、阴沉、暴怒&hellip;&hellip;等等，唯独不该有取媚邀宠这种表情形态。</p>\r\n\r\n<p>是自己过分的慈爱害了黑仔。</p>\r\n\r\n<p>必须立即控制住自己泛滥的母爱，把黑仔畸形的性格矫正过来，把扭曲的灵魂扳正过</p>\r\n\r\n<p>来！</p>\r\n\r\n<p>又到了喂奶的时候了，当黑仔温顺地捧着它的乳房吮吸时，它无缘无故地嗥叫一声，就好像自己的乳房被咬破了似的，一巴掌扇过去；它打得那么凶，那么狠，爪子落在黑仔后脑勺和耳根之间，立刻，空中飘飞起一团黑毛，一串殷红的血珠从黑仔的颈窝滴下来。黑仔惨叫一声，从洞底滚到洞口。</p>\r\n\r\n<p>自己下手下得太重了些，紫岚想。作为母狼，看到自己的宝贝被揍出血来，未免有点心疼，但它不后悔。它是狼，它不能有怜悯之心，它就是要打掉黑仔对它的依恋和温情。</p>\r\n\r\n<p>黑仔呜咽着，抖抖索索从地上翻爬起来，满脸委屈，一副可怜相，用乞求的眼光望着紫岚。黑仔，你不该这样望着我的，紫岚在心里叫道，你应该表现得像真正的狼崽那样，用困惑的表情来看着我；你的眼光应当变得冰凉，变得陌生，闪现出一道残忍的光芒。这才叫狼，狼的本质就是残忍，就是六亲不认，就是野性毕露，哪怕面对自己的亲生母亲。</p>\r\n\r\n<p>黑仔呜咽了一会儿，犹犹豫豫，又朝紫岚走来。仿佛紫岚是一块高性能的磁铁，对黑仔来说有一种无法割弃的磁力。你不能过来的，紫岚想，黑仔，你应当记恨我对你的暴行，你应当萌生出一种离异的情绪。只有学会对母亲仇视，你才能养成仇视整个世界的秉性，才能陶冶出让整个日曲卡雪山和尕玛尔草原颤抖的狼的野性。</p>\r\n\r\n<p>但紫岚的愿望落空了，黑仔走回它的身边，伸出粉嫩的舌头，小心翼翼地舔着它的前爪，舔得那么深情，那么专致，还用柔软的爪子把叮在紫岚腋窝上的一只绿头苍蝇驱赶掉。黑仔是在讨好它，想平息它的怒火，想乞求它的原谅和宽宥。你没做错什么，你不用乞求原谅的，紫岚想，即使你做错了什么，你也不该希冀得到宽宥的。狼的本性应该是我行我素，不顾一切。</p>\r\n\r\n<p>但黑仔一点也不理解它的心情，继续在它身边磨蹭着，把脸颊贴在它的腿上，完全是一副小鸟依人的可爱模样。一瞬间，紫岚狼的铁石心肠动摇了。真的，黑仔并没有什么过错，干吗要如此粗暴地对待它呢？但这种动摇仅仅持续了几秒钟，一种更为强大的情感压倒了母性的软弱和动摇。难道它能眼睁睁看着自己的宝贝退化成奴性十足的狗崽子吗？它能为了毫无实用价值的温情而毁了宝贝的锦绣前程吗？</p>\r\n\r\n<p>蓝魂儿、双毛和媚媚都蹲在石洞角隅，静静地观望着。狼崽们正处在性格塑造的关键阶段，倘若这次示范失败，会影响它们整个身心发育的。</p>\r\n\r\n<p>于是，紫岚再一次抡起前爪，朝黑仔的脑门扇去。这次扇得更凶猛，尖利的狼爪在黑仔的眉际划开一道血口子，黑仔四足腾空，被猛烈地撞在洞壁上。</p>\r\n\r\n<p>黑仔从喉咙里憋出一串低嚎，声音嘶哑，像在恶毒地诅咒，用充满仇恨的眼睛久久地瞪着紫岚。那眼光，像被冰雪浸渍过的石头，又冷又硬。这是一种叛离的眼光。</p>\r\n\r\n<p>黑仔是纯粹的狼种，血管里奔流着的是狼血，胸腔里跳动着的是狼心，不乏狼的残忍和野蛮。过去因为被紫岚过量的母爱浸泡着，暂时压抑了本性，此刻温情的面纱一旦被撕破，它很容易就恢复了狼崽的本来面目。</p>\r\n\r\n<p>望着黑仔狰狞的脸，按理说紫岚是应该感到高兴的。它耗费心机挑起衅端，不就是为了达到这个目的吗？但奇怪得很，它非但一点也高兴不起来，心里还像塞了一团棉花，堵得慌，有一种无法排遣的惆怅，有一种沉重的失落。淘气可爱让它心醉的宝贝从此不存在了，母子温柔缱绻相亲相依的情景只能在回忆和梦幻中再现了。温馨的感情似乎有一种魔力，不但迷人，也迷狼。紫岚明知道这是毒素，却也难弃难舍。可惜，它无法改变狼的生存方式。</p>\r\n\r\n<p>来吧，孩子，现在该伸出你的爪，张开你的嘴，来抢夺芬芳的乳汁了！</p>\r\n\r\n<p>其实，毋庸它呼唤，也毋庸它教诲，黑仔无师自通，张牙舞爪地冲进它怀里，对它的乳房又抓又咬，将殷红的血和雪白的奶一起吮吸进去。它疼得差不多想一口咬掉黑仔的耳朵了。</p>\r\n\r\n<p>这时，它瞥见，蹲在石洞角隅的蓝魂儿、双毛和媚媚，眼睛里都像变魔术般地换上了一副可怕的陌生的眼光，刺得它忍不住打了个寒噤。</p>\r\n\r\n<p>不，它应该感到欣喜才对，它想。</p>\r\n\r\n<p>三</p>\r\n\r\n<p>狼崽们断奶了。</p>\r\n\r\n<p>由于紫岚的偏爱和优先提供充裕的食物，黑仔长得出奇地健壮，颈粗实，臀浑圆，足足比蓝魂儿、双毛和媚媚高出半个肩胛，黑色的狼毛细密油亮，才半岁多点，乍一看，已像匹半大的公狼了。更令紫岚欣慰的是，黑仔精神上也趋于早熟，已很少和弟妹们打滚嬉闹，身上那股顽皮的孩子气似乎在一夜之间便消失了。每当蓝魂儿、双毛和媚媚在洞里玩追扑游戏时，黑仔总是站在一旁露出不屑一顾的神态。这未免有点孤独。但紫岚觉得，孤独实际上是出众的标志，是一种高贵的品性，想当年黑桑在狼群里也没有可以在一起不拘形迹打打闹闹的朋友，有的是嫉恨它不愿跟它接近，有的是害怕它不敢跟它接近，有的是因为敬畏而避开了它。不合群是因为超群，它天生应该是占据高位的狼王。</p>\r\n\r\n<p>紫岚并不为黑仔孤僻的性格感到担忧。</p>\r\n\r\n<p>断奶后的幼狼很能吃，四只狼崽几乎一顿就要吞食一头羊羔。紫岚虽然免除了乳房被撕破咬啮的痛苦，却比以前更辛苦了，清早就要到山林里去觅食，不但要填饱自己的肚皮，还要把新鲜的猎物拖回石洞。</p>\r\n\r\n<p>那天，紫岚拖着一只雪雉回窝，转过山岬，远远便望见黑仔站在石洞口，藤萝上白色的小花把它衬托得格外醒目。紫岚又惊又喜。惊的是黑仔违背了它的一再告诫没藏在石洞深处耐心等它捕食回来，而是跑到洞口来了，洞外是弱肉强食的世界，处处暗藏着杀机，随时都有可能遭遇不测；喜的是黑仔果然不同凡响。一般情况，半岁龄的幼狼，爪牙都还软弱，离开了母狼的监护，是不敢出窝的，往往还会表现出过分的机警和谨慎，须听到它熟悉的叫唤声，须闻到它熟悉的气味，才肯从洞内跑出来争享它带回的猎物。这种谨慎要持续到一岁以后，随着爪牙逐渐锋利，扑咬技艺日臻完善，幼狼才敢独自跑出巢穴。</p>\r\n\r\n<p>黑仔的胆魄是同龄狼崽的两倍！</p>\r\n\r\n<p>黑仔望见它的身影，欢快地嗥叫一声，蹿出石洞，急不可耐地从它口中抢夺雪雉。</p>\r\n\r\n<p>紫岚犹豫着，面对黑仔的冒险行为，不知该责备，还是该鼓励。站在母性的立场，毫无疑问，应当用严厉的手段教训黑仔，禁止它今后再去冒这种无谓的风险，要知道，站在石洞口，就等于把自己没有防卫能力的生命暴露给食肉类猛兽了。但从培育未来狼王的角度看，对黑仔所表现出来的超级胆量不但不应该制止，还应放纵和鼓励，超前教育才能塑造出杰出的&ldquo;超狼&rdquo;。紫岚又想起了黑桑，黑桑也是自小就很勇敢的，还在一岁时，就敢孤身闯进羚羊群，从公羊们犀利的羊角下扑咬羊羔了。可以这么说，超越年龄的胆魄正是日后成为狼王的必不可少的素质。</p>\r\n\r\n<p>想到这里，紫岚松开了叼在嘴角的雪雉，让黑仔整个儿抢走，这等于在告诉黑仔，妈妈很欣赏你站在洞口这样的勇敢行为，这只雪雉就是给你的奖励，假如你能继续发扬，你就能得到比你弟妹们多得多的食物。</p>\r\n\r\n<p>黑仔果然不辜负紫岚的期望，胆子越来越大，在它外出捕食时，不但跑到洞口玩耍，有时还会跑到洞外草丛里去追逐老鼠。有一次，一只灰毛兔崽子碰巧路过石洞，黑仔单身追撵，追出石洞一里多远，在箐沟的山泉旁才将猎物擒获。当黑仔拖着灰毛兔崽子摇摇晃晃回到紫岚身边，紫岚真比在冰天雪地中咬开大公鹿脖颈上的静脉血管饱吮一顿滚烫的鹿血还高兴十倍。当同龄的狼崽龟缩在巢穴不敢外出时，黑仔已经能独自闯荡山林猎食野兔了，那么，等到同龄的狼崽们走进丛林时，也许，黑仔已成为身心两方面都发育成熟的大公狼了。</p>\r\n\r\n<p>尽管这样，紫岚在欣喜的同时总为黑仔的安全捏一把汗。它是母狼，摆不脱母性的担忧。它以石洞为轴心，将方圆几里内的山林都踏勘了一遍，它搜索得特别仔细，连一个山洞一块岩石都不漏掉，很好，没有发现虎、豹、熊、野猪、蟒蛇等对幼狼生存构成威胁的野兽的粪便和踪迹。石洞是隐蔽而又安全的。</p>\r\n\r\n<p>紫岚这才放下心来。</p>\r\n\r\n<p>它忽视了来自天空的威胁。</p>\r\n\r\n<p>四</p>\r\n\r\n<p>厄运是从天而降的。</p>\r\n\r\n<p>在高耸入云的日曲卡雪山峻峭的悬崖上，栖息着一只金雕。金雕是食肉类猛禽，鹰类中的豪杰，长着一对铁爪和一只铁钩似的喙，能捕食比自己的身体还重三五倍的动物。这天清晨，它离巢到山林觅食。它渴望能捕到肥嫩的羊羔或可口的岩鸽，但今天它的运气不佳，太阳升得老高老高了，还一无所获。正当它饥渴难忍的时候，它盘旋到了石洞上空。它美丽的黄褐色的羽毛在阳光下泛出一道道金光，巨大的翅膀有时自由地舒展开，一扇一摇，鼓起一团团雄风，有时静止不动地撑张着，任凭山风吹拂，在宽广的天空随意滑翔。</p>\r\n\r\n<p>突然，它锐利的目光发现山麓有一片藤萝无风自动，钻出一只黑糊糊的家伙来。哦，原来此处有一个走兽藏身的洞穴。金雕俯瞰大地，视野开阔，那对淡黄色的眼珠灵敏度可以和人类精密的雷达相媲美。它眨动了一下眼皮，看清这黑糊糊的家伙原来是一匹幼狼，它的热情一下子减去了一半。它能猎食兔崽、羊羔和鹿崽，甚至敢叼啄剧毒的眼镜蛇，但对狼却畏惧三分。狼的机警在日曲卡雪山是出了名的，极难从空中偷袭成功；尖利的狼牙能毫不费劲地咬断鹰爪，咬折鹰翅，很有可能会弄巧成拙自己反倒成了饿狼果腹的食物。不到饿得万不得已，金雕是不会冒险袭击狼的。当然，它现在所看到的是一匹还没有多少防卫能力的幼狼，但肯定是在母狼的陪伴和监护下幼狼才敢走出洞穴玩耍的。护崽的母狼更凶残，更不好惹啊。</p>\r\n\r\n<p>金雕干咽了一口唾沫，正想拍拍翅膀飞到别处去觅食，但奇怪得很，在它的视野内，怎么就没出现母狼呢？石洞外，野花姹紫嫣红，那匹黑色的幼狼正在追逐一只仓皇逃窜的小松鼠，显得那么无忧无虑。会不会狡诈的母狼就躲在附近的暗处，单等它俯冲下去来扑咬它的鹰爪呢？不太像。母狼是不会冒风险将自己的幼崽当做诱饵的。再说，石洞前是一片平坦的草地，两边是稀疏的小树林，箐沟里是一道清澈的泉水，没有可以藏身的遮蔽物，它可以看清草叶上的七星瓢虫，即使母狼想躲起来，也逃不脱它的视线的。金雕对此十分自信。母狼唯一的可能，就是躲在藤萝遮掩的石洞里。金雕仄转翅膀，借助斜照的阳光，将自己的投影准确地落在石洞口的藤萝上，来回晃动着。倘若母狼确实藏在石洞里，一定会被它金雕恐怖的投影惊醒，慌慌张张蹿出来救护自己的幼崽的。</p>\r\n\r\n<p>但石洞静悄悄的，没有任何动静。</p>\r\n\r\n<p>金雕一阵兴奋，看来，自己运气不错，母狼不在附近，也许是到尕玛尔草原觅食去了。它还没有捕猎过狼，它很想尝尝狼肉究竟是个什么滋味。它在高空突然半闭起翅膀，急遽滑向大地。它的翅膀摩擦空气割裂山风发出轻微的声响。湛蓝的天空闪现出一道优美的俯冲线条，大地掠过一道恐怖的投影，鹰爪直指幼狼的脑壳。</p>\r\n\r\n<p>黑仔正在追撵一只淘气的金背小松鼠。小松鼠蹦蹦跳跳，一会儿跃上树枝，一会儿蹿下草地，逗得黑仔心里痒痒的。小松鼠翘着绛红色的蓬松的尾巴，竟然坐在离地面约一米多高的树丫上摘鸡素果吃了。黑仔馋涎欲滴，刚想奋力朝上扑击，猛然，碧绿的草地上出现一块奇怪的黑影，正在悄然移动。这时，要是黑仔撒开四爪，钻进不远处那片布满毒刺的荆棘丛，是能逃过这场劫难的。但它毕竟年幼，缺乏生存经验，根本没意识到草地上移动的黑影是正在向它俯冲的金雕的可怖的投影。它还觉得怪好玩的呢。当投影迅速朝它移近，越来越浓，最后完全笼罩在它身上时，它才发现情况不妙，急忙转身朝石洞奔逃。</p>\r\n\r\n<p>唉，狼怎么逃得过展翅飞翔的金雕呢。黑仔还没逃出几步远，随着一阵带着血腥味的狂风，它的脖颈和脊背仿佛同时被几把尖刀戳穿，它还没来得及呻吟，四爪已离开了地面，整个身体腾空而起。黑仔不愧是胆魄出众的幼狼，即便是身陷绝境了，也没被吓瘫，而是勇敢地扭翻身体，朝金雕的腹部咬了一口。可惜，它的狼牙还没完全长硬，只咬下几片金黄的雕毛，连同殷红的狼血，抛洒在碧绿的草地上。</p>\r\n\r\n<p>金雕怒啸一声，低头用尖喙朝黑仔的眼睛狠狠啄去。顿时，黑仔两眼漆黑&hellip;&hellip;</p>\r\n\r\n<p>这个时候，紫岚正在尕玛尔草原上追逐一只离群的香獐呢。</p>\r\n\r\n<p>黄昏，当紫岚踏着夕阳拖着香獐回到石洞时，一切都早已结束了。望着草地上凌乱的雕毛和已凝固了的斑斑狼血，它明白发生了什么事。它母性的心破碎了。高耸入云的日曲卡雪山山峰上，有一个小黑点在空中盘旋，那就是残害它苦心孤诣培育的&ldquo;超狼&rdquo;的金雕。它只能徒劳地对天空狂嗥一通，发泄自己的满腔悲愤。老天爷为什么总是这样不公平，命运为什么总是这样残酷，总是把不幸降落到它紫岚的头上？</p>\r\n\r\n<p>也怪自己太疏忽大意了，怪自己培养未来狼王的愿望太急切了，让黑仔过早地跨出洞穴走进严酷的丛林。也许，这正是命运对自己野心的一种惩罚。它在同命运的抗争中又输了一个回合，输得够惨的。不，它紫岚是不会服输的，优秀的狼是永远不会在厄运面前屈服的！</p>\r\n\r\n<p>它凄厉的嗥叫声惊醒了龟缩在石洞内的蓝魂儿、双毛和媚媚，三只狼崽整齐地排成一字形，站立在紫岚面前。横躺在紫岚和狼崽们中间的是刚刚捕获的已被咬断了喉管的香獐。</p>\r\n\r\n<p>香獐狭长而又丑陋的脸上毫无生气，古铜色的体毛上铺着一层玫瑰色的夕阳。</p>\r\n\r\n<p>突然，紫岚跳到早已死绝了的香獐身上，发疯般地咬开香獐的肚皮，扒出血淋淋的内脏，然后，用冷酷的眼光逼视着蓝魂儿。</p>\r\n\r\n<p>瞧这美味可口的獐心獐肝，以往只有黑仔才有资格享用的。黑仔死了，现在该轮到你了，蓝魂儿，来，过来，把这副獐心獐肝吃掉！现在该由你来顶替黑仔的位置了。</p>',NULL,NULL,'{\"meta_title\": \"第二章    培养黑仔 狼王梦\", \"meta_keywords\": \"111\", \"extra_features\": null, \"meta_description\": \"第二章    培养黑仔 狼王梦\"}',1,0,0,0,1,'2020-02-29 08:47:37','2020-02-29 08:58:52',NULL,NULL),(4,'第一章 车夫祥子',NULL,'<p>我们所要介绍的是祥子，不是骆驼，因为&ldquo;骆驼&rdquo;只是个外号；那么，我们就先说祥子，随手儿把骆驼与祥子那点关系说过去，也就算了。</p>\r\n\r\n<p>北平的洋车夫有许多派：年轻力壮，腿脚灵利的，讲究赁漂亮的车，拉&ldquo;整天儿&rdquo;，爱什么时候出车与收车都有自由；拉出车来，在固定的&ldquo;车口&rdquo;①或宅门一放，专等坐快车的主儿；弄好了，也许一下子弄个一块两块的；碰巧了，也许白耗一天，连&ldquo;车份儿&rdquo;也没着落，但也不在乎。这一派哥儿们的希望大概有两个：或是拉包车；或是自己买上辆车，有了自己的车，再去拉包月或散座就没大关系了，反正车是自己的。</p>\r\n\r\n<p>比这一派岁数稍大的，或因身体的关系而跑得稍差点劲的，或因家庭的关系而不敢白耗一天的，大概就多数的拉八成新的车；人与车都有相当的漂亮，所以在要价儿的时候也还能保持住相当的尊严。这派的车夫，也许拉&ldquo;整天&rdquo;，也许拉&ldquo;半天&rdquo;。在后者的情形下，因为还有相当的精气神，所以无论冬天夏天总是&ldquo;拉晚儿&rdquo;②。夜间，当然比白天需要更多的留神与本事；钱自然也多挣一些。</p>\r\n\r\n<p>年纪在四十以上，二十以下的，恐怕就不易在前两派里有个地位了。他们的车破，又不敢&ldquo;拉晚儿&rdquo;，所以只能早早的出车，希望能从清晨转到午后三四点钟，拉出&ldquo;车份儿&rdquo;和自己的嚼谷①。他们的车破，跑得慢，所以得多走路，少要钱。到瓜市，果市，菜市，去拉货物，都是他们；钱少，可是无须快跑呢。</p>\r\n\r\n<p>在这里，二十岁以下的&mdash;&mdash;有的从十一二岁就干这行儿&mdash;&mdash;很少能到二十岁以后改变成漂亮的车夫的，因为在幼年受了伤，很难健壮起来。他们也许拉一辈子洋车，而一辈子连拉车也没出过风头。那四十以上的人，有的是已拉了十年八年的车，筋肉的衰损使他们甘居人后，他们渐渐知道早晚是一个跟头会死在马路上。他们的拉车姿式，讲价时的随机应变，走路的抄近绕远，都足以使他们想起过去的光荣，而用鼻翅儿扇着那些后起之辈。可是这点光荣丝毫不能减少将来的黑暗，他们自己也因此在擦着汗的时节常常微叹。不过，以他们比较另一些四十上下岁的车夫，他们还似乎没有苦到了家。这一些是以前决没想到自己能与洋车发生关系，而到了生和死的界限已经不甚分明，才抄起车把来的。被撤差的巡警或校役，把本钱吃光的小贩，或是失业的工匠，到了卖无可卖，当无可当的时候，咬着牙，含着泪，上了这条到死亡之路。这些人，生命最鲜壮的时期已经卖掉，现在再把窝窝头变成的血汗滴在马路上。没有力气，没有经验，没有朋友，就是在同行的当中也得不到好气儿。他们拉最破的车，皮带不定一天泄多少次气；一边拉着人还得一边儿央求人家原谅，虽然十五个大铜子儿已经算是甜买卖。</p>\r\n\r\n<p>此外，因环境与知识的特异，又使一部分车夫另成派别。生于西苑海甸的自然以走西山，燕京，清华，较比方便；同样，在安定门外的走清河，北苑；在永定门外的走南苑&hellip;&hellip;这是跑长趟的，不</p>\r\n\r\n<p>愿拉零座；因为拉一趟便是一趟，不屑于三五个铜子的穷凑了。可是他们还不如东交民巷的车夫的气儿长，这些专拉洋买卖①的讲究一气儿由交民巷拉到玉泉山，颐和园或西山。气长也还算小事，一般车夫万不能争这项生意的原因，大半还是因为这些吃洋饭的有点与众不同的知识，他们会说外国话。英国兵，法国兵，所说的万寿山，雍和宫，&ldquo;八大胡同&rdquo;，他们都晓得。他们自己有一套外国话，不传授给别人。他们的跑法也特别，四六步儿不快不慢，低着头，目不旁视的，贴着马路边儿走，带出与世无争，而自有专长的神气。因为拉着洋人，他们可以不穿号坎，而一律的是长袖小白褂，白的或黑的裤子，裤筒特别肥，脚腕上系着细带；脚上是宽双脸千层底青布鞋；干净，利落，神气。一见这样的服装，别的车夫不会再过来争座与赛车，他们似乎是属于另一行业的。</p>\r\n\r\n<p>有了这点简单的分析，我们再说祥子的地位，就象说&mdash;&mdash;我们希望&mdash;&mdash;一盘机器上的某种钉子那么准确了。祥子，在与&ldquo;骆驼&rdquo;这个外号发生关系以前，是个较比有自由的洋车夫，这就是说，他是属于年轻力壮，而且自己有车的那一类：自己的车，自己的生活，都在自己手里，高等车夫。这可绝不是件容易的事。一年，二年，至少有三四年；一滴汗，两滴汗，不知道多少万滴汗，才挣出那辆车。从风里雨里的咬牙，从饭里茶里的自苦，才赚出那辆车。那辆车是他的一切挣扎与困苦的总结果与报酬，象身经百战的武士的一颗徽章。在他赁人家的车的时候，他从早到晚，由东到西，由南到北，象被人家抽着转的陀螺；他没有自己。可是在这种旋转之中，他的眼并没有花，心并没有乱，他老想着远远的一辆车，可以使他自由，独立，象自己的手脚的那么一辆车。有了自己的车，他可以不再受拴车的人们的气，也无须敷衍别人；有自己的力气与洋车，睁开眼就可以有饭吃。</p>\r\n\r\n<p>他不怕吃苦，也没有一般洋车夫的可以原谅而不便效法的恶习，他的聪明和努力都足以使他的志愿成为事实。假若他的环境好一些，或多受着点教育，他一定不会落在&ldquo;胶皮团&rdquo;①里，而且无论是干什么，他总不会辜负了他的机会。不幸，他必须拉洋车；好，在这个营生里他也证明出他的能力与聪明。他仿佛就是在地狱里也能作个好鬼似的。生长在乡间，失去了父母与几亩薄田，十八岁的时候便跑到城里来。带着乡间小伙子的足壮与诚实，凡是以卖力气就能吃饭的事他几乎全作过了。可是，不久他就看出来，拉车是件更容易挣钱的事；作别的苦工，收入是有限的；拉车多着一些变化与机会，不知道在什么时候与地点就会遇到一些多于所希望的报酬。自然，他也晓得这样的机遇不完全出于偶然，而必须人与车都得漂亮精神，有货可卖才能遇到识货的人。想了一想，他相信自己有那个资格：他有力气，年纪正轻；所差的是他还没有跑过，与不敢一上手就拉漂亮的车。但这不是不能胜过的困难，有他的身体与力气作基础，他只要试验个十天半月的，就一定能跑得有个样子，然后去赁辆新车，说不定很快的就能拉上包车，然后省吃俭用的一年二年，即使是三四年，他必能自己打上一辆车，顶漂亮的车！看着自己的青年的肌肉，他以为这只是时间的问题，这是必能达到的一个志愿与目的，绝不是梦想！</p>\r\n\r\n<p>他的身量与筋肉都发展到年岁前边去；二十来的岁，他已经很大很高，虽然肢体还没被年月铸成一定的格局，可是已经象个成人了&mdash;&mdash;一个脸上身上都带出天真淘气的样子的大人。看着那高等的车夫，他计划着怎样杀进他的腰①去，好更显出他的铁扇面似的胸，与直硬的背；扭头看看自己的肩，多么宽，多么威严！杀好了腰，再穿上肥腿的白裤，裤脚用鸡肠子带儿系住，露出那对&ldquo;出<br />\r\n号&rdquo;的大脚！是的，他无疑的可以成为最出色的车夫；傻子似的他自己笑了。他没有什么模样，使他可爱的是脸上的精神。头不很大，圆眼，肉鼻子，两条眉很短很粗，头上永远剃得发亮。腮上没</p>\r\n\r\n<p>有多余的肉，脖子可是几乎与头一边儿②粗；脸上永远红扑扑的，特别亮的是颧骨与右耳之间一块不小的疤&mdash;&mdash;小时候在树下睡觉，被驴啃了一口。他不甚注意他的模样，他爱自己的脸正如同他爱自己的身体，都那么结实硬棒；他把脸仿佛算在四肢之内，只要硬棒就好。是的，到城里以后，他还能头朝下，倒着立半天。这样立着，他觉得，他就很象一棵树，上下没有一个地方不挺脱的。</p>\r\n\r\n<p>他确乎有点象一棵树，坚壮，沉默，而又有生气。他有自己的</p>\r\n\r\n<p>打算，有些心眼，但不好向别人讲论。在洋车夫里，个人的委屈与困难是公众的话料，&ldquo;车口儿&rdquo;上，小茶馆中，大杂院里，每人报告着形容着或吵嚷着自己的事，而后这些事成为大家的财产，象民歌似的由一处传到一处。祥子是乡下人，口齿没有城里人那么灵便；设若口齿灵利是出于天才，他天生来的不愿多说话，所以也不愿学着城里人的贫嘴恶舌。他的事他知道，不喜欢和别人讨论。因为嘴常闲着，所以他有工夫去思想，他的眼仿佛是老看着自己的心。只要他的主意打定，他便随着心中所开开的那条路儿走；假若走不通的话，他能一两天不出一声，咬着牙，好似咬着自己的心！他决定去拉车，就拉车去了。赁了辆破车，他先练练腿。第一天没拉着什么钱。第二天的生意不错，可是躺了两天，他的脚脖子肿得象两条瓠子似的，再也抬不起来。他忍受着，不管是怎样的疼痛。他知道这是不可避免的事，这是拉车必须经过的一关。非过了这一关，他不能放胆的去跑。</p>\r\n\r\n<p>脚好了之后，他敢跑了。这使他非常的痛快，因为别的没有什么可怕的了：地名他很熟习，即使有时候绕点远也没大关系，好在自己有的是力气。拉车的方法，以他干过的那些推，拉，扛，挑的经验来领会，也不算十分难。况且他有他的主意：多留神，少争胜，大概总不会出了毛病。至于讲价争座，他的嘴慢气盛，弄不过那些老油子们。知道这个短处，他干脆不大到&ldquo;车口儿&rdquo;上去；哪里没车，他放在哪里。在这僻静的地点，他可以从容的讲价，而且有时候不肯要价，只说声：&ldquo;坐上吧，瞧着给！&rdquo;他的样子是那么诚实，脸上是那么简单可爱，人们好象只好信任他，不敢想这个傻大个子是会敲人的。即使人们疑心，也只能怀疑他是新到城里来的乡下老儿，大概不认识路，所以讲不出价钱来。及至人们问到，&ldquo;认识呀？&rdquo;他就又象装傻，又象耍俏的那么一笑，使人们不知怎样才好。</p>\r\n\r\n<p>两三个星期的工夫，他把腿溜出来了。他晓得自己的跑法很好看。跑法是车夫的能力与资格的证据。那撇着脚，象一对蒲扇在地上扇乎的，无疑的是刚由乡间上来的新手。那头低得很深，双脚蹭地，跑和走的速度差不多，而颇有跑的表示的，是那些五十岁以上的老者们。那经验十足而没什么力气的却另有一种方法：胸向内含，度数很深；腿抬得很高；一走一探头；这样，他们就带出跑得很用力的样子，而在事实上一点也不比别人快；他们仗着&ldquo;作派&rdquo;去维持自己的尊严。祥子当然决不采取这几种姿态。他的腿长步大，腰里非常的稳，跑起来没有多少响声，步步都有些伸缩，车把不动，使座儿觉到安全，舒服。说站住，不论在跑得多么快的时候，大脚在地上轻蹭两蹭，就站住了；他的力气似乎能达到车的各部分。脊背微俯，双手松松拢住车把，他活动，利落，准确；看不出急促而跑得很快，快而没有危险。就是在拉包车的里面，这也得算很名贵的。</p>\r\n\r\n<p>他换了新车。从一换车那天，他就打听明白了，象他赁的那辆&mdash;&mdash;弓子软，铜活地道，雨布大帘，双灯，细脖大铜喇叭&mdash;&mdash;值一百出头；若是漆工与铜活含忽一点呢，一百元便可以打住。大概的说吧，他只要有一百块钱，就能弄一辆车。猛然一想，一天要是能剩一角的话，一百元就是一千天，一千天！把一千天堆到一块，他几乎算不过来这该有多么远。但是，他下了决心，一千天，一万天也好，他得买车！第一步他应当，他想好了，去拉包车。遇上交际多，饭局①多的主儿②，平均一月有上十来个饭局，他就可以白落两三块的车饭钱。加上他每月再省出个块儿八角的，也许是三头五块的，一年就能剩起五六十块！这样，他的希望就近便多多了。他不吃烟，不喝酒，不赌钱，没有任何嗜好，没有家庭的累赘，只要他自己肯咬牙，事儿就没有个不成。他对自己起下了誓，一年半的工夫，他&mdash;&mdash;祥子&mdash;&mdash;非打成自己的车不可！是现打的，不要旧车见过新的。</p>\r\n\r\n<p>他真拉上了包月。可是，事实并不完全帮助希望。不错，他确是咬了牙，但是到了一年半他并没还上那个愿。包车确是拉上了，而且谨慎小心的看着事情；不幸，世上的事并不是一面儿的。他自管小心他的，东家并不因此就不辞他；不定是三两个月，还是十天八天，吹③了！他得另去找事。自然，他得一边儿找事，还得一边儿拉散座；骑马找马，他不能闲起来。在这种时节，他常常闹错儿。他还强打着精神，不专为混一天的嚼谷，而且要继续着积储买车的钱。可是强打精神永远不是件妥当的事：拉起车来，他不能专心一志的跑，好象老想着些什么，越想便越害怕，越气不平。假若老这么下去，几时才能买上车呢？为什么这样呢？难道自己还算个不要强的？在这么乱想的时候，他忘了素日的谨慎。皮轮子上了碎铜烂磁片，放了炮；只好收车。更严重一些的，有时候碰了行人，甚至有一次因急于挤过去而把车轴盖碰丢了。设若他是拉着包车，这些错儿绝不能发生；一搁下了事，他心中不痛快，便有点楞头磕脑的。碰坏了车，自然要赔钱；这更使他焦躁，火上加了油；为怕惹出更大的祸，他有时候懊睡一整天。及至睁开眼，一天的工夫已白白过去，他又后悔，自恨。还有呢，在这种时期，他越着急便越自苦，吃喝越没规则；他以为自己是铁作的，可是敢情他也会病。病了，他舍不得钱去买药，自己硬挺着；结果，病越来越重，不但得买药，而且得一气儿休息好几天。这些个困难，使他更咬牙努力，可是买车的钱数一点不因此而加快的凑足。整整的三年，他凑足了一百块钱！</p>\r\n\r\n<p>他不能再等了。原来的计划是买辆最完全最新式最可心的车，现在只好按着一百块钱说了。不能再等；万一出点什么事再丢失几块呢！恰巧有辆刚打好的车（定作而没钱取货的）跟他所期望的车差不甚多；本来值一百多，可是因为定钱放弃了，车铺愿意少要一点。祥子的脸通红，手哆嗦着，拍出九十六块钱来：&ldquo;我要这辆车！&rdquo;铺主打算挤到个整数，说了不知多少话，把他的车拉出去又拉进来，支开棚子，又放下，按按喇叭，每一个动作都伴着一大串最好的形容词；最后还在钢轮条上踢了两脚，&ldquo;听听声儿吧，铃铛似的！拉去吧，你就是把车拉碎了，要是钢条软了一根，你拿回来，把它摔在我脸上！一百块，少一分咱们吹！&rdquo;祥子把钱又数了一遍：&ldquo;我要这辆车，九十六！&rdquo;铺主知道是遇见了一个心眼的人，看看钱，看看祥子，叹了口气：&ldquo;交个朋友，车算你的了；保六个月：除非你把大箱碰碎，我都白给修理；保单，拿着！&rdquo;</p>\r\n\r\n<p>祥子的手哆嗦得更厉害了，揣起保单，拉起车，几乎要哭出来。拉到个僻静地方，细细端详自己的车，在漆板上试着照照自己的脸！越看越可爱，就是那不尽合自己的理想的地方也都可以原谅了，因为已经是自己的车了。把车看得似乎暂时可以休息会儿了，他坐在了水簸箕的新脚垫儿上，看着车把上的发亮的黄铜喇叭。他忽然想起来，今年是二十二岁。因为父母死得早，他忘了生日是在哪一天。自从到城里来，他没过一次生日。好吧，今天买上了新车，就算是生日吧，人的也是车的，好记，而且车既是自己的心血，简直没什么不可以把人与车算在一块的地方。</p>\r\n\r\n<p>怎样过这个&ldquo;双寿&rdquo;呢？祥子有主意：头一个买卖必须拉个穿得体面的人，绝对不能是个女的。最好是拉到前门，其次是东安市场。拉到了，他应当在最好的饭摊上吃顿饭，如热烧饼夹爆羊肉之类的东西。吃完，有好买卖呢就再拉一两个；没有呢，就收车；这是生日！</p>\r\n\r\n<p>自从有了这辆车，他的生活过得越来越起劲了。拉包月也好，拉散座也好，他天天用不着为&ldquo;车份儿&rdquo;着急，拉多少钱全是自己的。心里舒服，对人就更和气，买卖也就更顺心。拉了半年，他的希望更大了：照这样下去，干上二年，至多二年，他就又可以买辆车，一辆，两辆&hellip;&hellip;他也可以开车厂子了！<br />\r\n可是，希望多半落空，祥子的也非例外。</p>',NULL,NULL,'{\"meta_title\": \"第一章 车夫祥子\", \"meta_keywords\": null, \"extra_features\": null, \"meta_description\": null}',2,0,0,0,1,'2020-02-29 09:11:45','2020-03-09 15:39:50','books/audio/6bbef71aaf2bb2ab95424bccc0285aa6.mp3',NULL),(5,'第二章 我的车丢了',NULL,'<p>因为高兴，胆子也就大起来；自从买了车，祥子跑得更快了。自己的车，当然格外小心，可是他看看自己，再看看自己的车，就觉得有些不是味儿，假若不快跑的话。</p>\r\n\r\n<p>他自己，自从到城里来，又长高了一寸多。他自己觉出来，仿佛还得往高里长呢。不错，他的皮肤与模样都更硬棒与固定了一些，而且上唇上已有了小小的胡子；可是他以为还应当再长高一些。当他走到个小屋门或街门而必须大低头才能进去的时候，他虽不说什么，可是心中暗自喜欢，因为他已经是这么高大，而觉得还正在发长，他似乎既是个成人，又是个孩子，非常有趣。</p>\r\n\r\n<p>这么大的人，拉上那么美的车，他自己的车，弓子软得颤悠颤悠的，连车把都微微的动弹；车箱是那么亮，垫子是那么白，喇叭是那么响；跑得不快怎能对得起自己呢，怎能对得起那辆车呢？这一点不是虚荣心，而似乎是一种责任，非快跑，飞跑，不足以充分发挥自己的力量与车的优美。那辆车也真是可爱，拉过了半年来的，仿佛处处都有了知觉与感情，祥子的一扭腰，一蹲腿，或一直脊背，它都就马上应合着，给祥子以最顺心的帮助，他与它之间没有一点隔膜别扭的地方。赶到遇上地平人少的地方，祥子可以用一只手拢着把，微微轻响的皮轮象阵利飕的小风似的催着他跑，飞快而平稳。拉到了地点，祥子的衣裤都拧得出汗来，哗哗的，象刚从水盆里捞出来的。他感到疲乏，可是很痛快的，值得骄傲的，一种疲乏，如同骑着名马跑了几十里那样。假若胆壮不就是大意，祥子在放胆跑的时候可并不大意。不快跑若是对不起人，快跑而碰伤了车便对不起自己。车是他的命，他知道怎样的小心。小心与大胆放在一处，他便越来越能自信，他深信自己与车都是铁作的。</p>\r\n\r\n<p>因此，他不但敢放胆的跑，对于什么时候出车也不大去考虑。他觉得用力拉车去挣口饭吃，是天下最有骨气的事；他愿意出去，没人可以拦住他。外面的谣言他不大往心里听，什么西苑又来了兵，什么长辛店又打上了仗，什么西直门外又在拉案，什么齐化门已经关了半天，他都不大注意。自然，街上铺户已都上了门，而马路上站满了武装警察与保安队，他也不便故意去找不自在，也和别人一样急忙收了车。可是，谣言，他不信。他知道怎样谨慎，特别因为车是自己的，但是他究竟是乡下人，不象城里人那样听见风便是雨。再说，他的身体使他相信，即使不幸赶到&ldquo;点儿&rdquo;上，他必定有办法，不至于吃很大的亏；他不是容易欺侮的，那么大的个子，那么宽的肩膀！</p>\r\n\r\n<p>战争的消息与谣言几乎每年随着春麦一块儿往起长，麦穗与刺刀可以算作北方人的希望与忧惧的象征。祥子的新车刚交半岁的时候，正是麦子需要春雨的时节。春雨不一定顺着人民的盼望而降落，可是战争不管有没有人盼望总会来到。谣言吧，真事儿吧，祥子似乎忘了他曾经作过庄稼活；他不大关心战争怎样的毁坏田地，也不大注意春雨的有无。他只关心他的车，他的车能产生烙饼与一切吃食，它是块万能的田地，很驯顺的随着他走，一块活地，宝地。因为缺雨，因为战争的消息，粮食都长了价钱；这个，祥子知道。可是他和城里人一样的只会抱怨粮食贵，而一点主意没有；粮食贵，贵吧，谁有法儿教它贱呢？这种态度使他只顾自己的生活，把一切祸患灾难都放在脑后。</p>\r\n\r\n<p>设若城里的人对于一切都没有办法，他们可会造谣言&mdash;&mdash;有时完全无中生有，有时把一分真事说成十分&mdash;&mdash;以便显出他们并不愚傻与不作事。他们象些小鱼，闲着的时候把嘴放在水皮上，吐出几个完全没用的水泡儿也怪得意。在谣言里，最有意思是关于战争的。别种谣言往往始终是谣言，好象谈鬼说狐那样，不会说着说着就真见了鬼。关于战争的，正是因为根本没有正确消息，谣言反倒能立竿见影。在小节目上也许与真事有很大的出入，可是对于战争本身的有无，十之八九是正确的。&ldquo;要打仗了！&rdquo;这句话一经出口，早晚准会打仗；至于谁和谁打，与怎么打，那就一个人一个说法了。祥子并不是不知道这个。不过，干苦工的人们&mdash;&mdash;拉车的也在内&mdash;&mdash;虽然不会欢迎战争，可是碰到了它也不一定就准倒霉。每逢战争一来，最着慌的是阔人们。他们一听见风声不好，赶快就想逃命；钱使他们来得快，也跑得快。他们自己可是不会跑，因为腿脚被钱赘的太沉重。他们得雇许多人作他们的腿，箱子得有人抬，老幼男女得有车拉；在这个时候，专卖手脚的哥儿们的手与脚就一律贵起来：&ldquo;前门，东车站！&rdquo;&ldquo;哪儿？&rdquo;&ldquo;东&mdash;&mdash;&mdash;&mdash;站！&rdquo;&ldquo;呕，干脆就给一块四毛钱！不用驳回，兵荒马乱的！&rdquo;</p>\r\n\r\n<p>就是在这个情形下，祥子把车拉出城去。谣言已经有十来天了，东西已都涨了价，可是战事似乎还在老远，一时半会儿不会打到北平来。祥子还照常拉车，并不因为谣言而偷点懒。有一天，拉到了西城，他看出点棱缝来。在护国寺街西口和新街口没有一个招</p>\r\n\r\n<p>&ldquo;西苑哪？清华呀？&rdquo;的。在新街口附近他转悠了一会儿。听说车已经都不敢出城，西直门外正在抓车，大车小车骡车洋车一齐抓。</p>\r\n\r\n<p>他想喝碗茶就往南放车；车口的冷静露出真的危险，他有相当的胆子，但是不便故意的走死路。正在这个接骨眼儿，从南来了两辆车，车上坐着的好象是学生。拉车的一边走，一边儿喊：&ldquo;有上清华的没有？嗨，清华！&rdquo;</p>\r\n\r\n<p>车口上的几辆车没有人答碴儿，大家有的看着那两辆车淡而不厌的微笑，有的叼着小烟袋坐着，连头也不抬。那两辆车还继续的喊：&ldquo;都哑吧了？清华！&rdquo;</p>\r\n\r\n<p>&ldquo;两块钱吧，我去！&rdquo;一个年轻光头的矮子看别人不出声，开玩笑似的答应了这么一句。</p>\r\n\r\n<p>&ldquo;拉过来！再找一辆！&rdquo;那两辆车停住了。</p>\r\n\r\n<p>年轻光头的楞了一会儿，似乎不知怎样好了。别人还都不动。祥子看出来，出城一定有危险，要不然两块钱清华&mdash;&mdash;平常只是二三毛钱的事儿&mdash;&mdash;为什么会没人抢呢？他也不想去。可是那个光头的小伙子似乎打定了主意，要是有人陪他跑一趟的话，他就豁出去了；他一眼看中了祥子：&ldquo;大个子，你怎样？&rdquo;<br />\r\n&ldquo;大个子&rdquo;三个字把祥子招笑了，这是一种赞美。他心中打开了转儿：凭这样的赞美，似乎也应当捧那身矮胆大的光头一场；再说呢，两块钱是两块钱，这不是天天能遇到的事。危险？难道就那样巧？况且，前两天还有人说天坛住满了兵；他亲眼看见的，那里连个兵毛儿也没有。这么一想，他把车拉过去了。</p>\r\n\r\n<p>拉到了西直门，城洞里几乎没有什么行人。祥子的心凉了一些。光头也看出不妙，可是还笑着说：&ldquo;招呼吧①，伙计！是福不是祸②，今儿个就是今儿个③啦！&rdquo;祥子知道事情要坏，可是在街面上混了这几年了，不能说了不算，不能耍老娘们脾气！</p>\r\n\r\n<p>出了西直门，真是连一辆车也没遇上；祥子低下头去，不敢再看马路的左右。他的心好象直顶他的肋条。到了高亮桥，他向四围打了一眼，并没有一个兵，他又放了点心。两块钱到底是两块钱，他盘算着，没点胆子哪能找到这么俏的事。他平常很不喜欢说话，可是这阵儿他愿意跟光头的矮子说几句，街上清静得真可怕。&ldquo;抄土道走吧？马路上&mdash;&mdash;&rdquo;&ldquo;那还用说，&rdquo;矮子猜到他的意思，&ldquo;自要一上了便道，咱们就算有点底儿了！&rdquo;</p>\r\n\r\n<p>还没拉到便道上，祥子和光头的矮子连车带人都被十来个兵捉了去！</p>\r\n\r\n<p>虽然已到妙峰山开庙进香的时节，夜里的寒气可还不是一件单衫所能挡得住的。祥子的身上没有任何累赘，除了一件灰色单军服上身，和一条蓝布军裤，都被汗沤得奇臭&mdash;&mdash;自从还没到他身上的时候已经如此。由这身破军衣，他想起自己原来穿着的白布小褂与那套阴丹士林蓝的夹裤褂；那是多么干净体面！是的，世界上还有许多比阴丹士林蓝更体面的东西，可是祥子知道自己混到那么干净利落已经是怎样的不容易。闻着现在身上的臭汗味，他把以前的挣扎与成功看得分外光荣，比原来的光荣放大了十倍。他越想着过去便越恨那些兵们。他的衣服鞋帽，洋车，甚至于系腰的布带，都被他们抢了去；只留给他青一块紫一块的一身伤，和满脚的疱！不过，衣服，算不了什么；身上的伤，不久就会好的。他的车，几年的血汗挣出来的那辆车，没了！自从一拉到营盘里就不见了！以前的一切辛苦困难都可一眨眼忘掉，可是他忘不了这辆车！</p>\r\n\r\n<p>吃苦，他不怕；可是再弄上一辆车不是随便一说就行的事；至少还得几年的工夫！过去的成功全算白饶，他得重打鼓另开张打头儿来！祥子落了泪！他不但恨那些兵，而且恨世上的一切了。凭什么把人欺侮到这个地步呢？凭什么？&ldquo;凭什么？&rdquo;他喊了出来。</p>\r\n\r\n<p>这一喊&mdash;&mdash;虽然痛快了些&mdash;&mdash;马上使他想起危险来。别的先不去管吧，逃命要紧！</p>\r\n\r\n<p>他在哪里呢？他自己也不能正确的回答出。这些日子了，他随着兵们跑，汗从头上一直流到脚后跟。走，得扛着拉着或推着兵们的东西；站住，他得去挑水烧火喂牲口。他一天到晚只知道怎样把最后的力气放在手上脚上，心中成了块空白。到了夜晚，头一挨地他便象死了过去，而永远不再睁眼也并非一定是件坏事。</p>\r\n\r\n<p>最初，他似乎记得兵们是往妙峰山一带退却。及至到了后山，他只顾得爬山了，而时时想到不定哪时他会一交跌到山涧里，把骨肉被野鹰们啄尽，不顾得别的。在山中绕了许多天，忽然有一天山路越来越少，当太阳在他背后的时候，他远远的看见了平地。晚饭的号声把出营的兵丁唤回，有几个扛着枪的牵来几匹骆驼。</p>\r\n\r\n<p>骆驼！祥子的心一动，忽然的他会思想了，好象迷了路的人忽然找到一个熟识的标记，把一切都极快的想了起来。骆驼不会过山，他一定是来到了平地。在他的知识里，他晓得京西一带，象八里庄，黄村，北辛安，磨石口，五里屯，三家店，都有养骆驼的。难道绕来绕去，绕到磨石口来了吗？这是什么战略&mdash;&mdash;假使这群只会跑路与抢劫的兵们也会有战略&mdash;&mdash;他不晓得。可是他确知道，假如这真是磨石口的话，兵们必是绕不出山去，而想到山下来找个活路。磨石口是个好地方，往东北可以回到西山；往南可以奔长辛店，或丰台；一直出口子往西也是条出路。他为兵们这么盘算，心中也就为自己画出一条道儿来：这到了他逃走的时候了。万一兵们再退回乱山里去，他就是逃出兵的手掌，也还有饿死的危险。要逃，就得乘这个机会。由这里一跑，他相信，一步就能跑回海甸！虽然中间隔着那么多地方，可是他都知道呀；一闭眼，他就有了个地图：这里是磨石口&mdash;&mdash;老天爷，这必须是磨石口！&mdash;&mdash;他往东北拐，过金顶山，礼王坟，就是八大处；从四平台往东奔杏子口，就到了南辛庄。为是有些遮隐，他顶好还顺着山走，从北辛庄，往北，过魏家村；往北，过南河滩；再往北，到红山头，杰王府；静宜园了！找到静宜园，闭着眼他也可以摸到海甸去！他的心要跳出来！这些日子，他的血似乎全流到四肢上去；这一刻，仿佛全归到心上来；心中发热，四肢反倒冷起来；热望使他混身发颤！</p>\r\n\r\n<p>一直到半夜，他还合不上眼。希望使他快活，恐惧使他惊惶，他想睡，但睡不着，四肢象散了似的在一些干草上放着。什么响动也没有，只有天上的星伴着自己的心跳。骆驼忽然哀叫了两声，离他不远。他喜欢这个声音，象夜间忽然听到鸡鸣那样使人悲哀，又觉得有些安慰。</p>\r\n\r\n<p>远处有了炮声，很远，但清清楚楚的是炮声。他不敢动，可是马上营里乱起来。他闭住了气，机会到了！他准知道，兵们又得退却，而且一定是往山中去。这些日子的经验使他知道，这些兵的打仗方法和困在屋中的蜜蜂一样，只会到处乱撞。有了炮声，兵们一定得跑；那么，他自己也该精神着点了。他慢慢的，闭着气，在地上爬，目的是在找到那几匹骆驼。他明知道骆驼不会帮助他什么，但他和它们既同是俘虏，好象必须有些同情。军营里更乱了，他找到了骆驼&mdash;&mdash;几块土岗似的在黑暗中爬伏着，除了粗大的呼吸，一点动静也没有，似乎天下都很太平。这个，教他壮起点胆子来。他伏在骆驼旁边，象兵丁藏在沙口袋后面那样。极快的他想出个道理来：炮声是由南边来的，即使不是真心作战，至少也是个&ldquo;此路不</p>\r\n\r\n<p>通&rdquo;的警告。那么，这些兵还得逃回山中去。真要是上山，他们不能带着骆驼。这样，骆驼的命运也就是他的命运。他们要是不放弃这几个牲口呢，他也跟着完事；他们忘记了骆驼，他就可以逃走。把耳朵贴在地上，他听着有没有脚步声儿来，心跳得极快。</p>\r\n\r\n<p>不知等了多久，始终没人来拉骆驼。他大着胆子坐起来，从骆驼的双峰间望过去，什么也看不见，四外极黑。逃吧！不管是吉是凶，逃！</p>',NULL,NULL,'{\"meta_title\": \"第二章 我的车丢了\", \"meta_keywords\": null, \"extra_features\": null, \"meta_description\": null}',2,0,0,0,1,'2020-02-29 09:12:19','2020-03-04 15:55:31',NULL,NULL),(6,'第三章 逃兵',NULL,'<p>祥子已经跑出二三十步去，可又不肯跑了，他舍不得那几匹骆驼。他在世界上的财产，现在，只剩下了自己的一条命。就是地上的一根麻绳，他也乐意拾起来，即使没用，还能稍微安慰他一下，至少他手中有条麻绳，不完全是空的。逃命是要紧的，可是赤裸裸的一条命有什么用呢？他得带走这几匹牲口，虽然还没想起骆驼能有什么用处，可是总得算是几件东西，而且是块儿不小的东西。</p>\r\n\r\n<p>他把骆驼拉了起来。对待骆驼的方法，他不大晓得，可是他不怕它们，因为来自乡间，他敢挨近牲口们。骆驼们很慢很慢的立起来，他顾不得细调查它们是不是都在一块儿拴着，觉到可以拉着走了，他便迈开了步，不管是拉起来一个，还是全&ldquo;把儿&rdquo;。</p>\r\n\r\n<p>一迈步，他后悔了。骆驼&mdash;&mdash;在口内负重惯了的&mdash;&mdash;是走不快的。不但是得慢走，还须极小心的慢走，骆驼怕滑；一汪儿水，一片儿泥，都可以教它们劈了腿，或折扭了膝。骆驼的价值全在四条腿上；腿一完，全完！而祥子是想逃命呀！</p>\r\n\r\n<p>可是，他不肯再放下它们。一切都交给天了，白得来的骆驼是不能放手的！</p>\r\n\r\n<p>因拉惯了车，祥子很有些辨别方向的能力。虽然如此，他现在心中可有点乱。当他找到骆驼们的时候，他的心似乎全放在它们身上了；及至把它们拉起来，他弄不清哪儿是哪儿了，天是那么黑，心中是那么急，即使他会看看星，调一调方向，他也不敢从容的去这么办；星星们&mdash;&mdash;在他眼中&mdash;&mdash;好似比他还着急，你碰我，我碰<br />\r\n你的在黑空中乱动。祥子不敢再看天上。他低着头，心里急而脚步不敢放快的往前走。他想起了这个：既是拉着骆驼，便须顺着大道走，不能再沿着山坡儿。由磨石口&mdash;&mdash;假如这是磨石口&mdash;&mdash;到黄村，是条直路。这既是走骆驼的大路，而且一点不绕远儿。&ldquo;不绕<br />\r\n远儿&rdquo;在一个洋车夫心里有很大的价值。不过，这条路上没有遮掩！万一再遇上兵呢？即使遇不上大兵，他自己那身破军衣，脸上的泥，与那一脑袋的长头发，能使人相信他是个拉骆驼的吗？不象，绝不象个拉骆驼的！倒很象个逃兵！逃兵，被官中拿去还倒是小事；教村中的人们捉住，至少是活埋！想到这儿，他哆嗦起来，背后骆驼蹄子噗噗轻响猛然吓了他一跳。他要打算逃命，还是得放弃这几个累赘。可是到底不肯撒手骆驼鼻子上的那条绳子。走吧，走，走到哪里算哪里，遇见什么说什么；活了呢，赚几条牲口；死了呢，认命！可是，他把军衣脱下来：一把，将领子扯掉；那对还肯负责任的铜钮也被揪下来，掷在黑暗中，连个响声也没发。然后，他把这件无领无钮的单衣斜搭在身上，把两条袖子在胸前结成个结子，象背包袱那样。这个，他以为可以减少些败兵的嫌疑；裤子也挽高起来一块。他知道这还不十分象拉骆驼的，可是至少也不完全象个逃兵了。加上他脸上的泥，身上的汗，大概也够个&ldquo;煤黑子&rdquo;的谱儿①了。他的思想很慢，可是想得很周到，而且想起来马上就去执行。夜黑天里，没人看见他；他本来无须乎立刻这样办；可是他等不得。他不知道时间，也许忽然就会天亮。既没顺着山路走，他白天没有可以隐藏起来的机会；要打算白天也照样赶路的话，他必须使人相信他是个&ldquo;煤黑子&rdquo;。想到了这个，也马上这么办了，他心中痛快了些，好似危险已过，而眼前就是北平了。他必须稳稳当当的快到城里，因为他身上没有一个钱，没有一点干粮，不能再多耗时间。想到这里，他想骑上骆驼，省些力气可以多挨一会儿饥饿。可是不敢去骑，即使很稳当，也得先教骆驼跪下，他才能上去；时间是值钱的，不能再麻烦。况且，他要是上了那么高，便更不容易看清脚底下，骆驼若是摔倒，他也得陪着。不，就这样走吧。</p>\r\n\r\n<p>大概的他觉出是顺着大路走呢；方向，地点，都有些茫然。夜深了，多日的疲乏，与逃走的惊惧，使他身心全不舒服。及至走出来一些路，脚步是那么平匀，缓慢，他渐渐的仿佛困倦起来。夜还很黑，空中有些湿冷的雾气，心中更觉得渺茫。用力看看地，地上老象有一岗一岗的，及至放下脚去，却是平坦的。这种小心与受骗教他更不安静，几乎有些烦躁。爽性不去管地上了，眼往平里看，脚擦着地走。四外什么也看不见，就好象全世界的黑暗都在等着他似的，由黑暗中迈步，再走入黑暗中；身后跟着那不声不响的骆驼。</p>\r\n\r\n<p>外面的黑暗渐渐习惯了，心中似乎停止了活动，他的眼不由的闭上了。不知道是往前走呢，还是已经站住了，心中只觉得一浪一浪的波动，似一片波动的黑海，黑暗与心接成一气，都渺茫，都起落，都恍惚。忽然心中一动，象想起一些什么，又似乎是听见了一些声响，说不清；可是又睁开了眼。他确是还往前走呢，忘了刚才是想起什么来，四外也并没有什么动静。心跳了一阵，渐渐又平静下来。他嘱咐自己不要再闭上眼，也不要再乱想；快快的到城里是第一件要紧的事。可是心中不想事，眼睛就很容易再闭上，他必须想念着点儿什么，必须醒着。他知道一旦倒下，他可以一气睡三天。想什么呢？他的头有些发晕，身上潮渌渌的难过，头发里发痒，两脚发酸，口中又干又涩。他想不起别的，只想可怜自己。可是，连自己的事也不大能详细的想了，他的头是那么虚空昏胀，仿佛刚想起自己，就又把自己忘记了，象将要灭的蜡烛，连自己也不能照明白了似的。再加上四围的黑暗，使他觉得象在一团黑气里浮荡，虽然知道自己还存在着，还往前迈步，可是没有别的东西来证明他准是在哪里走，就很象独自在荒海里浮着那样不敢相信自己。他永远没尝受过这种惊疑不定的难过，与绝对的寂闷。平日，他虽不大喜欢交朋友，可是一个人在日光下，有太阳照着他的四肢，有各样东西呈现在目前，他不至于害怕。现在，他还不害怕，只是不能确定一切，使他受不了。设若骆驼们要是象骡马那样不老实，也许倒能教他打起精神去注意它们，而骆驼偏偏是这么驯顺，驯顺得使他不耐烦；在心神最恍惚的时候，他忽然怀疑骆驼是否还在他的背后，教他吓一跳；他似乎很相信这几个大牲口会轻轻的钻入黑暗的岔路中去，而他一点也不晓得，象拉着块冰那样能渐渐的化尽。</p>\r\n\r\n<p>不知道在什么时候，他坐下了。若是他就是这么死去，就是死后有知，他也不会记得自己是怎么坐下的，和为什么坐下的。坐了五分钟，也许是一点钟，他不晓得。他也不知道他是先坐下而后睡着，还是先睡着而后坐下的。大概他是先睡着了而后坐下的，因为他的疲乏已经能使他立着睡去的。</p>\r\n\r\n<p>他忽然醒了。不是那种自自然然的由睡而醒，而是猛的一吓，象由一个世界跳到另一个世界，都在一睁眼的工夫里。看见的还是黑暗，可是很清楚的听见一声鸡鸣，是那么清楚，好象有个坚硬的东西在他脑中划了一下。他完全清醒过来。骆驼呢？他顾不得想别的。绳子还在他手中，骆驼也还在他旁边。他心中安静了。懒得起来。身上酸懒，他不想起来，可也不敢再睡。他得想，细细的想，好主意。就是在这个时候，他想起他的车，而喊出&ldquo;凭什么？&rdquo;</p>\r\n\r\n<p>&ldquo;凭什么？&rdquo;但是空喊是一点用处没有的。他去摸摸骆驼，他始终还不知自己拉来几匹。摸清楚了，一共三匹。他不觉得这是太多，还是太少；他把思想集中到这三匹身上，虽然还没想妥一定怎么办，可是他渺茫的想到，他的将来全仗着这三个牲口。</p>\r\n\r\n<p>&ldquo;为什么不去卖了它们，再买上一辆车呢？&rdquo;他几乎要跳起来了！可是他没动，好象因为先前没想到这样最自然最省事的办法而觉得应当惭愧似的。喜悦胜过了惭愧，他打定了主意：刚才不是听到鸡鸣么？即使鸡有时候在夜间一两点钟就打鸣，反正离天亮也不甚远了。有鸡鸣就必有村庄，说不定也许是北辛安吧？那里有养骆驼的，他得赶快的走，能在天亮的时候赶到，把骆驼出了手，他可以一进城就买上一辆车。兵荒马乱的期间，车必定便宜一些；他只顾了想买车，好似卖骆驼是件毫无困难的事。</p>\r\n\r\n<p>想到骆驼与洋车的关系，他的精神壮了起来，身上好似一向没有什么不舒服的地方。假若他想到拿这三匹骆驼能买到一百亩地，或是可以换几颗珍珠，他也不会这样高兴。他极快的立起来，扯起骆驼就走。他不晓得现在骆驼有什么行市，只听说过在老年间，没有火车的时候，一条骆驼要值一个大宝①，因为骆驼力气大，而吃得比骡马还省。他不希望得三个大宝，只盼望换个百儿八十的，恰好够买一辆车的。越走天越亮了；不错，亮处是在前面，他确是朝东走呢。即使他走错了路，方向可是不差；山在西，城在东，他晓得这个。四外由一致的漆黑，渐渐能分出深浅，虽然还辨不出颜色，可是田亩远树已都在普遍的灰暗中有了形状。星星渐稀，天上罩着一层似云又似雾的灰气，暗淡，可是比以前高起许多去。祥子仿佛敢抬起头来了。他也开始闻见路旁的草味，也听见几声鸟鸣；因为看见了渺茫的物形，他的耳目口鼻好似都恢复了应有的作用。他也能看到自己身上的一切，虽然是那么破烂狼狈，可是能以相信自己确是还活着呢；好象噩梦初醒时那样觉得生命是何等的可爱。看完了他自己，他回头看了看骆驼&mdash;&mdash;和他一样的难看，也一样的可爱。正是牲口脱毛的时候，骆驼身上已经都露出那灰红的皮，只有东一缕西一块的挂着些零散的，没力量的，随时可以脱掉的长毛，象些兽中的庞大的乞丐。顶可怜的是那长而无毛的脖子，那么长，那么秃，弯弯的，愚笨的，伸出老远，象条失意的瘦龙。可是祥子不憎嫌它们，不管它们是怎样的不体面，到底是些活东西。他承认自己是世上最有运气的人，上天送给他三条足以换一辆洋车的活宝贝；这不是天天能遇到的事。他忍不住的笑了出来。</p>\r\n\r\n<p>灰天上透出些红色，地与远树显着更黑了；红色渐渐的与灰色融调起来，有的地方成为灰紫的，有的地方特别的红，而大部分的天色是葡萄灰的。又待了一会儿，红中透出明亮的金黄来，各种颜色都露出些光；忽然，一切东西都非常的清楚了。跟着，东方的早霞变成一片深红，头上的天显出蓝色。红霞碎开，金光一道一道的射出，横的是霞，直的是光，在天的东南角织成一部极伟大光华的蛛网：绿的田，树，野草，都由暗绿变为发光的翡翠。老松的干上染上了金红，飞鸟的翅儿闪起金光，一切的东西都带出笑意。祥子对着那片红光要大喊几声，自从一被大兵拉去，他似乎没看见过太阳，心中老在咒骂，头老低着，忘了还有日月，忘了老天。现在他自由的走着路，越走越光明，太阳给草叶的露珠一点儿金光，也照亮了祥子的眉发，照暖了他的心。他忘了一切困苦，一切危险，一切疼痛；不管身上是怎样褴褛污浊，太阳的光明与热力并没将他除外，他是生活在一个有光有热力的宇宙里；他高兴，他想欢呼！</p>\r\n\r\n<p>看看身上的破衣，再看看身后的三匹脱毛的骆驼，他笑了笑。就凭四条这么不体面的人与牲口，他想，居然能逃出危险，能又朝着太阳走路，真透着奇怪！不必再想谁是谁非了，一切都是天意，他以为。他放了心，缓缓的走着，自要老天保佑他，什么也不必怕。走到什么地方了？不想问了，虽然田间已有男女来作工。走吧，就是一时卖不出骆驼去，似乎也没大关系了；先到城里再说，他渴想再看见城市，虽然那里没有父母亲戚，没有任何财产，可是那到底是他的家，全个的城都是他的家，一到那里他就有办法。远处有个村子，不小的一个村子，村外的柳树象一排高而绿的护兵，低头看着那些矮矮的房屋，屋上浮着些炊烟。远远的听到村犬的吠声，非常的好听。他一直奔了村子去，不想能遇到什么俏事，仿佛只是表示他什么也不怕，他是好人，当然不怕村里的良民；现在人人都是在光明和平的阳光下。假若可能的话，他想要一点水喝；就是要不到水也没关系；他既没死在山中，多渴一会儿算得了什么呢？</p>\r\n\r\n<p><br />\r\n村犬向他叫，他没大注意；妇女和小孩儿们的注视他，使他不大自在了。他必定是个很奇怪的拉骆驼的，他想；要不然，大家为什么这样呆呆的看着他呢？他觉得非常的难堪：兵们不拿他当个人，现在来到村子里，大家又看他象个怪物！他不晓得怎样好了。他的身量，力气，一向使他自尊自傲，可是在过去的这些日子，无缘无故的他受尽了委屈与困苦。他从一家的屋脊上看过去，又看见了那光明的太阳，可是太阳似乎不象刚才那样可爱了！</p>\r\n\r\n<p>村中的唯一的一条大道上，猪尿马尿与污水汇成好些个发臭的小湖，祥子唯恐把骆驼滑倒，很想休息一下。道儿北有个较比阔气的人家，后边是瓦房，大门可是只拦着个木栅，没有木门，没有门楼。祥子心中一动；瓦房&mdash;&mdash;财主；木栅而没门楼&mdash;&mdash;养骆驼的主儿！好吧，他就在这儿休息会儿吧，万一有个好机会把骆驼打发出去呢！</p>\r\n\r\n<p>&ldquo;色！色！色！&rdquo;祥子叫骆驼们跪下；对于调动骆驼的口号，他只晓得&ldquo;色&hellip;&hellip;&rdquo;是表示跪下；他很得意的应用出来，特意叫村人们明白他并非是外行。骆驼们真跪下了，他自己也大大方方的坐在一株小柳树下。大家看他，他也看大家；他知道只有这样才足以减少村人的怀疑。坐了一会儿，院中出来个老者，蓝布小褂敞着怀，脸上很亮，一看便知道是乡下的财主。祥子打定了主意：&ldquo;老者，水现成吧？喝碗！&rdquo; &ldquo;啊！&rdquo;老者的手在胸前搓着泥卷，打量了祥子一眼，细细看了看三匹骆驼。&ldquo;有水！哪儿来的？&rdquo;&ldquo;西边！&rdquo;祥子不敢说地名，因为不准知道。&ldquo;西边有兵呀？&rdquo;老者的眼盯住祥子的军裤。&ldquo;教大兵裹了去，刚逃出来。&rdquo; &ldquo;啊！骆驼出西口没什么险啦吧？&rdquo; &ldquo;兵都入了山，路上很平安。&rdquo;&ldquo;嗯！&rdquo;老者慢慢点着头。&ldquo;你等等，我给你拿水去。&rdquo; 祥子跟了进去。到了院中，他看见了四匹骆驼。&ldquo;老者，留下我的三匹，凑一把儿吧？&rdquo; &ldquo;哼！一把儿？倒退三十年的话，我有过三把儿！年头儿变了，谁还喂得起骆驼！&rdquo;老头儿立住，呆呆的看着那四匹牲口。待了半天：&ldquo;前几天本想和街坊搭伙，把它们送到口外去放青①。东也闹兵，西也闹兵，谁敢走啊！在家里拉夏吧，看着就焦心，看着就焦心，瞧这些苍蝇！赶明儿天大热起来，再加上蚊子，眼看着好好的牲口活活受罪，真！&rdquo;老者连连的点头，似乎有无限的感慨与牢骚。&ldquo;老者，留下我的三匹，凑成一把儿到口外去放青。欢蹦乱跳的牲口，一夏天在这儿，准教苍蝇蚊子给拿个半死！&rdquo;祥子几乎是央求了。&ldquo;可是，谁有钱买呢？这年头不是养骆驼的年头了！&rdquo;&ldquo;留下吧，给多少是多少；我把它们出了手，好到城里去谋生！&rdquo;老者又细细看了祥子一番，觉得他绝不是个匪类。然后回头看了看门外的牲口，心中似乎是真喜欢那三匹骆驼&mdash;&mdash;明知买到手中并没好处，可是爱书的人见书就想买，养马的见了马就舍不得，有过三把儿骆驼的也是如此。况且祥子说可以贱卖呢；懂行的人得到个便宜，就容易忘掉东西买到手中有没有好处。&ldquo;小伙子，我要是钱富裕的话，真想留下！&rdquo;老者说了实话。&ldquo;干脆就留下吧，瞧着办得了！&rdquo;祥子是那么诚恳，弄得老头子有点不好意思了。&ldquo;说真的，小伙子；倒退三十年，这值三个大宝；现在的年头，又搭上兵荒马乱，我&mdash;&mdash;你还是到别处吃喝吆喝去吧！&rdquo;&ldquo;给多少是多少！&rdquo;祥子想不出别的话。他明白老者的话很实在，可是不愿意满世界去卖骆驼&mdash;&mdash;卖不出去，也许还出了别的毛病。</p>\r\n\r\n<p>&ldquo;你看，你看，二三十块钱真不好说出口来，可是还真不容易往外拿呢；这个年头，没法子！&rdquo;</p>\r\n\r\n<p>祥子心中也凉了些，二三十块？离买车还差得远呢！可是，第一他愿脆快办完，第二他不相信能这么巧再遇上个买主儿。&ldquo;老者，给多少是多少！&rdquo;</p>\r\n\r\n<p>&ldquo;你是干什么的，小伙子；看得出，你不是干这一行的！&rdquo;祥子说了实话。</p>\r\n\r\n<p>&ldquo;呕，你是拿命换出来的这些牲口！&rdquo;老者很同情祥子，而且放了心，这不是偷出来的；虽然和偷也差不远，可是究竟中间还隔着层大兵。兵灾之后，什么事儿都不能按着常理儿说。</p>\r\n\r\n<p>&ldquo;这么着吧，伙计，我给三十五块钱吧；我要说这不是个便<br />\r\n宜，我是小狗子；我要是能再多拿一块，也是个小狗子！我六十多</p>\r\n\r\n<p>了；哼，还教我说什么好呢！&rdquo;</p>\r\n\r\n<p>祥子没了主意。对于钱，他向来是不肯放松一个的。可是，在军队里这些日子，忽然听到老者这番诚恳而带有感情的话，他不好意思再争论了。况且，可以拿到手的三十五块现洋似乎比希望中的一万块更可靠，虽然一条命只换来三十五块钱的确是少一些！就单说三条大活骆驼，也不能，绝不能，只值三十五块大洋！可是，有什么法儿呢！&ldquo;骆驼算你的了，老者！我就再求一件事，给我找件小褂，和一点吃的！&rdquo;</p>\r\n\r\n<p>&ldquo;那行！&rdquo;</p>\r\n\r\n<p>祥子喝了一气凉水，然后拿着三十五块很亮的现洋，两个棒子面饼子，穿着将护到胸际的一件破白小褂，要一步迈到城里去！</p>',NULL,NULL,'{\"meta_title\": null, \"meta_keywords\": null, \"extra_features\": null, \"meta_description\": null}',2,0,0,0,1,'2020-03-09 15:04:42','2020-03-09 15:06:30',NULL,NULL);
/*!40000 ALTER TABLE `chapters` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `comment`
--

DROP TABLE IF EXISTS `comment`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `comment` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `context` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `user_id` int(10) unsigned NOT NULL,
  `book_id` int(10) unsigned NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `comment`
--

LOCK TABLES `comment` WRITE;
/*!40000 ALTER TABLE `comment` DISABLE KEYS */;
/*!40000 ALTER TABLE `comment` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `failed_jobs`
--

DROP TABLE IF EXISTS `failed_jobs`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `failed_jobs` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `connection` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `queue` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `exception` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `failed_jobs`
--

LOCK TABLES `failed_jobs` WRITE;
/*!40000 ALTER TABLE `failed_jobs` DISABLE KEYS */;
/*!40000 ALTER TABLE `failed_jobs` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `icons`
--

DROP TABLE IF EXISTS `icons`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `icons` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `icon` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `icons`
--

LOCK TABLES `icons` WRITE;
/*!40000 ALTER TABLE `icons` DISABLE KEYS */;
/*!40000 ALTER TABLE `icons` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `keywords`
--

DROP TABLE IF EXISTS `keywords`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `keywords` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `slug` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `keywords`
--

LOCK TABLES `keywords` WRITE;
/*!40000 ALTER TABLE `keywords` DISABLE KEYS */;
/*!40000 ALTER TABLE `keywords` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `menu_items`
--

DROP TABLE IF EXISTS `menu_items`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `menu_items` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL,
  `type` varchar(20) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `link` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `page_id` int(10) unsigned DEFAULT NULL,
  `parent_id` int(10) unsigned DEFAULT NULL,
  `lft` int(10) unsigned DEFAULT NULL,
  `rgt` int(10) unsigned DEFAULT NULL,
  `depth` int(10) unsigned DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `menu_items`
--

LOCK TABLES `menu_items` WRITE;
/*!40000 ALTER TABLE `menu_items` DISABLE KEYS */;
INSERT INTO `menu_items` VALUES (1,'topmenu','internal_link',NULL,NULL,NULL,NULL,NULL,NULL,'2020-02-28 11:30:52','2020-02-28 11:30:52',NULL),(2,'关于我们','page_link',NULL,2,1,NULL,NULL,NULL,'2020-02-28 11:31:38','2020-02-28 11:31:38',NULL);
/*!40000 ALTER TABLE `menu_items` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `migrations`
--

DROP TABLE IF EXISTS `migrations`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `migrations` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `migration` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=49 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `migrations`
--

LOCK TABLES `migrations` WRITE;
/*!40000 ALTER TABLE `migrations` DISABLE KEYS */;
INSERT INTO `migrations` VALUES (1,'2014_10_12_000000_create_users_table',1),(2,'2014_10_12_100000_create_password_resets_table',1),(3,'2019_08_19_000000_create_failed_jobs_table',1),(4,'2020_02_28_090744_create_permission_tables',2),(5,'2015_08_04_131614_create_settings_table',3),(6,'2016_05_25_121918_create_pages_table',4),(7,'2017_04_10_195926_change_extras_to_longtext',4),(8,'2016_05_05_115641_create_menu_items_table',5),(15,'2015_08_04_130507_create_article_tag_table',6),(16,'2015_08_04_130520_create_articles_table',6),(17,'2015_08_04_130551_create_categories_table',6),(18,'2015_08_04_131626_create_tags_table',6),(19,'2016_07_24_060017_add_slug_to_categories_table',6),(20,'2016_07_24_060101_add_slug_to_tags_table',6),(21,'2020_02_28_141108_create_user_addresses_table',7),(22,'2020_02_29_005018_add_morph_from_categories_table',8),(23,'2020_02_29_013402_add_morph_null_from_categories_table',9),(24,'2017_04_20_100848_create_monsters_table',10),(25,'2017_04_21_052454_create_monster_tag_table',10),(26,'2017_04_21_052455_create_monster_articles_table',10),(27,'2017_04_21_052456_create_monster_category_table',10),(28,'2017_12_18_075638_create_icons_table',10),(29,'2017_12_19_081247_create_products_table',10),(30,'2019_12_02_101119_add_browse_multiple_to_monsters_table',11),(31,'2020_02_27_021515_add_image_from_products_table',11),(32,'2020_02_27_091658_create_books_table',11),(33,'2020_02_27_092018_create_keywords_table',11),(34,'2020_02_27_092313_create_book_keyword_pivot_table',11),(35,'2020_02_27_093502_create_chapter_table',11),(36,'2020_02_27_100036_create_book_tag_pivot_table',12),(37,'2020_02_29_072603_add_attr_from_products_table',13),(38,'2020_02_29_072944_create_product_skus_table',14),(39,'2020_02_29_082124_add_attr_from_books_table',15),(40,'2020_02_29_084431_add_attr_from_chapters_table',16),(41,'2020_02_29_090009_add_attr_from_books_table',17),(42,'2020_03_06_122228_remove_category_id_from_products_table',18),(43,'2020_03_06_122540_remove_category_id_from_books_table',19),(44,'2020_03_06_142154_create_user_favorite_products_table',20),(45,'2020_03_08_054520_add_extras_from_users_table',21),(46,'2020_03_08_060301_add_openid_from_users_table',22),(47,'2020_03_09_111008_add_barcode_from_books_table',23),(48,'2020_03_09_111241_add_video_from_chapters_table',23);
/*!40000 ALTER TABLE `migrations` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `model_has_permissions`
--

DROP TABLE IF EXISTS `model_has_permissions`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `model_has_permissions` (
  `permission_id` bigint(20) unsigned NOT NULL,
  `model_type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `model_id` bigint(20) unsigned NOT NULL,
  PRIMARY KEY (`permission_id`,`model_id`,`model_type`),
  KEY `model_has_permissions_model_id_model_type_index` (`model_id`,`model_type`),
  CONSTRAINT `model_has_permissions_permission_id_foreign` FOREIGN KEY (`permission_id`) REFERENCES `permissions` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `model_has_permissions`
--

LOCK TABLES `model_has_permissions` WRITE;
/*!40000 ALTER TABLE `model_has_permissions` DISABLE KEYS */;
/*!40000 ALTER TABLE `model_has_permissions` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `model_has_roles`
--

DROP TABLE IF EXISTS `model_has_roles`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `model_has_roles` (
  `role_id` bigint(20) unsigned NOT NULL,
  `model_type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `model_id` bigint(20) unsigned NOT NULL,
  PRIMARY KEY (`role_id`,`model_id`,`model_type`),
  KEY `model_has_roles_model_id_model_type_index` (`model_id`,`model_type`),
  CONSTRAINT `model_has_roles_role_id_foreign` FOREIGN KEY (`role_id`) REFERENCES `roles` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `model_has_roles`
--

LOCK TABLES `model_has_roles` WRITE;
/*!40000 ALTER TABLE `model_has_roles` DISABLE KEYS */;
INSERT INTO `model_has_roles` VALUES (1,'App\\Models\\BackpackUser',1),(1,'App\\Models\\BackpackUser',2);
/*!40000 ALTER TABLE `model_has_roles` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `monster_article`
--

DROP TABLE IF EXISTS `monster_article`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `monster_article` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `monster_id` int(10) unsigned NOT NULL,
  `article_id` int(10) unsigned NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `monster_article`
--

LOCK TABLES `monster_article` WRITE;
/*!40000 ALTER TABLE `monster_article` DISABLE KEYS */;
/*!40000 ALTER TABLE `monster_article` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `monster_category`
--

DROP TABLE IF EXISTS `monster_category`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `monster_category` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `monster_id` int(10) unsigned NOT NULL,
  `category_id` int(10) unsigned NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `monster_category`
--

LOCK TABLES `monster_category` WRITE;
/*!40000 ALTER TABLE `monster_category` DISABLE KEYS */;
/*!40000 ALTER TABLE `monster_category` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `monster_tag`
--

DROP TABLE IF EXISTS `monster_tag`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `monster_tag` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `monster_id` int(10) unsigned NOT NULL,
  `tag_id` int(10) unsigned NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `monster_tag`
--

LOCK TABLES `monster_tag` WRITE;
/*!40000 ALTER TABLE `monster_tag` DISABLE KEYS */;
/*!40000 ALTER TABLE `monster_tag` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `monsters`
--

DROP TABLE IF EXISTS `monsters`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `monsters` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `address` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `base64_image` mediumblob,
  `browse` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `checkbox` tinyint(1) DEFAULT NULL,
  `wysiwyg` text COLLATE utf8mb4_unicode_ci,
  `color` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `color_picker` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `date` date DEFAULT NULL,
  `date_picker` date DEFAULT NULL,
  `start_date` date DEFAULT NULL,
  `end_date` date DEFAULT NULL,
  `datetime` datetime DEFAULT NULL,
  `datetime_picker` datetime DEFAULT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `hidden` int(11) DEFAULT NULL,
  `icon_picker` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `image` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `month` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `number` int(11) DEFAULT NULL,
  `float` double(8,2) DEFAULT NULL,
  `password` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `radio` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `range` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `select` int(11) DEFAULT NULL,
  `select_from_array` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `select2` int(11) DEFAULT NULL,
  `select2_from_ajax` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `select2_from_array` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `simplemde` text COLLATE utf8mb4_unicode_ci,
  `summernote` text COLLATE utf8mb4_unicode_ci,
  `table` text COLLATE utf8mb4_unicode_ci,
  `textarea` text COLLATE utf8mb4_unicode_ci,
  `text` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `tinymce` text COLLATE utf8mb4_unicode_ci,
  `upload` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `upload_multiple` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `url` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `video` text COLLATE utf8mb4_unicode_ci,
  `week` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `extras` text COLLATE utf8mb4_unicode_ci,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `browse_multiple` text COLLATE utf8mb4_unicode_ci,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `monsters`
--

LOCK TABLES `monsters` WRITE;
/*!40000 ALTER TABLE `monsters` DISABLE KEYS */;
/*!40000 ALTER TABLE `monsters` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `pages`
--

DROP TABLE IF EXISTS `pages`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `pages` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `template` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `slug` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `content` text COLLATE utf8mb4_unicode_ci,
  `extras` longtext COLLATE utf8mb4_unicode_ci,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `pages`
--

LOCK TABLES `pages` WRITE;
/*!40000 ALTER TABLE `pages` DISABLE KEYS */;
INSERT INTO `pages` VALUES (1,'services','Payment','付款方式','payment','<p>付款方式, 支付微信，支付宝付款</p>','{\"meta_title\":\"\\u4ed8\\u6b3e\\u65b9\\u5f0f title\",\"meta_description\":\"\\u4ed8\\u6b3e\\u65b9\\u5f0f Description\",\"meta_keywords\":\"\\u4ed8\\u6b3e\\u65b9\\u5f0f Keywords\"}','2020-02-28 09:38:34','2020-02-28 11:08:22',NULL),(2,'about_us','about us','关于我们','about-us','<p>关于我们, 隆回县共读书房。</p>',NULL,'2020-02-28 09:42:25','2020-02-28 09:42:25',NULL);
/*!40000 ALTER TABLE `pages` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `password_resets`
--

DROP TABLE IF EXISTS `password_resets`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `password_resets` (
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  KEY `password_resets_email_index` (`email`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `password_resets`
--

LOCK TABLES `password_resets` WRITE;
/*!40000 ALTER TABLE `password_resets` DISABLE KEYS */;
/*!40000 ALTER TABLE `password_resets` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `permissions`
--

DROP TABLE IF EXISTS `permissions`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `permissions` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `guard_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `permissions`
--

LOCK TABLES `permissions` WRITE;
/*!40000 ALTER TABLE `permissions` DISABLE KEYS */;
INSERT INTO `permissions` VALUES (1,'编辑','web','2020-02-28 14:01:18','2020-02-28 14:01:18'),(2,'后台管理','web','2020-02-29 06:32:28','2020-02-29 06:32:28');
/*!40000 ALTER TABLE `permissions` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `product_skus`
--

DROP TABLE IF EXISTS `product_skus`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `product_skus` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `price` decimal(10,2) NOT NULL,
  `stock` int(10) unsigned NOT NULL,
  `product_id` bigint(20) unsigned NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `product_skus_product_id_foreign` (`product_id`),
  CONSTRAINT `product_skus_product_id_foreign` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=94 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `product_skus`
--

LOCK TABLES `product_skus` WRITE;
/*!40000 ALTER TABLE `product_skus` DISABLE KEYS */;
INSERT INTO `product_skus` VALUES (1,'特别版','狼王梦-特别版',23.40,350,1,'2020-02-29 14:11:31','2020-03-06 14:08:17'),(2,'omnis','Quia repellat dolor rerum quisquam accusantium amet velit.',7660.00,84519,32,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(3,'amet','Perspiciatis sunt delectus eveniet iste ex ducimus deserunt blanditiis.',5700.00,32182,32,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(4,'quam','Qui error vitae qui natus.',1015.00,74795,32,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(5,'consequatur','Quia cum officiis totam.',9114.00,82019,33,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(6,'ut','Rerum consequuntur quaerat perferendis non sequi modi dolorem fugit.',6482.00,83886,33,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(7,'quam','Est animi error officia nobis fuga consectetur quia quod.',5284.00,12095,33,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(8,'ratione','Et quia iste architecto libero ut impedit ad harum.',8748.00,5582,34,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(9,'aut','In fugit aliquid accusamus quam commodi.',1426.00,77222,34,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(10,'totam','Ut aliquam qui ullam non quae quos.',2915.00,57058,34,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(11,'sapiente','Mollitia libero non illo illo expedita aut dolor.',6578.00,83854,35,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(12,'aliquam','Accusantium ut odit aspernatur facere fugit praesentium.',9539.00,55662,35,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(13,'aut','Qui esse reiciendis et dolorem ut.',668.00,8370,35,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(14,'voluptas','Accusamus modi voluptatem quam voluptas et tempore.',7314.00,85021,36,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(15,'repudiandae','Eum aut delectus quis ut hic molestiae.',1331.00,26604,36,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(16,'voluptates','Aspernatur nam pariatur inventore maiores sequi.',6716.00,95128,36,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(17,'quam','Quam ab quibusdam totam voluptatem numquam.',5047.00,73203,37,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(18,'placeat','Quis fugit quia expedita quidem labore.',3628.00,65884,37,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(19,'molestiae','Quisquam id voluptatem tempora velit reiciendis numquam nesciunt harum.',9428.00,20075,37,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(20,'omnis','Iusto cumque nam vero mollitia ratione.',6282.00,85866,38,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(21,'reprehenderit','Pariatur quasi at qui quam ratione eos.',9605.00,91062,38,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(22,'vel','Minima quod voluptatem et quo quibusdam.',8877.00,80215,38,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(23,'corporis','Ducimus vel facere dolorem ut.',6234.00,98703,39,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(24,'aliquam','Placeat non sint similique ut quae at similique.',6819.00,23804,39,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(25,'quisquam','Sunt amet soluta dolor eaque tempore iusto veniam.',8136.00,86081,39,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(26,'et','Libero voluptatem assumenda aut aperiam vitae itaque.',51.00,32451,40,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(27,'blanditiis','Sed dolores quia aperiam deserunt id nisi dicta saepe.',9475.00,40686,40,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(28,'ea','Qui fugiat eos labore sit.',6351.00,58921,40,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(29,'et','Officiis voluptate explicabo sequi ut ut ea et.',6721.00,37439,41,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(30,'quos','Sit voluptatem nihil quis sint maiores veniam qui.',5275.00,40419,41,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(31,'ut','Qui iste dolore fugit dolores occaecati.',8874.00,29634,41,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(32,'eveniet','At et nam cumque.',2971.00,95883,42,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(33,'id','Quam fuga nihil autem ex.',7001.00,15247,42,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(34,'qui','Magni quos totam sunt ipsam.',8771.00,87627,42,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(35,'molestiae','Perspiciatis voluptate magnam sit quod laudantium.',5633.00,79986,43,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(36,'molestiae','Unde qui iusto aperiam optio quia sunt porro.',5506.00,73800,43,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(37,'aut','Ex natus incidunt tenetur id et.',1557.00,61300,43,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(38,'amet','Nulla id quos a cumque.',199.00,72504,44,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(39,'qui','Voluptatem minima dolores omnis illum ducimus soluta.',2078.00,24798,44,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(40,'provident','Ut quo ex at quis animi fuga voluptates.',1682.00,36383,44,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(41,'ut','Ab officia quos neque expedita voluptate ducimus.',7800.00,67905,45,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(42,'commodi','Aut aspernatur ea tenetur culpa modi corrupti consequatur.',8117.00,17225,45,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(43,'non','Eum molestias aut dolorum vel reprehenderit minima.',7978.00,57435,45,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(44,'similique','Corrupti eius numquam est id pariatur et placeat.',6876.00,88124,46,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(45,'magni','Odio voluptatem non et eveniet hic.',5559.00,92102,46,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(46,'nesciunt','Laboriosam exercitationem occaecati quis et.',3942.00,52662,46,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(47,'consequatur','Rerum maiores eaque aut commodi.',6635.00,99627,47,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(48,'quaerat','Architecto facere et aut consequatur iure.',7350.00,61517,47,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(49,'consectetur','Veniam sunt hic officia eligendi perferendis ipsam.',8204.00,45248,47,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(50,'fugiat','Atque eveniet suscipit quis iusto fugiat.',6532.00,39064,48,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(51,'excepturi','Aspernatur exercitationem deleniti voluptatem vel.',3453.00,9624,48,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(52,'sequi','Amet doloribus sed perferendis quaerat odit voluptatem.',2661.00,45323,48,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(53,'et','Quis ipsa ab accusantium nemo exercitationem atque quia perferendis.',5028.00,60066,49,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(54,'sed','Dolor eos voluptates ea.',6214.00,99229,49,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(55,'odit','Quis fugit doloremque atque aspernatur a est sint.',9352.00,2683,49,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(56,'sint','Modi delectus tempore culpa ea.',6207.00,16987,50,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(57,'dolor','Commodi occaecati sint cupiditate rem sit.',1913.00,32298,50,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(58,'excepturi','Dolorem vero quibusdam commodi mollitia neque.',1561.00,93980,50,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(59,'excepturi','Laudantium dolores laudantium ex assumenda alias a.',8443.00,39401,51,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(60,'reprehenderit','Vitae neque debitis provident ipsa voluptas eos architecto.',7274.00,36647,51,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(61,'debitis','Commodi et qui quidem doloribus vero facere.',532.00,73502,51,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(62,'amet','Libero cumque blanditiis qui reprehenderit a inventore.',6936.00,46551,52,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(63,'quo','Debitis aspernatur voluptas et placeat qui mollitia.',415.00,72093,52,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(64,'autem','Voluptatem consectetur cumque ut ea ipsam esse quia.',7483.00,68359,52,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(65,'debitis','In quia doloremque libero exercitationem pariatur.',4772.00,10397,53,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(66,'qui','Neque tempora quia molestiae rerum ex.',6978.00,10992,53,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(67,'qui','Et distinctio dolorum eum rerum vel omnis.',3751.00,57688,53,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(68,'ipsam','At dignissimos et sequi ut.',932.00,50779,54,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(69,'vel','Perspiciatis minus consequatur consequatur aut et.',7421.00,26425,54,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(70,'commodi','Iste consequatur nobis eos nemo rerum.',3468.00,5286,54,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(71,'sequi','Aut voluptatibus itaque reiciendis cum commodi.',5301.00,86552,55,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(72,'eos','Doloremque est iste et quisquam atque.',2208.00,67475,55,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(73,'aperiam','Ut nam ut eum in quam.',490.00,16594,55,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(74,'et','Asperiores vero nihil temporibus ea magnam consequuntur est.',695.00,18775,56,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(75,'nihil','Et minima nam nostrum laudantium nesciunt vel.',4315.00,37411,56,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(76,'non','At possimus voluptatum ea facere nihil voluptate.',1493.00,25433,56,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(77,'hic','Veritatis dolorem et et impedit iusto voluptate.',9934.00,96957,57,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(78,'autem','Consequatur expedita aut et quam.',1051.00,97251,57,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(79,'dignissimos','Aperiam omnis nulla voluptatem esse nisi delectus occaecati ducimus.',9434.00,14407,57,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(80,'qui','Quia alias nemo et.',9797.00,47148,58,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(81,'quo','Repudiandae aliquam animi unde qui quia quidem.',7575.00,42287,58,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(82,'repellat','Suscipit itaque assumenda voluptas aliquam recusandae officia.',2256.00,39299,58,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(83,'maiores','Esse vel distinctio fugiat mollitia molestiae vitae asperiores exercitationem.',8677.00,14137,59,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(84,'et','Quia dolorum ex libero et tempora.',2842.00,28433,59,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(85,'iste','Voluptas deleniti omnis saepe molestiae.',9849.00,62968,59,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(86,'et','Qui minima omnis dolor fugit reprehenderit.',6984.00,50973,60,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(87,'quasi','Nulla in modi unde perspiciatis velit.',4810.00,47645,60,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(88,'voluptates','Vitae quod totam ab sint qui voluptatem.',8896.00,1989,60,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(89,'hic','Est aspernatur et esse et aliquid.',6355.00,45493,61,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(90,'qui','Impedit cupiditate asperiores exercitationem fugiat quia suscipit eos.',5370.00,97935,61,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(91,'est','In ab occaecati voluptatibus et officiis exercitationem laudantium.',4522.00,11258,61,'2020-03-06 13:15:51','2020-03-06 13:15:51'),(92,'沈石溪共读书房版本','沈石溪共读书房版本',35.89,100,1,'2020-03-06 13:46:18','2020-03-06 13:46:18'),(93,'骆驼祥子特别版本','11骆驼祥子特别版本描述',35.89,100,62,'2020-03-06 13:49:44','2020-03-06 13:49:44');
/*!40000 ALTER TABLE `product_skus` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `products`
--

DROP TABLE IF EXISTS `products`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `products` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `name` json NOT NULL,
  `description` json DEFAULT NULL,
  `details` json DEFAULT NULL,
  `features` json DEFAULT NULL,
  `price` double NOT NULL,
  `images` json DEFAULT NULL,
  `extras` json DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `on_sale` tinyint(1) NOT NULL DEFAULT '1',
  `rating` double(8,2) NOT NULL DEFAULT '5.00',
  `image` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `sold_count` int(10) unsigned NOT NULL DEFAULT '0',
  `review_count` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=63 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `products`
--

LOCK TABLES `products` WRITE;
/*!40000 ALTER TABLE `products` DISABLE KEYS */;
INSERT INTO `products` VALUES (1,'{\"zh-CN\": \"狼王梦\"}','{\"zh-CN\": \"<p>编辑推荐</p>\\r\\n\\r\\n<p>沈石溪，中国当代著名的动物小说作家，被誉为&ldquo;动物小说大王&rdquo;。他的动物小说作品精神内涵丰富厚重，兼具文学性、知识性和社会性，代表了当代动物小说创作领域的重要成就。在精彩的文字之外，他在小说中更提倡一种&ldquo;生态道德&rdquo;，他笔下那些丛林、高山、雪原的动物们，在大自然的生态法则和优胜劣汰的严酷条律下，表现出绝地生存的勇气、荒原绽放的野性和死生悲欢的传奇。</p>\\r\\n\\r\\n<p>&ldquo;动物小说大王沈石溪品藏书系&rdquo;是浙少社为沈石溪量身打造的重磅书系，该书系自2008年推出截止2017年12月，陆续出版图书三十余册，整体销售码洋达到六个亿，销售册数近4000万册，缔造了当代童书出版的奇迹。</p>\\r\\n\\r\\n<p>2018年恰逢品藏书系出版10周年，也是沈石溪先生动物小说创作四十周年纪念。此次全新升级改版会大致围绕四方面展开：</p>\\r\\n\\r\\n<p>首先，将在原先版本的基础上对文字进行细致的编校与修订；第二，优化附录部分的动物档案板块，删减不必要不准确的文字，增添与时俱进的内容；第三，丰富作者创作谈和序言部分；第四，在保留原封面经典设计元素和视觉效果的基础上，对升级版进行有效优化与提升，以更好地适应当下市场的审美需求和出版品味。</p>\\r\\n\\r\\n<p>品藏书系升级版将分批次有序推出，计划先推出作者代表性与影响力的36部作品。</p>\\r\\n\\r\\n<p>&nbsp;</p>\\r\\n\\r\\n<p>内容简介</p>\\r\\n\\r\\n<p>&nbsp; &nbsp; &nbsp; 本书写的是一匹充满智慧的狼，用一生的时间来完成自己的梦想。丈夫没了，还有儿子，儿子没了，还有女儿。为了那梦寐以求的狼王宝座，它浪费了大量青春，它葬送了美好爱情，它放弃了宝贵生命。命运之神啊，为何总是与它擦肩而过？它走了，只留下无限遗憾和永久的梦&hellip;&hellip;</p>\\r\\n\\r\\n<p>作者简介</p>\\r\\n\\r\\n<p>&nbsp; &nbsp; &nbsp; 沈石溪，著名儿童文学作家，被誉为&ldquo;中国动物小说大王&rdquo;。中国作家协会儿童文学委员会委员、上海作家协会理事，曾获中国作家协会全国优秀儿童文学奖、中国图书奖、冰心儿童文学新作奖大奖、台湾杨唤儿童文学奖等多种奖项，是少有的连续数届荣获全国优秀儿童文学奖的实力作家。<br />\\r\\n　　沈石溪的作品自八十年代即在文坛引起瞩目，其以《狼王梦》《第七条猎狗》《最后一头战象》《再被狐狸骗一次》《混血豺王》等为代表的作品，历经岁月洗礼而在读者群中风靡不衰。其作品在台湾以及东南亚等地都享有盛誉。</p>\\r\\n\\r\\n<p>目　　录</p>\\r\\n\\r\\n<p>狼王梦<br />\\r\\n第一章 绝境分娩<br />\\r\\n第二章 培养黑仔<br />\\r\\n第三章 魂断捕兽夹<br />\\r\\n第四章 重塑王者品性<br />\\r\\n第五章 寄望后代<br />\\r\\n第六章 血洒碧空<br />\\r\\n狼种<br />\\r\\n一 被淘汰的警犬<br />\\r\\n二 阴差阳错进了马戏团<br />\\r\\n三 扮演大灰狼<br />\\r\\n四 鲜花和掌声不属于它<br />\\r\\n五 遭哈巴狗暗算<br />\\r\\n六 恶狼？好狗？<br />\\r\\n七 野外遭遇云豹<br />\\r\\n八 热血洗冤<br />\\r\\n动物档案&mdash;&mdash;狼<br />\\r\\n闯入动物世界<br />\\r\\n获奖记录<br />\\r\\n珍藏相册</p>\"}','{\"zh-CN\": null}','{\"zh-CN\": null}',32.12,'[]','{\"meta_title\": null, \"meta_keywords\": null, \"extra_features\": null, \"meta_description\": null}','2020-02-29 13:55:52','2020-03-06 12:12:01',1,5.00,'uploads/images/products/63637bf600921186875d531a7b3cd345.jpg',0,0),(2,'{\"zh-CN\": \"nihil\"}','{\"zh-CN\": \"Rerum voluptatem amet explicabo hic quia.\"}',NULL,NULL,0,NULL,NULL,'2020-03-06 12:43:25','2020-03-06 12:43:25',1,2.00,NULL,0,0),(3,'{\"zh-CN\": \"quos\"}','{\"zh-CN\": \"Soluta consequatur et blanditiis eos numquam.\"}',NULL,NULL,0,NULL,NULL,'2020-03-06 12:43:25','2020-03-06 12:43:25',1,1.00,NULL,0,0),(4,'{\"zh-CN\": \"aut\"}','{\"zh-CN\": \"Quae praesentium enim et nemo.\"}',NULL,NULL,0,NULL,NULL,'2020-03-06 12:43:25','2020-03-06 12:43:25',1,5.00,NULL,0,0),(5,'{\"zh-CN\": \"pariatur\"}','{\"zh-CN\": \"Voluptatem ducimus ut aut et nulla expedita.\"}',NULL,NULL,0,NULL,NULL,'2020-03-06 12:43:25','2020-03-06 12:43:25',1,2.00,NULL,0,0),(6,'{\"zh-CN\": \"voluptatem\"}','{\"zh-CN\": \"Vel quod et unde nihil voluptas eligendi praesentium.\"}',NULL,NULL,0,NULL,NULL,'2020-03-06 12:43:25','2020-03-06 12:43:25',1,2.00,NULL,0,0),(7,'{\"zh-CN\": \"nobis\"}','{\"zh-CN\": \"Ratione quis eos similique quod dolores ea qui.\"}',NULL,NULL,0,NULL,NULL,'2020-03-06 12:43:25','2020-03-06 12:43:25',1,4.00,NULL,0,0),(8,'{\"zh-CN\": \"quia\"}','{\"zh-CN\": \"Quidem repellendus dolorem suscipit neque.\"}',NULL,NULL,0,NULL,NULL,'2020-03-06 12:43:25','2020-03-06 12:43:25',1,4.00,NULL,0,0),(9,'{\"zh-CN\": \"magni\"}','{\"zh-CN\": \"Accusamus aut expedita suscipit consequatur vel culpa.\"}',NULL,NULL,0,NULL,NULL,'2020-03-06 12:43:25','2020-03-06 12:43:25',1,1.00,NULL,0,0),(10,'{\"zh-CN\": \"autem\"}','{\"zh-CN\": \"Libero qui est nam dolores.\"}',NULL,NULL,0,NULL,NULL,'2020-03-06 12:43:25','2020-03-06 12:43:25',1,1.00,NULL,0,0),(11,'{\"zh-CN\": \"illo\"}','{\"zh-CN\": \"Culpa et est porro.\"}',NULL,NULL,0,NULL,NULL,'2020-03-06 12:43:25','2020-03-06 12:43:25',1,0.00,NULL,0,0),(12,'{\"zh-CN\": \"consectetur\"}','{\"zh-CN\": \"Aliquid distinctio placeat omnis.\"}',NULL,NULL,0,NULL,NULL,'2020-03-06 12:43:25','2020-03-06 12:43:25',1,3.00,NULL,0,0),(13,'{\"zh-CN\": \"sapiente\"}','{\"zh-CN\": \"A et quia provident.\"}',NULL,NULL,0,NULL,NULL,'2020-03-06 12:43:25','2020-03-06 12:43:25',1,0.00,NULL,0,0),(14,'{\"zh-CN\": \"culpa\"}','{\"zh-CN\": \"Dicta mollitia voluptatum saepe occaecati.\"}',NULL,NULL,0,NULL,NULL,'2020-03-06 12:43:25','2020-03-06 12:43:25',1,0.00,NULL,0,0),(15,'{\"zh-CN\": \"dolores\"}','{\"zh-CN\": \"Ullam unde exercitationem in soluta.\"}',NULL,NULL,0,NULL,NULL,'2020-03-06 12:43:25','2020-03-06 12:43:25',1,1.00,NULL,0,0),(16,'{\"zh-CN\": \"tempore\"}','{\"zh-CN\": \"Et quis enim magni architecto.\"}',NULL,NULL,0,NULL,NULL,'2020-03-06 12:43:25','2020-03-06 12:43:25',1,1.00,NULL,0,0),(17,'{\"zh-CN\": \"harum\"}','{\"zh-CN\": \"Deleniti quo quos eum est doloribus autem tempora.\"}',NULL,NULL,0,NULL,NULL,'2020-03-06 12:43:25','2020-03-06 12:43:25',1,3.00,NULL,0,0),(18,'{\"zh-CN\": \"modi\"}','{\"zh-CN\": \"Tenetur sit fugiat hic maxime.\"}',NULL,NULL,0,NULL,NULL,'2020-03-06 12:43:25','2020-03-06 12:43:25',1,0.00,NULL,0,0),(19,'{\"zh-CN\": \"eveniet\"}','{\"zh-CN\": \"Qui commodi nihil accusantium pariatur iusto unde perspiciatis.\"}',NULL,NULL,0,NULL,NULL,'2020-03-06 12:43:25','2020-03-06 12:43:25',1,1.00,NULL,0,0),(20,'{\"zh-CN\": \"incidunt\"}','{\"zh-CN\": \"Necessitatibus iusto unde velit ut et dolorem optio.\"}',NULL,NULL,0,NULL,NULL,'2020-03-06 12:43:25','2020-03-06 12:43:25',1,1.00,NULL,0,0),(21,'{\"zh-CN\": \"vero\"}','{\"zh-CN\": \"Ut repellat explicabo distinctio officiis quisquam autem sequi.\"}',NULL,NULL,0,NULL,NULL,'2020-03-06 12:43:25','2020-03-06 12:43:25',1,4.00,NULL,0,0),(22,'{\"zh-CN\": \"ratione\"}','{\"zh-CN\": \"Ullam aut accusantium et ut saepe ipsum.\"}',NULL,NULL,0,NULL,NULL,'2020-03-06 12:43:25','2020-03-06 12:43:25',1,2.00,NULL,0,0),(23,'{\"zh-CN\": \"sunt\"}','{\"zh-CN\": \"Mollitia est reprehenderit dolorum aut molestiae.\"}',NULL,NULL,0,NULL,NULL,'2020-03-06 12:43:25','2020-03-06 12:43:25',1,1.00,NULL,0,0),(24,'{\"zh-CN\": \"consequatur\"}','{\"zh-CN\": \"Distinctio maxime nam tempore voluptatem nihil ad facere quis.\"}',NULL,NULL,0,NULL,NULL,'2020-03-06 12:43:25','2020-03-06 12:43:25',1,4.00,NULL,0,0),(25,'{\"zh-CN\": \"dolore\"}','{\"zh-CN\": \"Dolore dolores voluptatem sit aut cupiditate ut.\"}',NULL,NULL,0,NULL,NULL,'2020-03-06 12:43:25','2020-03-06 12:43:25',1,2.00,NULL,0,0),(26,'{\"zh-CN\": \"corrupti\"}','{\"zh-CN\": \"Quo voluptas sapiente non dicta modi corporis.\"}',NULL,NULL,0,NULL,NULL,'2020-03-06 12:43:25','2020-03-06 12:43:25',1,1.00,NULL,0,0),(27,'{\"zh-CN\": \"nulla\"}','{\"zh-CN\": \"Ut porro consequatur aperiam nobis consequuntur molestias distinctio voluptate.\"}',NULL,NULL,0,NULL,NULL,'2020-03-06 12:43:25','2020-03-06 12:43:25',1,3.00,NULL,0,0),(28,'{\"zh-CN\": \"qui\"}','{\"zh-CN\": \"Et voluptas aliquid delectus ut nihil.\"}',NULL,NULL,0,NULL,NULL,'2020-03-06 12:43:25','2020-03-06 12:43:25',1,5.00,NULL,0,0),(29,'{\"zh-CN\": \"et\"}','{\"zh-CN\": \"Architecto maiores corporis explicabo fuga.\"}',NULL,NULL,0,NULL,NULL,'2020-03-06 12:43:25','2020-03-06 12:43:25',1,4.00,NULL,0,0),(30,'{\"zh-CN\": \"impedit\"}','{\"zh-CN\": \"Aperiam voluptatem qui et nemo optio aut.\"}',NULL,NULL,0,NULL,NULL,'2020-03-06 12:43:25','2020-03-06 12:43:25',1,3.00,NULL,0,0),(31,'{\"zh-CN\": \"eveniet\"}','{\"zh-CN\": \"Sit sapiente recusandae quasi ea quia et eligendi.\"}',NULL,NULL,0,NULL,NULL,'2020-03-06 12:43:25','2020-03-06 12:43:25',1,2.00,NULL,0,0),(32,'{\"zh-CN\": \"sequi\"}','{\"zh-CN\": \"Omnis est reiciendis odio ea ut facere.\"}',NULL,NULL,1015,NULL,NULL,'2020-03-06 13:15:50','2020-03-06 13:15:51',1,2.00,NULL,0,0),(33,'{\"zh-CN\": \"magni\"}','{\"zh-CN\": \"Placeat iure at debitis consequatur.\"}',NULL,NULL,5284,NULL,NULL,'2020-03-06 13:15:50','2020-03-06 13:15:51',1,5.00,NULL,0,0),(34,'{\"zh-CN\": \"iusto\"}','{\"zh-CN\": \"Veritatis nostrum omnis ipsa molestiae id et.\"}',NULL,NULL,1426,NULL,NULL,'2020-03-06 13:15:50','2020-03-06 13:15:51',1,5.00,NULL,0,0),(35,'{\"zh-CN\": \"doloremque\"}','{\"zh-CN\": \"Praesentium molestiae optio aliquid non iusto delectus.\"}',NULL,NULL,668,NULL,NULL,'2020-03-06 13:15:50','2020-03-06 13:15:51',1,0.00,NULL,0,0),(36,'{\"zh-CN\": \"qui\"}','{\"zh-CN\": \"Voluptatem nostrum libero dolor delectus.\"}',NULL,NULL,1331,NULL,NULL,'2020-03-06 13:15:50','2020-03-06 13:15:51',1,2.00,NULL,0,0),(37,'{\"zh-CN\": \"quae\"}','{\"zh-CN\": \"Voluptates quaerat tenetur architecto omnis facere.\"}',NULL,NULL,3628,NULL,NULL,'2020-03-06 13:15:50','2020-03-06 13:15:51',1,3.00,NULL,0,0),(38,'{\"zh-CN\": \"non\"}','{\"zh-CN\": \"Et saepe fuga nobis nihil dolorum.\"}',NULL,NULL,6282,NULL,NULL,'2020-03-06 13:15:50','2020-03-06 13:15:51',1,5.00,NULL,0,0),(39,'{\"zh-CN\": \"sequi\"}','{\"zh-CN\": \"Facere vitae minima et minima non.\"}',NULL,NULL,6234,NULL,NULL,'2020-03-06 13:15:50','2020-03-06 13:15:51',1,2.00,NULL,0,0),(40,'{\"zh-CN\": \"ea\"}','{\"zh-CN\": \"Deleniti sed aliquam eligendi excepturi voluptatem animi perferendis.\"}',NULL,NULL,51,NULL,NULL,'2020-03-06 13:15:50','2020-03-06 13:15:51',1,4.00,NULL,0,0),(41,'{\"zh-CN\": \"natus\"}','{\"zh-CN\": \"Totam nesciunt sunt molestias.\"}',NULL,NULL,5275,NULL,NULL,'2020-03-06 13:15:50','2020-03-06 13:15:51',1,0.00,NULL,0,0),(42,'{\"zh-CN\": \"consequatur\"}','{\"zh-CN\": \"Quia eligendi commodi architecto voluptatibus ut aperiam magni.\"}',NULL,NULL,2971,NULL,NULL,'2020-03-06 13:15:50','2020-03-06 13:15:51',1,0.00,NULL,0,0),(43,'{\"zh-CN\": \"sequi\"}','{\"zh-CN\": \"Rerum nam voluptates a sapiente voluptas expedita.\"}',NULL,NULL,1557,NULL,NULL,'2020-03-06 13:15:50','2020-03-06 13:15:51',1,2.00,NULL,0,0),(44,'{\"zh-CN\": \"nobis\"}','{\"zh-CN\": \"Fugiat possimus est consequatur aliquid nobis.\"}',NULL,NULL,199,NULL,NULL,'2020-03-06 13:15:50','2020-03-06 13:15:51',1,2.00,NULL,0,0),(45,'{\"zh-CN\": \"corporis\"}','{\"zh-CN\": \"Totam nihil velit at est.\"}',NULL,NULL,7800,NULL,NULL,'2020-03-06 13:15:50','2020-03-06 13:15:51',1,5.00,NULL,0,0),(46,'{\"zh-CN\": \"est\"}','{\"zh-CN\": \"Fuga hic corporis est quis.\"}',NULL,NULL,3942,NULL,NULL,'2020-03-06 13:15:50','2020-03-06 13:15:51',1,4.00,NULL,0,0),(47,'{\"zh-CN\": \"numquam\"}','{\"zh-CN\": \"Voluptatem a quia quos molestiae.\"}',NULL,NULL,6635,NULL,NULL,'2020-03-06 13:15:50','2020-03-06 13:15:51',1,3.00,NULL,0,0),(48,'{\"zh-CN\": \"nam\"}','{\"zh-CN\": \"Dolores qui cum totam repellendus eligendi rerum.\"}',NULL,NULL,2661,NULL,NULL,'2020-03-06 13:15:50','2020-03-06 13:15:51',1,5.00,NULL,0,0),(49,'{\"zh-CN\": \"quod\"}','{\"zh-CN\": \"Et aliquid quae molestiae velit labore laborum quam.\"}',NULL,NULL,5028,NULL,NULL,'2020-03-06 13:15:50','2020-03-06 13:15:51',1,5.00,NULL,0,0),(50,'{\"zh-CN\": \"rem\"}','{\"zh-CN\": \"Nulla vel aliquid at sunt perferendis placeat veritatis.\"}',NULL,NULL,1561,NULL,NULL,'2020-03-06 13:15:50','2020-03-06 13:15:51',1,2.00,NULL,0,0),(51,'{\"zh-CN\": \"mollitia\"}','{\"zh-CN\": \"Assumenda inventore veritatis magnam vitae nemo totam.\"}',NULL,NULL,532,NULL,NULL,'2020-03-06 13:15:50','2020-03-06 13:15:51',1,0.00,NULL,0,0),(52,'{\"zh-CN\": \"eligendi\"}','{\"zh-CN\": \"Enim repudiandae excepturi voluptate eaque voluptates quisquam.\"}',NULL,NULL,415,NULL,NULL,'2020-03-06 13:15:50','2020-03-06 13:15:51',1,1.00,NULL,0,0),(53,'{\"zh-CN\": \"facere\"}','{\"zh-CN\": \"Ipsum sed quia occaecati dolore.\"}',NULL,NULL,3751,NULL,NULL,'2020-03-06 13:15:50','2020-03-06 13:15:51',1,4.00,NULL,0,0),(54,'{\"zh-CN\": \"qui\"}','{\"zh-CN\": \"Veritatis optio dolor deleniti numquam.\"}',NULL,NULL,932,NULL,NULL,'2020-03-06 13:15:50','2020-03-06 13:15:51',1,1.00,NULL,0,0),(55,'{\"zh-CN\": \"iusto\"}','{\"zh-CN\": \"Eum suscipit sed adipisci distinctio quia sequi.\"}',NULL,NULL,490,NULL,NULL,'2020-03-06 13:15:50','2020-03-06 13:15:51',1,3.00,NULL,0,0),(56,'{\"zh-CN\": \"cupiditate\"}','{\"zh-CN\": \"Quis et iste unde.\"}',NULL,NULL,695,NULL,NULL,'2020-03-06 13:15:51','2020-03-06 13:15:51',1,4.00,NULL,0,0),(57,'{\"zh-CN\": \"est\"}','{\"zh-CN\": \"Doloremque id est est aspernatur in corporis.\"}',NULL,NULL,1051,NULL,NULL,'2020-03-06 13:15:51','2020-03-06 13:15:51',1,4.00,NULL,0,0),(58,'{\"zh-CN\": \"quos\"}','{\"zh-CN\": \"Accusamus ipsa dolorum fugiat quo quod dicta distinctio.\"}',NULL,NULL,2256,NULL,NULL,'2020-03-06 13:15:51','2020-03-06 13:15:51',1,0.00,NULL,0,0),(59,'{\"zh-CN\": \"reiciendis\"}','{\"zh-CN\": \"Et magnam ut omnis laudantium consequatur.\"}',NULL,NULL,2842,NULL,NULL,'2020-03-06 13:15:51','2020-03-06 13:15:51',1,2.00,NULL,0,0),(60,'{\"zh-CN\": \"cumque\"}','{\"zh-CN\": \"Aspernatur et voluptatem facilis dolorem.\"}',NULL,NULL,4810,NULL,NULL,'2020-03-06 13:15:51','2020-03-06 13:15:51',1,5.00,NULL,0,0),(61,'{\"zh-CN\": \"sit\"}','{\"zh-CN\": \"Omnis velit asperiores est cum.\"}',NULL,NULL,4522,NULL,NULL,'2020-03-06 13:15:51','2020-03-06 13:15:51',1,3.00,NULL,0,0),(62,'{\"zh-CN\": \"骆驼祥子\"}','{\"zh-CN\": \"<p>骆驼祥子 描述</p>\"}','{\"zh-CN\": null}','{\"zh-CN\": null}',32.12,'[]','{\"meta_title\": null, \"meta_keywords\": null, \"extra_features\": null, \"meta_description\": null}','2020-03-06 13:47:44','2020-03-06 13:47:44',1,5.00,'uploads/images/products/a5bcf5b1f7c7606bbc7d00e3c2cc6834.jpg',0,0);
/*!40000 ALTER TABLE `products` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `role_has_permissions`
--

DROP TABLE IF EXISTS `role_has_permissions`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `role_has_permissions` (
  `permission_id` bigint(20) unsigned NOT NULL,
  `role_id` bigint(20) unsigned NOT NULL,
  PRIMARY KEY (`permission_id`,`role_id`),
  KEY `role_has_permissions_role_id_foreign` (`role_id`),
  CONSTRAINT `role_has_permissions_permission_id_foreign` FOREIGN KEY (`permission_id`) REFERENCES `permissions` (`id`) ON DELETE CASCADE,
  CONSTRAINT `role_has_permissions_role_id_foreign` FOREIGN KEY (`role_id`) REFERENCES `roles` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `role_has_permissions`
--

LOCK TABLES `role_has_permissions` WRITE;
/*!40000 ALTER TABLE `role_has_permissions` DISABLE KEYS */;
INSERT INTO `role_has_permissions` VALUES (1,1),(2,1);
/*!40000 ALTER TABLE `role_has_permissions` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `roles`
--

DROP TABLE IF EXISTS `roles`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `roles` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `guard_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `roles`
--

LOCK TABLES `roles` WRITE;
/*!40000 ALTER TABLE `roles` DISABLE KEYS */;
INSERT INTO `roles` VALUES (1,'管理员','web','2020-02-28 14:00:38','2020-02-28 14:01:00');
/*!40000 ALTER TABLE `roles` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `settings`
--

DROP TABLE IF EXISTS `settings`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `settings` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `key` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `value` text COLLATE utf8mb4_unicode_ci,
  `field` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `active` tinyint(4) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `settings_key_unique` (`key`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `settings`
--

LOCK TABLES `settings` WRITE;
/*!40000 ALTER TABLE `settings` DISABLE KEYS */;
INSERT INTO `settings` VALUES (1,'contact_email','Contact form email address','The email address that all emails from the contact form will go to.','admin@updivision.com','{\"name\":\"value\",\"label\":\"Value\",\"type\":\"email\"}',1,NULL,NULL),(2,'contact_cc','Contact form CC field','Email addresses separated by comma, to be included as CC in the email sent by the contact form.','','{\"name\":\"value\",\"label\":\"Value\",\"type\":\"text\"}',1,NULL,NULL),(3,'contact_bcc','Contact form BCC field','Email addresses separated by comma, to be included as BCC in the email sent by the contact form.','','{\"name\":\"value\",\"label\":\"Value\",\"type\":\"email\"}',1,NULL,NULL),(4,'motto','Motto','Website motto','this is the value','{\"name\":\"value\",\"label\":\"Value\",\"type\":\"textarea\"}',1,NULL,NULL);
/*!40000 ALTER TABLE `settings` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tags`
--

DROP TABLE IF EXISTS `tags`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tags` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `slug` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `tags_slug_unique` (`slug`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tags`
--

LOCK TABLES `tags` WRITE;
/*!40000 ALTER TABLE `tags` DISABLE KEYS */;
INSERT INTO `tags` VALUES (1,'教育','','2020-02-29 01:50:44','2020-02-29 01:50:44',NULL),(2,'童话','童话','2020-03-06 12:33:56','2020-03-06 12:35:53',NULL),(3,'励志','励志','2020-03-06 12:34:38','2020-03-06 12:35:40',NULL);
/*!40000 ALTER TABLE `tags` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user_addresses`
--

DROP TABLE IF EXISTS `user_addresses`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `user_addresses` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `user_id` bigint(20) unsigned NOT NULL,
  `province` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `city` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `district` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `address` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `zip` int(10) unsigned NOT NULL,
  `contact_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `contact_phone` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `last_used_at` datetime DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `user_addresses_user_id_foreign` (`user_id`),
  CONSTRAINT `user_addresses_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_addresses`
--

LOCK TABLES `user_addresses` WRITE;
/*!40000 ALTER TABLE `user_addresses` DISABLE KEYS */;
INSERT INTO `user_addresses` VALUES (1,1,'河北省','石家庄市','长安区','第45街道第904号',755300,'曲正业','18934955970',NULL,'2020-02-28 15:19:12','2020-02-28 15:19:12'),(2,1,'河北省','石家庄市','长安区','第17街道第462号',433600,'欧阳捷','15212584450',NULL,'2020-02-28 15:19:12','2020-02-28 15:19:12'),(3,1,'北京市','市辖区','东城区','第83街道第880号',667500,'杨鑫','18846827376',NULL,'2020-02-28 15:19:12','2020-02-28 15:19:12'),(7,2,'江苏省','泰州市','海陵区','地址166565',12367,'李玉平','13590486819',NULL,'2020-02-29 02:36:53','2020-02-29 04:49:46');
/*!40000 ALTER TABLE `user_addresses` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user_favorite_products`
--

DROP TABLE IF EXISTS `user_favorite_products`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `user_favorite_products` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `user_id` bigint(20) unsigned NOT NULL,
  `product_id` bigint(20) unsigned NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `user_favorite_products_user_id_foreign` (`user_id`),
  KEY `user_favorite_products_product_id_foreign` (`product_id`),
  CONSTRAINT `user_favorite_products_product_id_foreign` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE,
  CONSTRAINT `user_favorite_products_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_favorite_products`
--

LOCK TABLES `user_favorite_products` WRITE;
/*!40000 ALTER TABLE `user_favorite_products` DISABLE KEYS */;
INSERT INTO `user_favorite_products` VALUES (2,2,1,'2020-03-06 14:36:53','2020-03-06 14:36:53');
/*!40000 ALTER TABLE `user_favorite_products` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `users` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `password` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `remember_token` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `extras` json DEFAULT NULL,
  `phonenumber` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `openid` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` VALUES (1,'admin','149748384@qq.com',NULL,'$2y$10$ew7RNNktGpEQS7.j5rCKSuts7Mr/KE2QmC3xOB7MjSWjchtP9wAYi',NULL,'2020-02-28 09:25:30','2020-02-28 09:25:30',NULL,NULL,NULL),(2,'kenny','liyuping1984@gmail.com','2020-02-28 13:58:17','$2y$10$OfKXl/Hx5SmCeTz5l6Ii.u6q7vmW33xngGfCzBwJAUKFilPLv5Uz.','IIVkBk9IAHBVIR4Rin3B6Va2COaNbVz47UJ0iOBwBfi4YJqwaR0Z9hlHN4MW','2020-02-28 13:42:33','2020-02-28 13:58:17',NULL,NULL,NULL);
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2020-03-09 15:56:19
